[
    {
        "show_id": 1,
        "name": "Piloto",
        "season": 1,
        "episode": 1,
        "description": "O bilionário Oliver Queen retorna à sua cidade após passar cinco anos em uma ilha deserta, mas ele não é mais o mesmo homem.",
        "when": "2012-10-10"
    },
    {
        "show_id": 1,
        "name": "Honra Teu Pai",
        "season": 1,
        "episode": 2,
        "description": "Oliver já tem seu próximo alvo: Martin Somers, um criminoso ligado à Tríade Chinesa que está sendo processado por Laurel.",
        "when": "2012-10-17"
    },
    {
        "show_id": 1,
        "name": "Pistoleiros Solitários",
        "season": 1,
        "episode": 3,
        "description": "Quando um assassino profissional mata um dos alvos de Oliver, ele pede ajuda ao detetive Lance. Enquanto isso, Laurel e Tommy se encontram em uma situação constrangedora.",
        "when": "2012-10-24"
    },
    {
        "show_id": 1,
        "name": "Um Homem Inocente",
        "season": 1,
        "episode": 4,
        "description": "Ao investigar um caso de assassinato, Oliver percebe que um dos alvos de sua lista incriminou um homem inocente",
        "when": "2012-10-31"
    },
    {
        "show_id": 1,
        "name": "Danificado",
        "season": 1,
        "episode": 5,
        "description": "Quando Oliver é preso por assassinato, ele insiste que Laurel o represente no tribunal. Ela aceita o caso, entrando em conflito com seu próprio pai.",
        "when": "2012-11-07"
    },
    {
        "show_id": 1,
        "name": "Legados",
        "season": 1,
        "episode": 6,
        "description": "Um bando de ladrões de banco fere gravemente um policial de folga durante um assalto, forçando Oliver a repensar sua missão.",
        "when": "2012-11-14"
    },
    {
        "show_id": 1,
        "name": "Musa de Fogo",
        "season": 1,
        "episode": 7,
        "description": "A Caçadora chega a Starling City e conquista Oliver com seus encantos. Enquanto isso, com seu julgamento abalado por eventos adversos, Tommy pede ajuda a Laurel.",
        "when": "2012-11-28"
    },
    {
        "show_id": 1,
        "name": "Vingança",
        "season": 1,
        "episode": 8,
        "description": "Oliver treina Helena para ser sua aliada, mas o desejo de vingança dela a leva a matar o líder da Tríade.",
        "when": "2012-12-05"
    },
    {
        "show_id": 1,
        "name": "Fim de Ano",
        "season": 1,
        "episode": 9,
        "description": "Determinado a recuperar o tempo perdido e voltar à normalidade, Oliver Queen resolve dar uma festa de Natal para sua família.",
        "when": "2012-12-12"
    },
    {
        "show_id": 1,
        "name": "Queimado",
        "season": 1,
        "episode": 10,
        "description": "Após ser derrotado pelo Arqueiro Negro, Oliver perde a confiança em si mesmo e decide deixar o Arqueiro Verde de lado por um tempo, mas Laurel precisa de sua ajuda.",
        "when": "2013-01-16"
    },
    {
        "show_id": 1,
        "name": "Confie, Mas Verifique",
        "season": 1,
        "episode": 11,
        "description": "Oliver suspeita que o mentor de Diggle seja o responsável por alguns assaltos a carros-fortes. Thea acha que Moira e Malcolm estão tendo um caso.",
        "when": "2013-01-23"
    },
    {
        "show_id": 1,
        "name": "Vertigo",
        "season": 1,
        "episode": 12,
        "description": "Thea se envolve em problemas com a lei após ser pega com uma droga chamada Vertigo. Enquanto isso, Oliver recebe notícias perturbadoras de Felicity sobre Moira.",
        "when": "2013-01-30"
    },
    {
        "show_id": 1,
        "name": "Traição",
        "season": 1,
        "episode": 13,
        "description": "Um cruel marginal é libertado da prisão e planeja recuperar sua posição como líder do submundo de Starling City, mas antes precisa derrotar seu maior inimigo: o Arqueiro.",
        "when": "2013-02-06"
    },
    {
        "show_id": 1,
        "name": "A Odisseia",
        "season": 1,
        "episode": 14,
        "description": "Oliver é baleado e pede ajuda a Felicity. Entre a vida e a morte, ele tem flashbacks de uma tentativa ousada de fuga da ilha.",
        "when": "2013-02-13"
    },
    {
        "show_id": 1,
        "name": "Habilidoso",
        "season": 1,
        "episode": 15,
        "description": "Oliver convida a detetive McKenna Hall para sair. Enquanto isso, um ladrão de joias chamado Dodger chega à cidade planejando atacar alguém próximo a Oliver.",
        "when": "2013-02-20"
    },
    {
        "show_id": 1,
        "name": "No Flagra",
        "season": 1,
        "episode": 16,
        "description": "Oliver e Diggle descobrem que o Pistoleiro ainda está vivo e que Malcolm é o próximo alvo. Enquanto isso, Oliver insiste que Tommy se reconcilie com seu pai.",
        "when": "2013-02-27"
    },
    {
        "show_id": 1,
        "name": "A Caçadora Retorna",
        "season": 1,
        "episode": 17,
        "description": "A Caçadora retorna à cidade e ameaça destruir todas as pessoas importantes para Oliver. Mais tarde, Steve Aoki promove a abertura da boate.",
        "when": "2013-03-20"
    },
    {
        "show_id": 1,
        "name": "Salvação",
        "season": 1,
        "episode": 18,
        "description": "Um morador insatisfeito dos Glades embarca em uma série de sequestros e assassinatos para punir quem ele acredita ter agido de má-fé contra os residentes do bairro.",
        "when": "2013-03-27"
    },
    {
        "show_id": 1,
        "name": "Negócios Inacabados",
        "season": 1,
        "episode": 19,
        "description": "Quando uma jovem sofre uma morte brutal após uma balada no Verdant, o detetive Lance encontra provas incriminadoras contra Tommy.",
        "when": "2013-04-03"
    },
    {
        "show_id": 1,
        "name": "Invasão de Domicílio",
        "season": 1,
        "episode": 20,
        "description": "Quando o Pistoleiro retorna a Starling City após eliminar um embaixador americano e outras seis pessoas no exterior, é montada uma operação para capturá-lo vivo.",
        "when": "2013-04-24"
    },
    {
        "show_id": 1,
        "name": "A Empresa",
        "season": 1,
        "episode": 21,
        "description": "Enquanto Oliver se concentra em riscar mais um nome de sua lista, Felicity encontra provas em um computador de uma transação suspeita que pode levá-lo até Walter.",
        "when": "2013-05-01"
    },
    {
        "show_id": 1,
        "name": "Escuridão na Fronteira da Cidade",
        "season": 1,
        "episode": 22,
        "description": "Com o novo empreendimento a caminho, Malcolm veste seu capuz negro para negociar com o sismólogo Brion Markov e sua equipe.",
        "when": "2013-05-08"
    },
    {
        "show_id": 1,
        "name": "Sacrifício",
        "season": 1,
        "episode": 23,
        "description": "No último episódio da temporada, Oliver e Diggle tentam impedir que o Arqueiro Negro coloque em ação seu plano de vingança. Enquanto isso, Thea tenta encontrar Roy.",
        "when": "2013-05-15"
    },
    {
        "show_id": 1,
        "name": "Cidade de Heróis",
        "season": 2,
        "episode": 1,
        "description": "Com a rápida deterioração de Starling City e da Corporação Queen, Diggle e Felicity viajam a Lian Yu para convencer Oliver a retornar como o Arqueiro.",
        "when": "2013-10-09"
    },
    {
        "show_id": 1,
        "name": "Identidade",
        "season": 2,
        "episode": 2,
        "description": "Após descobrir que remédios destinados ao hospital estão sendo roubados, Oliver trava um duelo com Tigre de Bronze e China White.",
        "when": "2013-10-16"
    },
    {
        "show_id": 1,
        "name": "Bonecas Despedaçadas",
        "season": 2,
        "episode": 3,
        "description": "Felicity se oferece como isca para os outros capturarem um criminoso que está torturando e matando mulheres.",
        "when": "2013-10-23"
    },
    {
        "show_id": 1,
        "name": "Prova Severa",
        "season": 2,
        "episode": 4,
        "description": "Oliver descobre que um homem está contrabandeando armas para os Glades e decide organizar uma campanha para que as pessoas troquem suas armas por dinheiro.",
        "when": "2013-10-30"
    },
    {
        "show_id": 1,
        "name": "Liga dos Assassinos",
        "season": 2,
        "episode": 5,
        "description": "Oliver tenta fazer Canário revelar sua história. Enquanto isso, a promotoria oferece um acordo a Moira.",
        "when": "2013-11-06"
    },
    {
        "show_id": 1,
        "name": "Mantenha Seus Inimigos por Perto",
        "season": 2,
        "episode": 6,
        "description": "Diggle descobre que Lyla desapareceu enquanto investigava uma pista em Moscou. O advogado de Moira diz a Thea que o namoro com Roy está prejudicando o caso de sua mãe.",
        "when": "2013-11-13"
    },
    {
        "show_id": 1,
        "name": "Estado x Queen",
        "season": 2,
        "episode": 7,
        "description": "Uma doença misteriosa assola a cidade e infecta centenas de pessoas. Enquanto isso, Moira é julgada por sua participação na conspiração.",
        "when": "2013-11-20"
    },
    {
        "show_id": 1,
        "name": "O Cientista",
        "season": 2,
        "episode": 8,
        "description": "Um assalto praticamente impossível na Divisão de Ciências da Corporação Queen traz um cientista da polícia de Central City à cidade.",
        "when": "2013-12-04"
    },
    {
        "show_id": 1,
        "name": "Três Fantasmas",
        "season": 2,
        "episode": 9,
        "description": "Oliver recebe a visita de fantasmas do passado. A ligação entre Barry e Felicity fica cada vez mais forte.",
        "when": "2013-12-11"
    },
    {
        "show_id": 1,
        "name": "Raio de Explosão",
        "season": 2,
        "episode": 10,
        "description": "Oliver precisa lidar com uma nova ameaça quando bombas explodem em Starling City, e Thea testemunha a super força de Roy.",
        "when": "2014-01-15"
    },
    {
        "show_id": 1,
        "name": "Ponto Cego",
        "season": 2,
        "episode": 11,
        "description": "Arqueiro une forças com Laurel para encontrar o homem da máscara. Sin testa a super força de Roy, e os resultados são quase fatais.",
        "when": "2014-01-22"
    },
    {
        "show_id": 1,
        "name": "Tremores",
        "season": 2,
        "episode": 12,
        "description": "O Arqueiro se oferece para ensinar Roy a controlar sua super força. Enquanto isso, o Tigre de Bronze volta a representar uma ameaça.",
        "when": "2014-01-29"
    },
    {
        "show_id": 1,
        "name": "A Herdeira do Demônio",
        "season": 2,
        "episode": 13,
        "description": "Sara é forçada a tomar uma importante decisão quando seu passado com a Liga dos Assassinos retorna para assombrá-la.",
        "when": "2014-02-05"
    },
    {
        "show_id": 1,
        "name": "Hora da Morte",
        "season": 2,
        "episode": 14,
        "description": "A equipe tenta deter o Rei Relógio, que tem a habilidade de abrir qualquer cofre em Starling City.",
        "when": "2014-02-26"
    },
    {
        "show_id": 1,
        "name": "A Promessa",
        "season": 2,
        "episode": 15,
        "description": "Oliver está de volta à ilha onde passou anos isolado, e seus planos para dominar um navio cargueiro acaba tendo consequências fatais.",
        "when": "2014-03-05"
    },
    {
        "show_id": 1,
        "name": "Esquadrão Suicida",
        "season": 2,
        "episode": 16,
        "description": "Com o retorno de Slade e sua promessa de vingança, Oliver se prepara para a batalha. Diggle é recrutado pela A.R.G.U.S. para deter um poderoso general.",
        "when": "2014-03-19"
    },
    {
        "show_id": 1,
        "name": "Aves de Rapina",
        "season": 2,
        "episode": 17,
        "description": "Quando Frank Bertinelli é detido e Laurel é escolhida para julgar o caso, a filha de Bertinelli retorna para fazer justiça com as próprias mãos.",
        "when": "2014-03-26"
    },
    {
        "show_id": 1,
        "name": "O Exterminador",
        "season": 2,
        "episode": 18,
        "description": "Slade coloca em ação seu plano contra Oliver. Enquanto isso, Isabel tenta tomar a Corporação Queen das mãos de Oliver.",
        "when": "2014-04-02"
    },
    {
        "show_id": 1,
        "name": "O Homem Embaixo do Capuz",
        "season": 2,
        "episode": 19,
        "description": "Um dos membros da equipe vai parar no hospital após uma batalha épica contra Slade, e Oliver é forçado a tomar uma importante decisão a respeito de Thea.",
        "when": "2014-04-16"
    },
    {
        "show_id": 1,
        "name": "Visto Vermelho",
        "season": 2,
        "episode": 20,
        "description": "A equipe é forçada a entrar em ação ao perceber que o Mirakuru dominou Roy completamente e o deixou fora de controle.",
        "when": "2014-04-23"
    },
    {
        "show_id": 1,
        "name": "Cidade de Sangue",
        "season": 2,
        "episode": 21,
        "description": "Oliver talvez precise se sacrificar para deter Slade, mas Diggle e Felicity fazem de tudo para impedi-lo.",
        "when": "2014-04-30"
    },
    {
        "show_id": 1,
        "name": "Ruas de Fogo",
        "season": 2,
        "episode": 22,
        "description": "Oliver e sua equipe correm contra o tempo para deter o ataque dos soldados de Slade. Enquanto isso, Malcolm Merlyn retorna.",
        "when": "2014-05-07"
    },
    {
        "show_id": 1,
        "name": "O Impensável",
        "season": 2,
        "episode": 23,
        "description": "A regra de Oliver de não matar é colocada à prova quando Slade sequestra uma pessoa querida. Enquanto isso, Diggle enfrenta Amanda Waller.",
        "when": "2014-05-14"
    },
    {
        "show_id": 1,
        "name": "A Calmaria",
        "season": 3,
        "episode": 1,
        "description": "A cidade comemora a paz após a derrota de Slade, mas Werner Zytle tem um plano maligno na manga. Um arqueiro homicida está atrás de Sara.",
        "when": "2014-10-08"
    },
    {
        "show_id": 1,
        "name": "Sara",
        "season": 3,
        "episode": 2,
        "description": "Oliver procura um arqueiro assassino. Laurel tenta fazer justiça com as próprias mãos pela morte de Sara. Thea avança bastante em seu treinamento com Merlyn.",
        "when": "2014-10-15"
    },
    {
        "show_id": 1,
        "name": "Corto Maltese",
        "season": 3,
        "episode": 3,
        "description": "Oliver segue Thea até uma ilha para tentar levá-la de volta à cidade e ajuda Diggle a encontrar um agente perdido da ARGUS. Laurel tenta se fortalecer.",
        "when": "2014-10-22"
    },
    {
        "show_id": 1,
        "name": "O Mago",
        "season": 3,
        "episode": 4,
        "description": "Oliver envia Roy para seguir Nyssa e descobrir mais pistas sobre o assassino de Sara. Thea é sequestrada, e Oliver faz um inimigo perigoso.",
        "when": "2014-10-29"
    },
    {
        "show_id": 1,
        "name": "A Origem Secreta de Felicity Smoak",
        "season": 3,
        "episode": 5,
        "description": "Felicity investiga um ataque cibernético à cidade e descobre que ela mesma criou o vírus. Os pesadelos de Roy indicam que foi ele que matou Sara.",
        "when": "2014-11-05"
    },
    {
        "show_id": 1,
        "name": "Culpado",
        "season": 3,
        "episode": 6,
        "description": "Oliver ajuda a provar a inocência de Ted Grant em um caso de múltiplos assassinatos. Roy enfrenta os resultados do vírus Mirakuru.",
        "when": "2014-11-12"
    },
    {
        "show_id": 1,
        "name": "Abaixe Seu Arco",
        "season": 3,
        "episode": 7,
        "description": "Oliver investiga uma assassina em série que está apaixonada por ele. Ray e Felicity saem juntos e causam ciúmes em Oliver.",
        "when": "2014-11-19"
    },
    {
        "show_id": 1,
        "name": "O Valente e o Corajoso",
        "season": 3,
        "episode": 8,
        "description": "Oliver e a ARGUS procuram um assassino que usa um bumerangue. Digger prepara uma armadilha para matar Lyla e quem mais estiver em seu caminho.",
        "when": "2014-12-03"
    },
    {
        "show_id": 1,
        "name": "A Escalada",
        "season": 3,
        "episode": 9,
        "description": "A Liga dos Assassinos faz uma ameaça apavorante. Os resultados da investigação de DNA do assassinato de Sara chocam Felicity. Oliver enfrenta um inimigo difícil.",
        "when": "2014-12-10"
    },
    {
        "show_id": 1,
        "name": "Deixado Para Trás",
        "season": 3,
        "episode": 10,
        "description": "Sem o Arqueiro, Diggle e Roy tentam proteger a Starling City de um perigoso chefão do crime. Merlyn recebe notícias sobre Oliver.",
        "when": "2015-01-21"
    },
    {
        "show_id": 1,
        "name": "Cidade da Meia-Noite",
        "season": 3,
        "episode": 11,
        "description": "Maseo e Tatsu não medem esforços para proteger Oliver. Brick sequestra um funcionário da prefeitura para tentar expulsar a força policial dos Glades.",
        "when": "2015-01-28"
    },
    {
        "show_id": 1,
        "name": "Revolta",
        "season": 3,
        "episode": 12,
        "description": "Oliver encontra um mentor para ajudar a derrotar Ra’s. Capitão Lance aconselha Roy e Laurel a lutar contra os homens de Brick. Merlyn descobre quem matou sua esposa.",
        "when": "2015-02-04"
    },
    {
        "show_id": 1,
        "name": "Canários",
        "season": 3,
        "episode": 13,
        "description": "Laurel tenta capturar Zytle depois que ele foge da prisão, mas ele a faz provar de seu próprio veneno. DJ Chase tenta assassinar Thea.",
        "when": "2015-02-11"
    },
    {
        "show_id": 1,
        "name": "O Retorno",
        "season": 3,
        "episode": 14,
        "description": "Oliver começa a treinar Thea na ilha de Lian Yu, mas Slade captura os dois. Thea precisa enfrentar uma verdade difícil.",
        "when": "2015-02-18"
    },
    {
        "show_id": 1,
        "name": "Nanda Parbat",
        "season": 3,
        "episode": 15,
        "description": "Oliver tenta resgatar Merlyn para impedir que Thea desista de tudo depois que ela descobre ter sido responsável pela morte de Sara.",
        "when": "2015-02-25"
    },
    {
        "show_id": 1,
        "name": "A Oferta",
        "season": 3,
        "episode": 16,
        "description": "Com um plano em mente, Ra’s força a barra para Oliver assumir a Liga. Capitão Lance deixa de apoiar Arqueiro.",
        "when": "2015-03-18"
    },
    {
        "show_id": 1,
        "name": "Tendências Suicidas",
        "season": 3,
        "episode": 17,
        "description": "A lua de mel de Diggle e Lyla acaba quando eles são recrutados para uma perigosa missão de resgate. Um sósia do Arqueiro assassina o prefeito",
        "when": "2015-03-25"
    },
    {
        "show_id": 1,
        "name": "Inimigo Público",
        "season": 3,
        "episode": 18,
        "description": "A equipe de Oliver é perseguida pelo assassinato do prefeito. Ray está entre a vida e a morte. Ra’s sequestra Capitão Lance e expõe a identidade de Arqueiro.",
        "when": "2015-04-01"
    },
    {
        "show_id": 1,
        "name": "Flecha Quebrada",
        "season": 3,
        "episode": 19,
        "description": "A equipe de Oliver tenta tirar Roy da prisão e proteger a identidade do Arqueiro. Ray precisa da ajuda de Oliver para derrotar Jake Simmons.",
        "when": "2015-04-15"
    },
    {
        "show_id": 1,
        "name": "O Caído",
        "season": 3,
        "episode": 20,
        "description": "Oliver tenta impedir a morte de Thea e acaba tendo que renunciar à sua antiga vida e buscar um novo papel junto à Liga.",
        "when": "2015-04-22"
    },
    {
        "show_id": 1,
        "name": "Al Sah-him",
        "season": 3,
        "episode": 21,
        "description": "Oliver assume uma nova identidade e precisa provar sua lealdade. Ra’s relembra a luta com seu melhor amigo pela liderança da Liga.",
        "when": "2015-04-29"
    },
    {
        "show_id": 1,
        "name": "Esta é a Sua Espada",
        "season": 3,
        "episode": 22,
        "description": "Diggle e Laurel patrulham a cidade. Oliver descobre quem entregou o vírus Omega a Ra’s e confessa a verdade sobre seu lugar na Liga.",
        "when": "2015-05-06"
    },
    {
        "show_id": 1,
        "name": "Meu Nome é Oliver Queen",
        "season": 3,
        "episode": 23,
        "description": "A equipe corre para impedir Ra’s de liberar o vírus e destruir a cidade, mas Oliver precisa tomar uma decisão importante quando as coisas se acalmam.",
        "when": "2015-05-13"
    },
    {
        "show_id": 1,
        "name": "Arqueiro Verde",
        "season": 4,
        "episode": 1,
        "description": "Quando Damien Darhk ataca a recém rebatizada Star City com sua gangue de assassinos, Oliver rejeita um antigo aliado e volta como o Arqueiro Verde para contra-atacar.",
        "when": "2015-10-07"
    },
    {
        "show_id": 1,
        "name": "O Candidato",
        "season": 4,
        "episode": 2,
        "description": "Arqueiro Verde e Speedy localizam um assassino que persegue um amigo. Enquanto isso, a sede de Thea por sangue aumenta e Oliver se candidata a prefeito.",
        "when": "2015-10-14"
    },
    {
        "show_id": 1,
        "name": "Restauração",
        "season": 4,
        "episode": 3,
        "description": "Enquanto Thea e Laurel tentam ressuscitar Sara usando os poderes do Poço de Lázaro, Oliver e Diggle têm que fazer as pazes e se unir para enfrentar um novo assassino.",
        "when": "2015-10-21"
    },
    {
        "show_id": 1,
        "name": "Além da Redenção",
        "season": 4,
        "episode": 4,
        "description": "Enquanto Oliver cria uma armadilha para pegar policiais corruptos, Laurel leva Quentin para visitar Sara, que está transtornada e acorrentada no porão de Laurel.",
        "when": "2015-10-28"
    },
    {
        "show_id": 1,
        "name": "Assombrado",
        "season": 4,
        "episode": 5,
        "description": "Quando Sara se transforma, Oliver chama John Constantine para restaurar sua alma e curar seu corpo. Enquanto isso, Diggle descobre a verdade sobre seu irmão.",
        "when": "2015-11-04"
    },
    {
        "show_id": 1,
        "name": "Almas Perdidas",
        "season": 4,
        "episode": 6,
        "description": "Ao descobrir que a explosão encolheu Ray, a equipe inicia uma missão para salvá-lo de Damien Darhk e fazê-lo voltar ao tamanho normal.",
        "when": "2015-11-11"
    },
    {
        "show_id": 1,
        "name": "Irmandade",
        "season": 4,
        "episode": 7,
        "description": "Thea descobre uma arriscada possibilidade de cura para sua sede de sangue. A equipe pede ajuda a Ray quando fica sabendo que Andy está vivo e trabalhando para Darhk.",
        "when": "2015-11-18"
    },
    {
        "show_id": 1,
        "name": "Lendas de Ontem",
        "season": 4,
        "episode": 8,
        "description": "Oliver e Barry encontram uma solução engenhosa e fazem uma viagem no tempo para proteger Carter Hall e Kendra Saunders do assassino imortal Vandal Savage.",
        "when": "2015-12-02"
    },
    {
        "show_id": 1,
        "name": "Águas Negras",
        "season": 4,
        "episode": 9,
        "description": "Exposto como a força por trás da H.I.V.E., Darhk sequestra Diggle, Thea e Felicity, levando Oliver a tomar medidas desesperadas.",
        "when": "2015-12-09"
    },
    {
        "show_id": 1,
        "name": "Dívidas de Sangue",
        "season": 4,
        "episode": 10,
        "description": "Louco para vingar o ferimento quase fatal de Felicity, Oliver contrata o anarquista Lonnie Machin para ir atrás de Damien Darhk.",
        "when": "2016-01-20"
    },
    {
        "show_id": 1,
        "name": "A.W.O.L.",
        "season": 4,
        "episode": 11,
        "description": "Enquanto Felicity se adapta a seu novo papel na equipe, Diggle e Andy ajudam Oliver a encontrar os agentes da Shadowspire que tentam se infiltrar na A.R.G.U.S.",
        "when": "2016-01-27"
    },
    {
        "show_id": 1,
        "name": "Desacorrentado",
        "season": 4,
        "episode": 12,
        "description": "Oliver e Thea se surpreendem enquanto perseguem um ladrão controlado pelo Calculador, vilão com planos terríveis para Star City.",
        "when": "2016-02-03"
    },
    {
        "show_id": 1,
        "name": "Pecados do Pai",
        "season": 4,
        "episode": 13,
        "description": "Na esperança de encontrar a cura para a sede de sangue de Thea, Oliver põe Nyssa e Malcolm um contra o outro, numa batalha pelo controle da Liga dos Assassinos.",
        "when": "2016-02-10"
    },
    {
        "show_id": 1,
        "name": "Código de Silêncio",
        "season": 4,
        "episode": 14,
        "description": "Darhk ordena que mercenários explodam alvos estratégicos em Star City, incluindo o local do debate entre os candidatos à prefeitura.",
        "when": "2016-02-17"
    },
    {
        "show_id": 1,
        "name": "Levado",
        "season": 4,
        "episode": 15,
        "description": "Vixen usa seus poderes místicos para ajudar a equipe a enfrentar Darhk. Enquanto isso, a verdade afasta Oliver de Felicity.",
        "when": "2016-02-24"
    },
    {
        "show_id": 1,
        "name": "Corações Partidos",
        "season": 4,
        "episode": 16,
        "description": "Quando Cupido volta e começa a atacar recém-casados, Oliver e Felicity armam para ela, decidindo prosseguir com seu casamento.",
        "when": "2016-03-23"
    },
    {
        "show_id": 1,
        "name": "Farol de Esperança",
        "season": 4,
        "episode": 17,
        "description": "Decidida a roubar o implante de Felicity, Brie Larvan foge da prisão e ataca a Palmer Tech, usando abelhas robóticas para manter Oliver afastado.",
        "when": "2016-03-30"
    },
    {
        "show_id": 1,
        "name": "11h59",
        "season": 4,
        "episode": 18,
        "description": "Oliver e Diggle descobrem que Malcolm tem um plano para tirar Darhk da prisão. Enquanto isso, Laurel recebe uma oferta tentadora.",
        "when": "2016-04-06"
    },
    {
        "show_id": 1,
        "name": "O Choro da Canário",
        "season": 4,
        "episode": 19,
        "description": "A Canário Negro ataca e Oliver e Quentin discutem o destino de Laurel. Enquanto isso, uma conspiração contra a prefeita Adams se desenvolve e Oliver jura matar Darhk.",
        "when": "2016-04-27"
    },
    {
        "show_id": 1,
        "name": "Gênesis",
        "season": 4,
        "episode": 20,
        "description": "Felicity e Oliver procuram um xamã que revela a origem dos poderes de Darhk. A equipe descobre um plano sinistro.",
        "when": "2016-05-04"
    },
    {
        "show_id": 1,
        "name": "Monument Point",
        "season": 4,
        "episode": 21,
        "description": "Quando Darhk põe seu plano catastrófico em prática, Oliver e a equipe pedem ajuda ao pai de Felicity para impedi-lo, mas a H.I.V.E. também está de olho nele.",
        "when": "2016-05-11"
    },
    {
        "show_id": 1,
        "name": "Perdido no Dilúvio",
        "season": 4,
        "episode": 22,
        "description": "Darhk renova suas forças para realizar seu plano. Oliver e Diggle se infiltram em uma instalação secreta da H.I.V.E. em busca de Thea.",
        "when": "2016-05-18"
    },
    {
        "show_id": 1,
        "name": "Cisma",
        "season": 4,
        "episode": 23,
        "description": "Enquanto a equipe faz de tudo para impedir um desastre global, Oliver descobre um poder surpreendente para enfrentar Darhk de uma vez por todas.",
        "when": "2016-05-25"
    },
    {
        "show_id": 1,
        "name": "Legado",
        "season": 5,
        "episode": 1,
        "description": "Enquanto Felicity insiste em buscar novos recrutas e Oliver tenta esquecer o passado, o assassino brutal Tobias Church inicia sua ascensão ao poder.",
        "when": "2016-10-05"
    },
    {
        "show_id": 1,
        "name": "Os Recrutas",
        "season": 5,
        "episode": 2,
        "description": "O Arqueiro Verde tenta treinar os novos recrutas, mas, primeiro, precisa fazer um exame de consciência. Church faz uma jogada para garantir seu controle de Star City.",
        "when": "2016-10-12"
    },
    {
        "show_id": 1,
        "name": "Uma Questão de Confiança",
        "season": 5,
        "episode": 3,
        "description": "Quando o insolente Cão Raivoso abandona a nova equipe para enfrentar um chefão do tráfico sozinho, o Arqueiro Verde se vê diante de um confronto perigoso.",
        "when": "2016-10-19"
    },
    {
        "show_id": 1,
        "name": "Penitência",
        "season": 5,
        "episode": 4,
        "description": "Aproveitando que Oliver está em uma missão para libertar Diggle, Church organiza um ataque contra Star City. Será que a nova equipe pode deter essa ameaça sem seu líder?",
        "when": "2016-10-26"
    },
    {
        "show_id": 1,
        "name": "Alvo Humano",
        "season": 5,
        "episode": 5,
        "description": "Enquanto sofre ameaça de morte, Oliver recorre ao antigo aliado Alvo Humano para ajudar no resgate do Cão Raivoso das garras de Church.",
        "when": "2016-11-02"
    },
    {
        "show_id": 1,
        "name": "E Assim Começa",
        "season": 5,
        "episode": 6,
        "description": "Acreditando que os crimes de Prometeus escondem uma mensagem para ele, o Arqueiro Verde tenta desvendar o mistério enquanto protege sua equipe.",
        "when": "2016-11-09"
    },
    {
        "show_id": 1,
        "name": "Vigilante",
        "season": 5,
        "episode": 7,
        "description": "O Arqueiro Verde e sua equipe lutam contra um novo vigilante mortal que está à solta em Star City. Thea apoia Quentin após ele lhe revelar um segredo.",
        "when": "2016-11-16"
    },
    {
        "show_id": 1,
        "name": "Invasão!",
        "season": 5,
        "episode": 8,
        "description": "Diante de uma invasão alienígena, a equipe do Arqueiro Verde se une aos heróis Flash, Supergirl e Legends of Tomorrow para enfrentar a ameaça intergaláctica.",
        "when": "2016-11-30"
    },
    {
        "show_id": 1,
        "name": "O Que Deixamos Para Trás",
        "season": 5,
        "episode": 9,
        "description": "A equipe enfrenta uma traição inesperada de um de seus membros após um ataque violento revelar que Prometeus conhece todos os segredos deles.",
        "when": "2016-12-07"
    },
    {
        "show_id": 1,
        "name": "Quem é Você?",
        "season": 5,
        "episode": 10,
        "description": "Uma sósia inesperada causa discórdia entre o Arqueiro Verde e Felicity. Chase enfrenta oficiais militares para livrar Diggle de uma sentença de morte.",
        "when": "2017-01-25"
    },
    {
        "show_id": 1,
        "name": "Segundas Chances",
        "season": 5,
        "episode": 11,
        "description": "Durante a busca do Arqueiro Verde por uma nova Canário Negro, aparece uma candidata promissora, mas instável. Felicity tenta invadir a NSA para libertar Diggle.",
        "when": "2017-02-01"
    },
    {
        "show_id": 1,
        "name": "Bratva",
        "season": 5,
        "episode": 12,
        "description": "Uma nova ameaça leva a equipe à Rússia, onde Oliver enfrenta problemas com um antigo camarada. Em Star City, Rene precisa provar sua capacidade de liderança.",
        "when": "2017-02-08"
    },
    {
        "show_id": 1,
        "name": "Espectro da Arma",
        "season": 5,
        "episode": 13,
        "description": "Um ataque brutal contra a prefeitura obriga Oliver a buscar justiça como prefeito, e não como Arqueiro Verde. Rene revive sua história de homem de família a justiceiro.",
        "when": "2017-02-15"
    },
    {
        "show_id": 1,
        "name": "O Devorador de Pecados",
        "season": 5,
        "episode": 14,
        "description": "Após uma fuga na prisão, a Unidade Anticrime interfere na caçada do Arqueiro Verde às vilãs Liza Warner, Cupid e China White.",
        "when": "2017-02-22"
    },
    {
        "show_id": 1,
        "name": "Combater Fogo com Fogo",
        "season": 5,
        "episode": 15,
        "description": "Oliver enfrenta pedidos de impeachment na prefeitura enquanto Diggle e a equipe buscam uma forma de derrotar o Vigilante de uma vez por todas.",
        "when": "2017-03-01"
    },
    {
        "show_id": 1,
        "name": "Xeque-Mate",
        "season": 5,
        "episode": 16,
        "description": "O Arqueiro Verde está perto de descobrir a verdadeira identidade de Prometeus, que toma como refém alguém muito próximo de Oliver. Felicity recebe um ultimato da Helix.",
        "when": "2017-03-15"
    },
    {
        "show_id": 1,
        "name": "Kapiushon",
        "season": 5,
        "episode": 17,
        "description": "Desmascarado, Prometeus faz o possível para se vingar de Oliver e forçar uma confissão sobre o passado obscuro e violento do Arqueiro Verde.",
        "when": "2017-03-22"
    },
    {
        "show_id": 1,
        "name": "Dissolvido",
        "season": 5,
        "episode": 18,
        "description": "A equipe se desentende quando Oliver chama seus antigos e imprevisíveis aliados do Bratva para derrotar Prometeus de uma vez por todas.",
        "when": "2017-03-29"
    },
    {
        "show_id": 1,
        "name": "Ligações Perigosas",
        "season": 5,
        "episode": 19,
        "description": "Com toda a Star City atrás de Adrian Chase, Felicity desafia Oliver e pede socorro à Helix. Mas a ajuda deles tem um preço muito alto.",
        "when": "2017-04-26"
    },
    {
        "show_id": 1,
        "name": "Por Baixo",
        "season": 5,
        "episode": 20,
        "description": "Uma explosão misteriosa deixa Felicity e Oliver presos no bunker. Diggle e Lyla enfrentam problemas no casamento.",
        "when": "2017-05-03"
    },
    {
        "show_id": 1,
        "name": "Honra Teus Pais",
        "season": 5,
        "episode": 21,
        "description": "A busca por Adrian Chase leva a equipe do Arqueiro Verde a um confronto com Sampson. Uma entrega macabra na prefeitura passa um recado perturbador a Oliver.",
        "when": "2017-05-10"
    },
    {
        "show_id": 1,
        "name": "Desaparecidos",
        "season": 5,
        "episode": 22,
        "description": "Uma surpresa agradável pega Oliver desprevenido. Os membros da equipe se separam quando descobrem que Adrian Chase começou a persegui-los.",
        "when": "2017-05-17"
    },
    {
        "show_id": 1,
        "name": "Lian Yu",
        "season": 5,
        "episode": 23,
        "description": "Desesperado para salvar sua equipe e família, Oliver retorna à ilha de Lian Yu e recruta um antigo inimigo para um duelo derradeiro contra Adrian Chase.",
        "when": "2017-05-24"
    },
    {
        "show_id": 1,
        "name": "Recaída",
        "season": 6,
        "episode": 1,
        "description": "Enquanto Quentin tenta aceitar suas ações em Lian Yu, Sereia Negra inicia uma série de ataques contra a polícia de Star City e a Equipe do Arqueiro Verde.",
        "when": "2017-10-12"
    },
    {
        "show_id": 1,
        "name": "Tributo",
        "season": 6,
        "episode": 2,
        "description": "Um agente do FBI persegue Oliver após o vazamento de uma foto incriminadora. Anatoly faz um ataque ousado. Diggle enfrenta uma verdade difícil.",
        "when": "2017-10-19"
    },
    {
        "show_id": 1,
        "name": "O Parente Mais Próximo",
        "season": 6,
        "episode": 3,
        "description": "Diggle assume sua nova função, mas enfrenta uma crise de liderança quando a equipe tenta evitar um ataque com gás venenoso de Onyx e seu grupo.",
        "when": "2017-10-26"
    },
    {
        "show_id": 1,
        "name": "Reversão",
        "season": 6,
        "episode": 4,
        "description": "Uma série de assassinatos intrigantes ocorre em Star City. Felicity tem pouco tempo para impedir um ataque destruidor de Cayden James.",
        "when": "2017-11-02"
    },
    {
        "show_id": 1,
        "name": "O Exterminador Retorna",
        "season": 6,
        "episode": 5,
        "description": "Com a ajuda de Oliver, Slade procura seu filho desaparecido e descobre algo terrível. Uma revelação leva Dinah a caçar um atirador renegado.",
        "when": "2017-11-09"
    },
    {
        "show_id": 1,
        "name": "Promessas Cumpridas",
        "season": 6,
        "episode": 6,
        "description": "A jornada de Slade na busca de seu filho sofre uma reviravolta. O segredo de Diggle conflita com a missão da equipe: derrubar um traficante de drogas.",
        "when": "2017-11-16"
    },
    {
        "show_id": 1,
        "name": "Ação de Graças",
        "season": 6,
        "episode": 7,
        "description": "Os planos de férias de Oliver vão por água abaixo quando ele é preso por Watson, fazendo Cayden James e a Sereia Negra atacar um show de rock em Star City.",
        "when": "2017-11-23"
    },
    {
        "show_id": 1,
        "name": "Crise na Terra-X - Parte 2",
        "season": 6,
        "episode": 8,
        "description": "O Arqueiro Verde se une aos heróis Flash, Supergirl e Legends of Tomorrow para combater a invasão nazista iniciada pela Terra-X e um clone diabólico de si mesmo.",
        "when": "2017-11-27"
    },
    {
        "show_id": 1,
        "name": "Diferenças Irreconciliáveis",
        "season": 6,
        "episode": 9,
        "description": "A equipe comemora um casamento esperado há muito tempo, mas descobre um traidor. Cayden James força Oliver a aceitar um roubo que é uma missão impossível.",
        "when": "2017-12-07"
    },
    {
        "show_id": 1,
        "name": "Dividido",
        "season": 6,
        "episode": 10,
        "description": "Com a discórdia semeada entre eles, a equipe descobre que seu abrigo está comprometido. Um chefe da máfia solicita ao Arqueiro Verde ajuda contra um inimigo comum.",
        "when": "2018-01-18"
    },
    {
        "show_id": 1,
        "name": "Nós Caímos",
        "season": 6,
        "episode": 11,
        "description": "Oliver luta para proteger Star City depois que Cayden James inicia um cerco mortal usando alta tecnologia. Um novo aliado provoca discórdia entre Dinah e a nova equipe.",
        "when": "2018-01-25"
    },
    {
        "show_id": 1,
        "name": "Tudo por Nada",
        "season": 6,
        "episode": 12,
        "description": "Cayden James procura um espião em sua equipe. Felicity inicia um plano arriscado para neutralizar a bomba termobárica que ameaça Star City.",
        "when": "2018-02-01"
    },
    {
        "show_id": 1,
        "name": "O Grande Truque do Diabo",
        "season": 6,
        "episode": 13,
        "description": "Com a sua equipe desorganizada, Oliver enfrenta um ultimato de Cayden James. A sede por vingança de Dinah a leva a se tornar uma renegada.",
        "when": "2018-02-08"
    },
    {
        "show_id": 1,
        "name": "Rota de Colisão",
        "season": 6,
        "episode": 14,
        "description": "Star City enfrenta um desastre financeiro. Antigos aliados discutem violentamente sobre o destino de Sereia Negra. Quentin mantém um segredo.",
        "when": "2018-03-01"
    },
    {
        "show_id": 1,
        "name": "A Sósia",
        "season": 6,
        "episode": 15,
        "description": "Ao saber que Roy Harper foi capturado em Star City, Thea veste seu traje de Speedy e volta à Equipe do Arqueiro Verde para uma missão de resgate ousada.",
        "when": "2018-03-08"
    },
    {
        "show_id": 1,
        "name": "A Guilda de Thanatos",
        "season": 6,
        "episode": 16,
        "description": "Perseguidos por assassinos, Nyssa, Thea e a Equipe do Arqueiro Verde tentam decifrar um mapa misterioso. Dinah e Curtis procuram policiais corruptos.",
        "when": "2018-03-29"
    },
    {
        "show_id": 1,
        "name": "Irmãos Armados",
        "season": 6,
        "episode": 17,
        "description": "Diaz age para consolidar seu controle sobre Star City. Diggle contesta a liderança da equipe por Oliver, e uma decisão difícil deve ser tomada.",
        "when": "2018-04-05"
    },
    {
        "show_id": 1,
        "name": "Fundamentos",
        "season": 6,
        "episode": 18,
        "description": "Pressionado por todos os lados, Oliver sofre alucinações perturbadoras que expõem suas maiores inseguranças e o fazem seguir um caminho perigoso.",
        "when": "2018-04-12"
    },
    {
        "show_id": 1,
        "name": "O Dragão",
        "season": 6,
        "episode": 19,
        "description": "Diaz participa de uma reunião com consequências terríveis para Star City. Felicity e Curtis trabalham para levar a Helix Dynamics a um nível mais alto.",
        "when": "2018-04-19"
    },
    {
        "show_id": 1,
        "name": "Trocando Alianças",
        "season": 6,
        "episode": 20,
        "description": "Oliver se arrisca ao colocar Anatoly contra Diaz. Rene retorna à batalha e as equipes de Dinah e Diggle se juntam para enfrentar o Quadrante.",
        "when": "2018-04-26"
    },
    {
        "show_id": 1,
        "name": "Processo n.º 11-19-41-73",
        "season": 6,
        "episode": 21,
        "description": "Oliver pode ser condenado à prisão perpétua no tribunal, mas o julgamento muda inesperadamente quando um velho amigo aparece de surpresa.",
        "when": "2018-05-03"
    },
    {
        "show_id": 1,
        "name": "Os Laços Que Se Unem",
        "season": 6,
        "episode": 22,
        "description": "Enfrentando um ataque coordenado, os membros da equipe do Arqueiro Verde se reúnem para roubar dados que podem acabar com o domínio de Diaz sobre a Star City.",
        "when": "2018-05-10"
    },
    {
        "show_id": 1,
        "name": "Sentença de Vida",
        "season": 6,
        "episode": 23,
        "description": "Com o destino de Star City em jogo, um novo reforço entra na luta ao lado da equipe do Arqueiro Verde enquanto Oliver leva Diaz para um confronto explosivo.",
        "when": "2018-05-17"
    },
    {
        "show_id": 1,
        "name": "Detento 4587",
        "season": 7,
        "episode": 1,
        "description": "Oliver tenta se manter neutro em um ambiente hostil. Um novo vigilante se passando pelo Arqueiro Verde surge nas ruas.",
        "when": "2018-10-15"
    },
    {
        "show_id": 1,
        "name": "Os Caçadores de Longbow",
        "season": 7,
        "episode": 2,
        "description": "A Equipe Arqueiro Verde se reúne para rastrear os Caçadores depois de um roubo no A.R.G.U.S.. Oliver fecha um negócio arriscado.",
        "when": "2018-10-22"
    },
    {
        "show_id": 1,
        "name": "Passando dos Limites",
        "season": 7,
        "episode": 3,
        "description": "Oliver encara um grande desafio atrás das grades. Felicity deixa claras suas prioridades. Curtis cria uma obra-prima tecnológica.",
        "when": "2018-10-29"
    },
    {
        "show_id": 1,
        "name": "Nível Dois",
        "season": 7,
        "episode": 4,
        "description": "Sob interrogatório, Oliver reconsidera seu legado. Um incendiário aterroriza o Glades. Dinah e Rene entram em confronto por causa do novo Arqueiro Verde.",
        "when": "2018-11-05"
    },
    {
        "show_id": 1,
        "name": "O Demônio",
        "season": 7,
        "episode": 5,
        "description": "Oliver planeja uma fuga. Curtis se disfarça e acaba tendo uma crise de identidade.",
        "when": "2018-11-12"
    },
    {
        "show_id": 1,
        "name": "Devido Processo",
        "season": 7,
        "episode": 6,
        "description": "Laurel assume o caso de Oliver. Felicity leva um agente disfarçado ao limite. Oliver se posiciona para defender uma amizade.",
        "when": "2018-11-19"
    },
    {
        "show_id": 1,
        "name": "A Redenção de Slabside",
        "season": 7,
        "episode": 7,
        "description": "Mesmo colocando sua liberdade em risco, Oliver força um confronto depois que Diaz põe em prática seu plano de vingança.",
        "when": "2018-11-26"
    },
    {
        "show_id": 1,
        "name": "Desmascarado",
        "season": 7,
        "episode": 8,
        "description": "Após sua libertação, Oliver ajuda Rene e Dinah a identificar o novo Arqueiro Verde, suspeito de assassinato.",
        "when": "2018-12-03"
    },
    {
        "show_id": 1,
        "name": "Outros Mundos - Parte 2",
        "season": 7,
        "episode": 9,
        "description": "Oliver, Kara e Barry recebem ajuda inesperada em Gotham City. Felicity faz um avanço interdimensional.",
        "when": "2018-12-10"
    },
    {
        "show_id": 1,
        "name": "Meu Nome é Emiko Queen",
        "season": 7,
        "episode": 10,
        "description": "Rene luta para ajudar o novo Arqueiro Verde. Trabalhando com a polícia, Oliver encontra um elo inesperado com o misterioso vigilante.",
        "when": "2019-01-21"
    },
    {
        "show_id": 1,
        "name": "Pecados Passados",
        "season": 7,
        "episode": 11,
        "description": "O legado do pai assombra a tentativa de Oliver de recuperar a confiança de Star City. John pressiona Curtis em ajudar com a Iniciativa Fantasma.",
        "when": "2019-01-28"
    },
    {
        "show_id": 1,
        "name": "Arqueiro Esmeralda",
        "season": 7,
        "episode": 12,
        "description": "Uma equipe de documentaristas acompanha os passos de Oliver na busca pelo mascarado misterioso que passou a atacar os vigilantes de Star City.",
        "when": "2019-02-04"
    },
    {
        "show_id": 1,
        "name": "O Assassino de Star City",
        "season": 7,
        "episode": 13,
        "description": "Dinah e sua equipe acabam num cenário de filme de terror ao perseguirem um assassino em série. William e Oliver discutem sobre o futuro.",
        "when": "2019-02-11"
    },
    {
        "show_id": 1,
        "name": "Irmãos & Irmãs",
        "season": 7,
        "episode": 14,
        "description": "Felicity quer derrubar Diaz. Oliver entra na história quando Emiko procura o assassino de sua mãe.",
        "when": "2019-03-04"
    },
    {
        "show_id": 1,
        "name": "Dia de Treinamento",
        "season": 7,
        "episode": 15,
        "description": "Sob novas regras, os membros da Equipe Arqueiro vão atrás de um traficante que está colocando armas químicas nas ruas de Star City.",
        "when": "2019-03-11"
    },
    {
        "show_id": 1,
        "name": "Star City 2040",
        "season": 7,
        "episode": 16,
        "description": "Décadas no futuro, William e Mia levam sua missão perigosa ao Glades, onde fazem descobertas perturbadoras.",
        "when": "2019-03-18"
    },
    {
        "show_id": 1,
        "name": "Herança",
        "season": 7,
        "episode": 17,
        "description": "A Equipe Arqueiro encontra o rastro de Dante. Oliver descobre um segredo sobre o passado de Emiko.",
        "when": "2019-03-25"
    },
    {
        "show_id": 1,
        "name": "A Canário Perdida",
        "season": 7,
        "episode": 18,
        "description": "Depois que seu histórico criminal é revelado, Laurel retoma uma antiga parceria. Dinah e Felicity brigam.",
        "when": "2019-04-15"
    },
    {
        "show_id": 1,
        "name": "Espartano",
        "season": 7,
        "episode": 19,
        "description": "Depois que o programa cai nas mãos do Nono Círculo, Diggle pede ajuda a gente poderosa e precisa encarar o passado conflituoso de sua família.",
        "when": "2019-04-22"
    },
    {
        "show_id": 1,
        "name": "Confissões",
        "season": 7,
        "episode": 20,
        "description": "Tentando desvendar um mistério, a polícia interroga a Equipe Arqueiro depois que sua missão secreta de impedir um ataque bioterrorista se complica.",
        "when": "2019-04-29"
    },
    {
        "show_id": 1,
        "name": "Prova Viva",
        "season": 7,
        "episode": 21,
        "description": "A Equipe Arqueiro corre para resgatar Oliver de um prédio em colapso, e ele tem um momento de revelação. Emiko tem outra surpresa.",
        "when": "2019-05-06"
    },
    {
        "show_id": 1,
        "name": "Você Salvou Essa Cidade",
        "season": 7,
        "episode": 22,
        "description": "A Equipe Arqueiro corre para impedir o ataque bioterrorista de Emiko, e Oliver tenta libertá-la do ciclo de violência da família.",
        "when": "2019-05-13"
    },
    {
        "show_id": 1,
        "name": "Starling City",
        "season": 8,
        "episode": 1,
        "description": "Enquanto tenta decifrar a missão do Monitor, Oliver volta para Starling City e encontra rostos familiares; a equipe de Mia e William se choca com um novo inimigo.",
        "when": "2019-10-15"
    },
    {
        "show_id": 1,
        "name": "Bem-Vindo a Hong Kong",
        "season": 8,
        "episode": 2,
        "description": "Oliver, John, Laurel e Tatsu procuram uma pessoa importante, que faz parte do plano do Monitor; Connor tem uma conversa importante com seu irmão.",
        "when": "2019-10-22"
    },
    {
        "show_id": 1,
        "name": "Salto de Fé",
        "season": 8,
        "episode": 3,
        "description": "Uma vez reunido com sua irmã, Thea, Oliver procura um labirinto familiar de catacumbas. Enquanto isso, John e Lyla se juntam em uma missão.",
        "when": "2019-10-29"
    },
    {
        "show_id": 1,
        "name": "Tempo Presente",
        "season": 8,
        "episode": 4,
        "description": "Um misterioso e novo Deathstroke aparece. Oliver e a equipe tentam vencê-lo.",
        "when": "2019-11-05"
    },
    {
        "show_id": 1,
        "name": "Prochnost",
        "season": 8,
        "episode": 5,
        "description": "Depois de descobrirem a chave para vencer o Monitor, Oliver e a equipe precisam voltar para a Rússia e conseguir os materiais necessários; Diggle reencontra alguém de seu passado.",
        "when": "2019-11-19"
    },
    {
        "show_id": 1,
        "name": "Reiniciar",
        "season": 8,
        "episode": 6,
        "description": "Oliver enfrenta uma situação de vida ou morte depois de ser enganado por Lyla; Laurel tem a oportunidade de fazer as pazes.",
        "when": "2019-11-26"
    },
    {
        "show_id": 1,
        "name": "Purgatório",
        "season": 8,
        "episode": 7,
        "description": "A missão de Oliver o leva até Lian Yu, onde ele procura a ajuda de um velho amigo.",
        "when": "2019-12-03"
    },
    {
        "show_id": 1,
        "name": "Crise nas Infinitas Terras - Parte 4",
        "season": 8,
        "episode": 8,
        "description": "Os Paragons procuram uma rota de fuga; Oliver relata que se tornou outra coisa; a origem do Monitor e do Antimonitor é revelada.",
        "when": "2020-01-14"
    },
    {
        "show_id": 1,
        "name": "Arqueira Verde e as Canários",
        "season": 8,
        "episode": 9,
        "description": "Laurel e Dinah se reúnem com Mia Queen na Star City de 2040. Tentando ajudá-la, os três se transformam mais uma vez para salvar a cidade.",
        "when": "2020-01-21"
    },
    {
        "show_id": 1,
        "name": "Desaparecer",
        "season": 8,
        "episode": 10,
        "description": "Flashbacks revelam eventos separados quando o tempo de Oliver Queen como o Arqueiro Verde finalmente chega ao fim em Star City.",
        "when": "2020-01-28"
    },
    {
        "show_id": 2,
        "name": "Piloto",
        "season": 1,
        "episode": 1,
        "description": "Barry acorda do coma e usa sua nova e extraordinária velocidade para combater outro meta-humano que usa poderes meteorológicos para assaltar bancos.",
        "when": "2014-10-07"
    },
    {
        "show_id": 2,
        "name": "O Homem Mais Rápido Vivo",
        "season": 1,
        "episode": 2,
        "description": "Barry enfrenta diversos assassinos que invadem a premiação onde ele acompanha Iris, mas os efeitos colaterais de seus novos superpoderes representam uma ameaça.",
        "when": "2014-10-14"
    },
    {
        "show_id": 2,
        "name": "O Que Não dá Para Ultrapassar",
        "season": 1,
        "episode": 3,
        "description": "Flash e Joe procuram um meta-humano mortal especializado em gases venenosos. Caitlin revive a noite da explosão que matou seu noivo.",
        "when": "2014-10-21"
    },
    {
        "show_id": 2,
        "name": "Confiança é Tudo",
        "season": 1,
        "episode": 4,
        "description": "Para roubar um diamante valioso, Capitão Frio consegue uma arma especial capaz de matar Flash. Joe não aprova o namoro de Iris e Eddie.",
        "when": "2014-10-28"
    },
    {
        "show_id": 2,
        "name": "Plástico",
        "season": 1,
        "episode": 5,
        "description": "Barry tenta convencer Iris a parar de escrever sobre Flash no blog e investiga a ligação entre um general do exército e um meta-humano com poderes explosivos.",
        "when": "2014-11-11"
    },
    {
        "show_id": 2,
        "name": "O Surgimento do Flash",
        "season": 1,
        "episode": 6,
        "description": "Barry enfrenta seu rival de infância, que agora consegue se transformar em aço. Iris inventa o apelido “Flash” no blog.",
        "when": "2014-11-18"
    },
    {
        "show_id": 2,
        "name": "Queda de Energia",
        "season": 1,
        "episode": 7,
        "description": "Usando seus poderes meta-humanos para absorver eletricidade, Blackout rouba a velocidade de Barry e decide ir atrás dos laboratórios S.T.A.R. e do Dr. Wells.",
        "when": "2014-11-25"
    },
    {
        "show_id": 2,
        "name": "Flash vs. Arqueiro",
        "season": 1,
        "episode": 8,
        "description": "Arqueiro ajuda Flash a investigar um bumerangue mortal, mas um meta-humano que consegue controlar emoções faz os amigos se enfrentarem.",
        "when": "2014-12-02"
    },
    {
        "show_id": 2,
        "name": "O Homem na Roupa Amarela",
        "season": 1,
        "episode": 9,
        "description": "Flash finalmente tem a chance de enfrentar Flash Reverso. Caitlin recebe notícias surpreendentes sobre Ronnie.",
        "when": "2014-12-09"
    },
    {
        "show_id": 2,
        "name": "A Vingança dos Ladrões",
        "season": 1,
        "episode": 10,
        "description": "Flash se prepara para aniquilar Flash Reverso. Capitão Frio e Onda Térmica se unem para sequestrar Caitlin e tentar acabar com o herói.",
        "when": "2015-01-20"
    },
    {
        "show_id": 2,
        "name": "O Som e a Fúria",
        "season": 1,
        "episode": 11,
        "description": "Um ex-aluno de Dr. Wells usa ondas sonoras para atacar Flash. Iris enfrenta problemas em seu novo emprego de repórter.",
        "when": "2015-01-27"
    },
    {
        "show_id": 2,
        "name": "Louco Por Você",
        "season": 1,
        "episode": 12,
        "description": "Flash encara um meta-humano com poderes de teletransporte. Cisco procura Ronnie. E Barry e Caitlin buscam o amor em um karaokê.",
        "when": "2015-02-03"
    },
    {
        "show_id": 2,
        "name": "O Homem Nuclear",
        "season": 1,
        "episode": 13,
        "description": "Ronnie sofre uma transformação perigosa e ataca um cientista. Joe e Cisco investigam novamente o assassinato de Nora Allen.",
        "when": "2015-02-10"
    },
    {
        "show_id": 2,
        "name": "Recaída",
        "season": 1,
        "episode": 14,
        "description": "General Eiling tenta usar Ronnie e Dr. Stein em seu projeto de super soldados. Barry tenta descobrir se viajou no tempo.",
        "when": "2015-02-17"
    },
    {
        "show_id": 2,
        "name": "Fora do Tempo",
        "season": 1,
        "episode": 15,
        "description": "Um meta-humano que consegue controlar o clima ataca Joe para vingar a morte do irmão. Cisco descobre a verdade sobre Flash Reverso.",
        "when": "2015-03-17"
    },
    {
        "show_id": 2,
        "name": "O Retorno dos Ladrões",
        "season": 1,
        "episode": 16,
        "description": "Flash volta ao passado para impedir um maremoto, mas o túnel do tempo provoca outro ataque de Capitão Frio e Onda Térmica.",
        "when": "2015-03-24"
    },
    {
        "show_id": 2,
        "name": "Os Trapaceiros",
        "season": 1,
        "episode": 17,
        "description": "Flash persegue Trapaceiro e o vilão imitador que o tirou da cadeia. Barry descobre a verdade sobre Dr. Wells.",
        "when": "2015-03-31"
    },
    {
        "show_id": 2,
        "name": "Todo o Time Unido",
        "season": 1,
        "episode": 18,
        "description": "Felicity Smoak e Capitão Átomo se unem a Flash para enfrentar um meta-humano que está atacando cientistas com enxames de abelhas robóticas.",
        "when": "2015-04-14"
    },
    {
        "show_id": 2,
        "name": "Quem é Harrison Wells?",
        "season": 1,
        "episode": 19,
        "description": "Joe e Cisco intensificam as investigações sobre Dr. Wells. Flash enfrenta um meta-humano que consegue se transformar nas pessoas em que toca.",
        "when": "2015-04-21"
    },
    {
        "show_id": 2,
        "name": "A Armadilha",
        "season": 1,
        "episode": 20,
        "description": "Barry tem uma breve visão do futuro. Com apoio dos amigos, ele arma um plano para que Dr. Wells confesse o que fez. Mas isso arrisca a segurança de Cisco.",
        "when": "2015-04-28"
    },
    {
        "show_id": 2,
        "name": "Surge Grodd",
        "season": 1,
        "episode": 21,
        "description": "Depois que um gorila telepático força o General Eiling a cometer um roubo, Flash e sua equipe penetram nos esgotos da cidade para confrontar a fera.",
        "when": "2015-05-05"
    },
    {
        "show_id": 2,
        "name": "Acerto de Contas",
        "season": 1,
        "episode": 22,
        "description": "Flash descobre que Dr. Wells reativou o acelerador de partículas e pede ajuda ao Capitão Frio para salvar os meta-humanos presos nele.",
        "when": "2015-05-12"
    },
    {
        "show_id": 2,
        "name": "Rápido o Bastante",
        "season": 1,
        "episode": 23,
        "description": "Dr. Wells faz uma proposta tentadora a Barry: a chance de voltar no tempo para salvar sua mãe. Mas as consequências podem ser catastróficas.",
        "when": "2015-05-19"
    },
    {
        "show_id": 2,
        "name": "O Homem Que Salvou Central City",
        "season": 2,
        "episode": 1,
        "description": "Seis meses depois de encarar a singularidade, a Equipe Flash se separou, deixando Barry sozinho nos Laboratórios S.T.A.R. e na sua luta contra os meta-humanos.",
        "when": "2015-10-06"
    },
    {
        "show_id": 2,
        "name": "Flash de Dois Mundos",
        "season": 2,
        "episode": 2,
        "description": "Jay Garrick, um speedster da Terra-2, avisa a equipe sobre um speedster do mal chamado Zoom. Cisco tem mais visões, e uma delas leva ao Demônio da Areia.",
        "when": "2015-10-13"
    },
    {
        "show_id": 2,
        "name": "A Família de Trapaceiros",
        "season": 2,
        "episode": 3,
        "description": "Iris se arrisca para conseguir sua matéria, e Joe é obrigado a contar para ela um segredo guardado há muito tempo. Capitão Frio volta mas desta vez precisa do Flash.",
        "when": "2015-10-20"
    },
    {
        "show_id": 2,
        "name": "A Fúria do Nuclear",
        "season": 2,
        "episode": 4,
        "description": "Dr. Stein precisa de uma força que o estabilize para não explodir, e a equipe acha dois compatíveis em potencial. Patty e Barry vão atrás de um homem-tubarão.",
        "when": "2015-10-27"
    },
    {
        "show_id": 2,
        "name": "A Escuridão e a Luz",
        "season": 2,
        "episode": 5,
        "description": "Um pico na Terra-2 revela tensão entre Jay e o Dr. Wells. A última meta-humana que persegue o Flash, Dra. Luz, lembra uma mulher do passado de Barry.",
        "when": "2015-11-03"
    },
    {
        "show_id": 2,
        "name": "Acionando Zoom",
        "season": 2,
        "episode": 6,
        "description": "A equipe conta com uma aliada improvável para capturar Zoom. Cisco tenta usar seus poderes recém-descobertos na Terra-2. Dr. Wells, Barry e Zoom se enfrentam.",
        "when": "2015-11-10"
    },
    {
        "show_id": 2,
        "name": "Guerra do Gorila",
        "season": 2,
        "episode": 7,
        "description": "A confiança de Barry é abalada, e o Dr. Wells da Terra-2 precisa entrar em cena para salvar Caitlin de Grodd, um gorila super inteligente, mas bravo e solitário.",
        "when": "2015-11-17"
    },
    {
        "show_id": 2,
        "name": "Lendas de Hoje",
        "season": 2,
        "episode": 8,
        "description": "Vandal Savage é uma nova ameaça para Central City ele é perigoso e forte, mas não é um meta-humano. Barry pede a ajuda do Arqueiro.",
        "when": "2015-12-01"
    },
    {
        "show_id": 2,
        "name": "Correndo Para Ficar Parado",
        "season": 2,
        "episode": 9,
        "description": "Zoom faz uma proposta irrecusável ao Dr. Wells. O Trickster entrega uma surpresa de Natal, e Barry tem que fazer uma escolha difícil. Iris conta a verdade a Joe.",
        "when": "2015-12-08"
    },
    {
        "show_id": 2,
        "name": "Energia Potencial",
        "season": 2,
        "episode": 10,
        "description": "A noite especial de Barry e Patty é interrompida por um ataque da Tartaruga. Jay conta que está doente. Joe e Wally tentam ser pai e filho.",
        "when": "2016-01-19"
    },
    {
        "show_id": 2,
        "name": "O Flash Reverso Retorna",
        "season": 2,
        "episode": 11,
        "description": "O Flash Reverso sequestra a Dra. McGee para tentar voltar ao seu tempo. Cisco controla seus poderes. A cronologia se rompe.",
        "when": "2016-01-26"
    },
    {
        "show_id": 2,
        "name": "Pista Rápida",
        "season": 2,
        "episode": 12,
        "description": "Barry perde velocidade, mas não sabe explicar por quê. Iris quer manter Wally a salvo das corridas, e os dois acabam atrapalhando a vingança do Fosso de Piche.",
        "when": "2016-02-02"
    },
    {
        "show_id": 2,
        "name": "Bem-Vindos à Terra-2",
        "season": 2,
        "episode": 13,
        "description": "Num plano ousado, a equipe vai para Terra-2 depois de fechar as fendas. Barry se mete na vida do seu sósia e se distrai da missão.",
        "when": "2016-02-09"
    },
    {
        "show_id": 2,
        "name": "Fuga da Terra-2",
        "season": 2,
        "episode": 14,
        "description": "Geomancer causa estragos na Terra-1. O editor de Iris duvida do heroísmo do Flash. Na toca do Zoom, o Homem da Máscara de Ferro manda uma mensagem.",
        "when": "2016-02-16"
    },
    {
        "show_id": 2,
        "name": "Tubarão-Rei",
        "season": 2,
        "episode": 15,
        "description": "Tubarão-Rei está à solta e determinado a matar o Flash. Barry e Wally não conseguem concordar. A verdadeira identidade de Zoom é revelada.",
        "when": "2016-02-23"
    },
    {
        "show_id": 2,
        "name": "Trajetória",
        "season": 2,
        "episode": 16,
        "description": "Uma nova speedster chamada Trajetória aparece e consegue ser mais rápida do que Barry. Ela invade os Laboratórios S.T.A.R. em busca de ainda mais poder, a qualquer custo.",
        "when": "2016-03-22"
    },
    {
        "show_id": 2,
        "name": "Flash Back",
        "season": 2,
        "episode": 17,
        "description": "Barry aprende como a viagem no tempo funciona e os perigos dela, quando ele corre para o passado para saber como ficar mais rápido.",
        "when": "2016-03-29"
    },
    {
        "show_id": 2,
        "name": "Contra Zoom",
        "season": 2,
        "episode": 18,
        "description": "A equipe monta a história da origem de Zoom e a usa para preparar uma armadilha. Mas quando Wally acaba em perigo, Barry é obrigado a fazer um sacrifício.",
        "when": "2016-04-19"
    },
    {
        "show_id": 2,
        "name": "De Volta ao Normal",
        "season": 2,
        "episode": 19,
        "description": "Um meta-humano super forte procura o Dr. Wells em busca de uma cura. Caitlin e Nevasca trocam histórias enquanto estão presas na toca de Zoom.",
        "when": "2016-04-26"
    },
    {
        "show_id": 2,
        "name": "Ruptura",
        "season": 2,
        "episode": 20,
        "description": "A equipe usa suas habilidades científicas para encobrir os poderes de Barry que sumiram. Zoom e Caitlin voltam à Terra-1. Barry encara uma decisão arriscada.",
        "when": "2016-05-03"
    },
    {
        "show_id": 2,
        "name": "O Dinossauro Fujão",
        "season": 2,
        "episode": 21,
        "description": "Barry faz uma jornada pela força da velocidade, revisitando momentos e pessoas importantes na sua vida. Recriar o acidente tem um efeito inesperado.",
        "when": "2016-05-10"
    },
    {
        "show_id": 2,
        "name": "Invencível",
        "season": 2,
        "episode": 22,
        "description": "Zoom e seu novo bando de meta-humanos estão destruindo a Terra-1. Barry se sente imbatível, mas Zoom quer provar que eles são mais parecidos do que diferentes.",
        "when": "2016-05-17"
    },
    {
        "show_id": 2,
        "name": "A Corrida de Sua Vida",
        "season": 2,
        "episode": 23,
        "description": "Zoom desafia Barry para uma corrida, mas a equipe suspeita de uma armadilha e tenta convencer Barry a não topar. Só um speedster sobreviverá à épica luta final.",
        "when": "2016-05-24"
    },
    {
        "show_id": 2,
        "name": "Ponto de Ignição",
        "season": 3,
        "episode": 1,
        "description": "Após alterar o passado, Barry enfrenta problemas com sua nova vida quando começa a perder a memória. Central City ganha um novo velocista.",
        "when": "2016-10-04"
    },
    {
        "show_id": 2,
        "name": "Paradoxo",
        "season": 3,
        "episode": 2,
        "description": "Barry descobre as duras consequências de mexer com o tempo. Com superpoderes, Clariss leva a equipe até um inimigo ainda mais perigoso.",
        "when": "2016-10-11"
    },
    {
        "show_id": 2,
        "name": "Magenta",
        "season": 3,
        "episode": 3,
        "description": "Vítima de abuso, a garota Frankie Kane desenvolve uma personalidade alternativa com poderes magnéticos. Harry se aconselha com Jesse, da Terra 1.",
        "when": "2016-10-18"
    },
    {
        "show_id": 2,
        "name": "Novos Trapaceiros",
        "season": 3,
        "episode": 4,
        "description": "Dois antigos comparsas de Leonard Snart escapam de uma dimensão de espelhos para atacarem Central City. Barry continua treinando Jesse.",
        "when": "2016-10-25"
    },
    {
        "show_id": 2,
        "name": "Monstro",
        "season": 3,
        "episode": 5,
        "description": "A Equipe Flash precisa enfrentar uma criatura gigante que aparece e desaparece com facilidade. Em busca de respostas, Caitlin visita a mãe em segredo.",
        "when": "2016-11-01"
    },
    {
        "show_id": 2,
        "name": "Sombra",
        "season": 3,
        "episode": 6,
        "description": "Após enviar um meta-humano sombrio para manter Flash ocupado, Alquimia tenta recrutar Wally oferecendo-lhe os superpoderes dos seus sonhos.",
        "when": "2016-11-15"
    },
    {
        "show_id": 2,
        "name": "Nevasca",
        "season": 3,
        "episode": 7,
        "description": "Barry promete acabar com Savitar, o autoproclamado deus da velocidade, enquanto Joe tenta salvar Wally. Caitlin se vê sufocada por seu lado maligno.",
        "when": "2016-11-22"
    },
    {
        "show_id": 2,
        "name": "Invasão!",
        "season": 3,
        "episode": 8,
        "description": "Quando uma raça alienígena ameaça todos os meta-humanos, Barry se une a Supergirl e às equipes Arqueiro e Lendas para uma batalha histórica.",
        "when": "2016-11-29"
    },
    {
        "show_id": 2,
        "name": "O Presente",
        "season": 3,
        "episode": 9,
        "description": "Barry pede ajuda a Jay Garrick, da Terra 3, na luta contra Savitar. Os heróis veem uma oportunidade após descobrirem a identidade de Alquimia.",
        "when": "2016-12-06"
    },
    {
        "show_id": 2,
        "name": "Problemas Emprestados do Futuro",
        "season": 3,
        "episode": 10,
        "description": "As visões do futuro fazem Barry refletir sobre os esforços de Wally como Kid Flash. H.R. inaugura o museu. Caitlin faz um pedido especial a Julian.",
        "when": "2017-01-24"
    },
    {
        "show_id": 2,
        "name": "Morto ou Vivo",
        "season": 3,
        "episode": 11,
        "description": "Cisco enfrenta um combate mortal após desafiar uma caçadora de recompensas da Terra 19. Iris convence Wally a ajudá-la a prender um traficante de armas.",
        "when": "2017-01-31"
    },
    {
        "show_id": 2,
        "name": "Intocável",
        "season": 3,
        "episode": 12,
        "description": "A Equipe Flash está muito ocupada quando um meta-humano com toque destruidor começa a matar os colegas dos policiais que o prenderam em Flashpoint.",
        "when": "2017-02-07"
    },
    {
        "show_id": 2,
        "name": "Ataque na Cidade Gorilla",
        "season": 3,
        "episode": 13,
        "description": "Enquanto Wally e Jesse lidam com criminosos em Central City, o resto da equipe tenta resgatar Harry de Grodd em Gorilla City.",
        "when": "2017-02-21"
    },
    {
        "show_id": 2,
        "name": "Ataque em Central City",
        "season": 3,
        "episode": 14,
        "description": "Grodd e suas forças planejam um grande ataque à cidade de Central City. Barry começa a achar que sua única opção é matar o gorila.",
        "when": "2017-02-28"
    },
    {
        "show_id": 2,
        "name": "A Fúria de Savitar",
        "season": 3,
        "episode": 15,
        "description": "Wally fala com a equipe depois que as visões de Savitar se tornam perigosamente físicas. Uma visita inesperada o deixa ainda mais desorientado.",
        "when": "2017-03-07"
    },
    {
        "show_id": 2,
        "name": "Entrando na Força de Aceleração",
        "season": 3,
        "episode": 16,
        "description": "Desesperado, Barry encontra inimigos e aliados após entrar na Força de Aceleração para salvar Wally. Jesse decide enfrentar Savitar.",
        "when": "2017-03-14"
    },
    {
        "show_id": 2,
        "name": "Dueto",
        "season": 3,
        "episode": 17,
        "description": "Após serem colocados em coma pelo Mestre da Música, Barry e Kara se veem forçados a participar de um musical.",
        "when": "2017-03-21"
    },
    {
        "show_id": 2,
        "name": "Abra Kadabra",
        "season": 3,
        "episode": 18,
        "description": "Cigana persegue um criminoso do século 64 que chega a Central City e oferece informações valiosas em troca de liberdade.",
        "when": "2017-03-28"
    },
    {
        "show_id": 2,
        "name": "O Único e Eterno Flash",
        "season": 3,
        "episode": 19,
        "description": "Enquanto a maior parte da equipe está em 2017 em busca da Nevasca, Barry viaja ao futuro para tentar descobrir a identidade de Savitar.",
        "when": "2017-04-25"
    },
    {
        "show_id": 2,
        "name": "Eu Sei Quem Você é",
        "season": 3,
        "episode": 20,
        "description": "Barry, Cisco e H.R. precisam deter Nevasca, que está cada vez mais agressiva, enquanto procuram a mulher destinada a acabar com Savitar.",
        "when": "2017-05-02"
    },
    {
        "show_id": 2,
        "name": "Causa e Efeito",
        "season": 3,
        "episode": 21,
        "description": "H.R. e Tracy correm para construir a armadilha da Força de Aceleração. A verdade sobre a origem de Savitar inspira Cisco e Julian a tentarem uma solução arriscada.",
        "when": "2017-05-09"
    },
    {
        "show_id": 2,
        "name": "Rua Infantino",
        "season": 3,
        "episode": 22,
        "description": "Enquanto a Equipe Flash localiza a única fonte de energia capaz de ativar a bazuca, Barry vai parar no ano 1892 para recrutar um improvável aliado especializado em roubo.",
        "when": "2017-05-16"
    },
    {
        "show_id": 2,
        "name": "Linha de Chegada",
        "season": 3,
        "episode": 23,
        "description": "Depois que Savitar inicia um plano urgente para se dispersar pelo tempo, Barry percebe que sua melhor opção é enfrentar o resquício do tempo.",
        "when": "2017-05-23"
    },
    {
        "show_id": 2,
        "name": "O Flash Renasce",
        "season": 4,
        "episode": 1,
        "description": "Enquanto Barry continua preso na força da velocidade, um novo e poderoso vilão faz um ultimato mortal, deixando Iris e a turma em uma difícil situação.",
        "when": "2017-10-10"
    },
    {
        "show_id": 2,
        "name": "Sinais Confusos",
        "season": 4,
        "episode": 2,
        "description": "Com dificuldades para se ajustar ao novo traje de Cisco, Barry enfrenta um meta perigoso que tem o poder de controlar a tecnologia.",
        "when": "2017-10-17"
    },
    {
        "show_id": 2,
        "name": "Que a Sorte Seja uma Mulher",
        "season": 4,
        "episode": 3,
        "description": "Depois de serem atingidos por uma sequência de acidentes e problemas, Barry e a turma percebem que isso pode ser mais que uma mera falta de sorte.",
        "when": "2017-10-24"
    },
    {
        "show_id": 2,
        "name": "Longa Jornada Noite Adentro",
        "season": 4,
        "episode": 4,
        "description": "Cisco se assusta ao ver Gypsy e seu pai, Breacher, na Terra-1. Barry enfrenta um velho inimigo, o evasivo Ralph Dibny.",
        "when": "2017-10-31"
    },
    {
        "show_id": 2,
        "name": "A Noite das Garotas",
        "season": 4,
        "episode": 5,
        "description": "Enquanto Barry e os rapazes vão a uma despedida de solteiro, Iris se diverte em uma noitada com as meninas. Mas eles enfrentam alguns imprevistos.",
        "when": "2017-11-07"
    },
    {
        "show_id": 2,
        "name": "Quando Harry Conheceu Harry",
        "season": 4,
        "episode": 6,
        "description": "Ralph Dibny veste o traje personalizado de Cisco e descobre como é ser o Homem Elástico. Um inimigo ataca colecionadores de artefatos indígenas.",
        "when": "2017-11-14"
    },
    {
        "show_id": 2,
        "name": "Logo Existo",
        "season": 4,
        "episode": 7,
        "description": "As suspeitas de Barry em relação à identidade e as intenções de DeVoe geram discórdia com o resto da equipe. Iris se prepara para o grande casamento.",
        "when": "2017-11-21"
    },
    {
        "show_id": 2,
        "name": "Crise na Terra-X - Parte 3",
        "season": 4,
        "episode": 8,
        "description": "Barry se junta aos heróis Supergirl, Arqueiro Verde e os Legends of Tomorrow para combater uma invasão traiçoeira da Terra-X.",
        "when": "2017-11-28"
    },
    {
        "show_id": 2,
        "name": "Não Corra",
        "season": 4,
        "episode": 9,
        "description": "Com Barry imobilizado em uma prisão à prova de velocidade e Amunet mantendo Caitlin como refém, a equipe enfrenta a difícil escolha de quem salvar.",
        "when": "2017-12-05"
    },
    {
        "show_id": 2,
        "name": "O Julgamento do Flash",
        "season": 4,
        "episode": 10,
        "description": "Acusado e sendo julgado por um crime que não cometeu, Barry deve decidir se é hora de revelar seu alter ego para o mundo.",
        "when": "2018-01-16"
    },
    {
        "show_id": 2,
        "name": "Surge o Cavaleiro Elástico",
        "season": 4,
        "episode": 11,
        "description": "Um inimigo retorna à Central City e testa o heroísmo de Ralph. Barry tenta ficar otimista, apesar da situação complicada.",
        "when": "2018-01-23"
    },
    {
        "show_id": 2,
        "name": "Querida, Encolhi o Time Flash",
        "season": 4,
        "episode": 12,
        "description": "Sylbert Rundine pode encolher tudo o que toca. Cisco e Ralph percebem isso pessoalmente ao lutar com o meta-humano.",
        "when": "2018-01-30"
    },
    {
        "show_id": 2,
        "name": "Verdadeiras Cores",
        "season": 4,
        "episode": 13,
        "description": "Barry recebe notícias terríveis sobre os planos de Amunet e precisa fazer uma escolha perigosa para salvar seus colegas de cela.",
        "when": "2018-02-06"
    },
    {
        "show_id": 2,
        "name": "Sujeita 9",
        "season": 4,
        "episode": 14,
        "description": "Barry e a equipe são ajudados de forma inesperada por um talento musical que impressiona a todos. Ralph reavalia suas prioridades.",
        "when": "2018-02-27"
    },
    {
        "show_id": 2,
        "name": "Entre no tempo do Flash",
        "season": 4,
        "episode": 15,
        "description": "Barry retarda o tempo ao máximo enquanto procura desesperadamente uma forma de impedir que uma bomba destrua Central City.",
        "when": "2018-03-06"
    },
    {
        "show_id": 2,
        "name": "Corre Iris, Corre",
        "season": 4,
        "episode": 16,
        "description": "Depois de enfrentar um novo inimigo, Iris adquire toda a velocidade de Barry e assume um novo papel: a heroína que deve proteger Central City.",
        "when": "2018-03-13"
    },
    {
        "show_id": 2,
        "name": "Nula e Irritada",
        "season": 4,
        "episode": 17,
        "description": "A maneira desleixada como Ralph procura os metas do ônibus testa a paciência de Barry. Cisco responde a um favor solicitado por Breacher.",
        "when": "2018-04-10"
    },
    {
        "show_id": 2,
        "name": "Se Perder",
        "season": 4,
        "episode": 18,
        "description": "Enquanto a Equipe Flash se prepara para enfrentar o Pensador, Ralph avalia tomar uma medida arriscada. O comportamento de Harry preocupa Joe.",
        "when": "2018-04-17"
    },
    {
        "show_id": 2,
        "name": "Criminosa em Fúria",
        "season": 4,
        "episode": 19,
        "description": "Precisando de ajuda para transportar um meta explosivo, Barry e a Equipe Flash pedem ajuda a Leo Snart, também conhecido como Cidadão Frio.",
        "when": "2018-04-24"
    },
    {
        "show_id": 2,
        "name": "Portanto, Ela é",
        "season": 4,
        "episode": 20,
        "description": "Gipsy ajuda Barry e a equipe Flash em uma tentativa desesperada de impedir que o plano do Pensador tenha sucesso.",
        "when": "2018-05-01"
    },
    {
        "show_id": 2,
        "name": "Harry e os Harrisons",
        "season": 4,
        "episode": 21,
        "description": "Barry e a equipe Flash fazem um acordo arriscado com um parceiro improvável. Depois de receber notícias ruins, Harry é aconselhado por Cisco.",
        "when": "2018-05-08"
    },
    {
        "show_id": 2,
        "name": "Pensa Rápido",
        "season": 4,
        "episode": 22,
        "description": "Com a proximidade da cartada final de DeVoe, Barry enfrenta uma decisão angustiante: lutar sozinho ou pedir ajuda a seus amigos e colocar suas vidas em risco.",
        "when": "2018-05-15"
    },
    {
        "show_id": 2,
        "name": "Nós Somos o Flash",
        "season": 4,
        "episode": 23,
        "description": "Barry faz uma tentativa ousada de penetrar na consciência de DeVoe. Uma ajuda inesperada chega na hora certa para a equipe Flash.",
        "when": "2018-05-22"
    },
    {
        "show_id": 2,
        "name": "Nora",
        "season": 5,
        "episode": 1,
        "description": "Enquanto a Equipe Flash persegue um sinistro meta-humano, Barry e Iris lutam para entender seu convidado de uma outra era.",
        "when": "2018-10-09"
    },
    {
        "show_id": 2,
        "name": "Bloqueado",
        "season": 5,
        "episode": 2,
        "description": "Barry ensina a Nora como é ser um velocista. Os membros da Equipe Flash descobrem que seu novo inimigo quer a mesma coisa que eles.",
        "when": "2018-10-16"
    },
    {
        "show_id": 2,
        "name": "A Morte do Vibro",
        "season": 5,
        "episode": 3,
        "description": "Caitlin procura respostas sobre seu passado, e os membros da Equipe Flash se reúnem na esperança de impedir o ataque de Cicada.",
        "when": "2018-10-23"
    },
    {
        "show_id": 2,
        "name": "Notícias de Última Hora",
        "season": 5,
        "episode": 4,
        "description": "Nora chama a atenção de uma blogueira ambiciosa e perigosa. Ralph precisa de uma massagem no ego.",
        "when": "2018-10-30"
    },
    {
        "show_id": 2,
        "name": "Todo Embonecado",
        "season": 5,
        "episode": 5,
        "description": "Um novo meta perigoso e perturbador pega Barry desprevenido. Iris descobre um fato angustiante sobre o futuro.",
        "when": "2018-11-13"
    },
    {
        "show_id": 2,
        "name": "A Chegada da Geada",
        "season": 5,
        "episode": 6,
        "description": "Caitlin se vê ansiosa para se reconectar com o pai. Iris e Sherloque investigam uma pista sobre Cicada.",
        "when": "2018-11-20"
    },
    {
        "show_id": 2,
        "name": "Sejamos Gratos",
        "season": 5,
        "episode": 7,
        "description": "A Equipe Flash se prepara para uma luta tempestuosa contra a poderosa Bruxa do Tempo. Nora tenta se conformar com o desaparecimento de seu pai.",
        "when": "2018-11-27"
    },
    {
        "show_id": 2,
        "name": "O Passado é Um Prólogo",
        "season": 5,
        "episode": 8,
        "description": "Barry e sua filha precisam voltar no tempo para deter Cicada. Mas será que Barry está pronto para compartilhar seu passado com Nora?",
        "when": "2018-12-04"
    },
    {
        "show_id": 2,
        "name": "Outros Mundos – Parte 1",
        "season": 5,
        "episode": 9,
        "description": "Oliver Queen, mais conhecido como Arqueiro, acorda e descobre que trocou de corpo com Barry Allen. Mas convencer a Equipe Flash não vai ser fácil.",
        "when": "2018-12-09"
    },
    {
        "show_id": 2,
        "name": "Flash & Furiosos",
        "season": 5,
        "episode": 10,
        "description": "Nora lida com uma revelação preocupante, e a Equipe Flash enfrenta uma dupla terrível. Caitlin e Cisco discutem uma possível cura meta-humana.",
        "when": "2019-01-15"
    },
    {
        "show_id": 2,
        "name": "Vendo em Vermelho",
        "season": 5,
        "episode": 11,
        "description": "A cura rápida de Nora para de funcionar. Barry sente uma raiva nada familiar. O trabalho de Caitlin para encontrar uma cura sofre interferências.",
        "when": "2019-01-22"
    },
    {
        "show_id": 2,
        "name": "Memorabilia",
        "season": 5,
        "episode": 12,
        "description": "Desesperada para impedir que seus pais descubram seus segredos, Nora toma uma medida drástica. Ralph leva Cisco para passear na cidade.",
        "when": "2019-01-29"
    },
    {
        "show_id": 2,
        "name": "Áureo",
        "season": 5,
        "episode": 13,
        "description": "Com esperança de acabar com Cicada, Barry e Ralph se infiltram no submundo do crime onde acabam tendo sua integridade testada.",
        "when": "2019-02-05"
    },
    {
        "show_id": 2,
        "name": "Causa e XS",
        "season": 5,
        "episode": 14,
        "description": "Nora corre para salvar sua mãe de um perigo. Barry trabalha para finalizar a cura meta-humana. Cisco chega à cidade com Kamilla.",
        "when": "2019-02-12"
    },
    {
        "show_id": 2,
        "name": "Tubarão-Rei vs. Gorila Grodd",
        "season": 5,
        "episode": 15,
        "description": "Quando Gorilla Grodd lança um ataque a Central City, Barry e a Equipe Flash precisam lutar ao lado de um aliado inesperado.",
        "when": "2019-03-05"
    },
    {
        "show_id": 2,
        "name": "A Falha é uma Órfã",
        "season": 5,
        "episode": 16,
        "description": "Barry e a Equipe Flash buscam uma maneira de forçar Cicada a provar a cura meta-humana. Joe volta ao trabalho.",
        "when": "2019-03-12"
    },
    {
        "show_id": 2,
        "name": "Bomba relógio",
        "season": 5,
        "episode": 17,
        "description": "Barry e a Equipe Flash encontram uma mulher que guarda um segredo profundo de sua própria família. Nora considera revelar a verdade sobre seu trabalho com Thawne.",
        "when": "2019-03-19"
    },
    {
        "show_id": 2,
        "name": "Godspeed",
        "season": 5,
        "episode": 18,
        "description": "Barry e Iris discutem sobre como lidar com a parceria da filha. A Equipe Flash procura por respostas no diário de Nora.",
        "when": "2019-04-16"
    },
    {
        "show_id": 2,
        "name": "Bando da Neve",
        "season": 5,
        "episode": 19,
        "description": "Barry toma uma grande decisão familiar sem a contribuição de Iris e ela decide tomar as rédeas da situação. Caitlin e sua mãe precisam se unir contra um inimigo gelado.",
        "when": "2019-04-23"
    },
    {
        "show_id": 2,
        "name": "As Vilãs",
        "season": 5,
        "episode": 20,
        "description": "Um trio de vilões causa estragos em Central City. Barry luta para aceitar a traição de sua filha.",
        "when": "2019-04-30"
    },
    {
        "show_id": 2,
        "name": "A Garota Com o Raio Vermelho",
        "season": 5,
        "episode": 21,
        "description": "Quando descobrem a ameaça de Cicada II de liberar um vírus devastador, Barry e a Equipe Flash precisam se preparar para o pior.",
        "when": "2019-05-07"
    },
    {
        "show_id": 2,
        "name": "Legado",
        "season": 5,
        "episode": 22,
        "description": "A Equipe Flash decide destruir a adaga do Cicada de uma vez por todas. Cisco se abre para Kamilla e Nora se esforça para se perdoar.",
        "when": "2019-05-14"
    },
    {
        "show_id": 2,
        "name": "Salto no Vazio",
        "season": 6,
        "episode": 1,
        "description": "Barry e Iris lidam com a perda devastadora de sua filha enquanto a equipe enfrenta sua maior ameaça.",
        "when": "2019-10-08"
    },
    {
        "show_id": 2,
        "name": "O Clarão de um Relâmpago",
        "season": 6,
        "episode": 2,
        "description": "Barry enfrenta a notícia de sua morte iminente; a carreira de Cecile como D.A. entra em conflito com sua identidade quando ela cruza o caminho de um meta-humano perverso.",
        "when": "2019-10-15"
    },
    {
        "show_id": 2,
        "name": "Um Morto Que Corre",
        "season": 6,
        "episode": 3,
        "description": "Sabendo que Crisis está a apenas algumas semanas, Barry prepara um membro do Team Flash para a vida sem ele, enquanto caça um meta-humano aterrorizante com uma sede insaciável. Enquanto isso, Ralph descobre um segredo de família.",
        "when": "2019-10-22"
    },
    {
        "show_id": 2,
        "name": "O Sangue Vai Correr",
        "season": 6,
        "episode": 4,
        "description": "Barry quer preparar Cisco para a crise, mas o mesmo planeja salvar a vida do herói; Ramsey Rosso usa suas novas habilidades mortais para salvar sua própria vida, enquanto sacrifica sua humanidade no processo.",
        "when": "2019-10-29"
    },
    {
        "show_id": 2,
        "name": "Beijo Beijo Brecha Brecha",
        "season": 6,
        "episode": 5,
        "description": "Cisco começa a perder a confiança em si mesmo quando descobre um assassinato brutal; Frost está convencida de que só ela pode capturar o perigoso Ramsey Rosso.",
        "when": "2019-11-05"
    },
    {
        "show_id": 2,
        "name": "Licença para Alongar",
        "season": 6,
        "episode": 6,
        "description": "Barry se concentra em preparar o Homem Elástico para enfrentar a Crise nas Infinitas Terras sem Flash; Cecile ajuda Chester P. Runk a recuperar sua identidade.",
        "when": "2019-11-19"
    },
    {
        "show_id": 2,
        "name": "A Última Tentação de Barry Allen, Parte: 1",
        "season": 6,
        "episode": 7,
        "description": "Enquanto Barry Allen está no limiar de sua morte iminente em Crise, suas convicções são testadas quando o monstruoso Dr. Ramsey Rosso infecta o Flash com um misterioso contágio alucinógeno. Enquanto isso, a repórter Iris West-Allen descobre uma vasta conspiração.",
        "when": "2019-11-26"
    },
    {
        "show_id": 2,
        "name": "A Última Tentação de Barry Allen, Parte: 2",
        "season": 6,
        "episode": 8,
        "description": "Iris e Cisco lutam para ajudar Barry a assumir o controle antes de se perder para sempre; a equipe se esforça para recuperar o comando de Central City.",
        "when": "2019-12-03"
    },
    {
        "show_id": 2,
        "name": "Crise nas Infinitas Terras - Parte 3",
        "season": 6,
        "episode": 9,
        "description": "Pária recruta Raio Negro para ajudar a parar o Anti-Monitor após o Flash-90 compartilhar o que ele aprendeu em sua batalha no Multiverso. Com a ajuda do Raio Negro, Barry Cisco e Nevasca apresentam um plano que pode salvá-los. Iris se aproxima de Ryan Choi, enquanto Oliver e Diggle enfrentam uma situação familiar.",
        "when": "2019-12-10"
    },
    {
        "show_id": 2,
        "name": "Maratona",
        "season": 6,
        "episode": 10,
        "description": "Depois que The Citizen imprime uma história explosiva, a vida de Iris é ameaçada. Recusando-se a se esconder daqueles que a estão atacando, Iris decide expor uma organização perigosa. Enquanto isso, Barry deve enfrentar as consequências da crise e cumprir o desejo de Oliver Queen por ele.",
        "when": "2020-02-04"
    },
    {
        "show_id": 2,
        "name": "O Amor é um Campo de Batalha",
        "season": 6,
        "episode": 11,
        "description": "Barry e Iris planejam um jantar romântico para o Dia dos Namorados, mas a noite é interrompida por um velho inimigo Amunet Black. Nevasca entra no espírito do feriado e tenta ajudar Allegra a se reconectar com um antigo amor.",
        "when": "2020-02-11"
    },
    {
        "show_id": 2,
        "name": "A Garota Chamada Sue",
        "season": 6,
        "episode": 12,
        "description": "Depois de meses procurando por Sue Dearbon, Ralph descobre a localização de seu paradeiro e finalmente fica cara a cara com seu cliente desaparecido. No entanto, Sue se recusa a voltar para casa e para sua família e, em vez disso, leva Ralph em uma aventura ousada. Iris enfrenta um novo desafio, enquanto Barry considera uma solicitação potencialmente perigosa de uma fonte confiável.",
        "when": "2020-02-18"
    },
    {
        "show_id": 2,
        "name": "Grodd Me Aceitou Como Amigo",
        "season": 6,
        "episode": 13,
        "description": "Sentindo-se sobrecarregado com todas as mudanças desde a crise, Barry conduz um experimento que dá errado e o coloca diretamente no caminho do Gorila Grodd. Esperando o pior, Barry fica surpreso quando Grodd pede sua ajuda. Infelizmente para Flash e Grodd, as coisas pioram quando outro vilão aparece Solovar. Enquanto isso, Iris trabalha com Eva para escapar do Mirrorverse.",
        "when": "2020-02-25"
    },
    {
        "show_id": 2,
        "name": "A Morte da Força de Aceleração",
        "season": 6,
        "episode": 14,
        "description": "Kid Flash, Wally West, retorna para a Central City com uma atitude zen e novos truques na manga. Animado por ver sua família novamente, Wally diz a Barry que ele retornou porque acha que tem algo errado com a força de aceleração. Enquanto isso, Cisco retorna de sua pesquisa.",
        "when": "2020-03-10"
    },
    {
        "show_id": 2,
        "name": "O Exorcismo de Nash Wells",
        "season": 6,
        "episode": 15,
        "description": "Flash enfrenta uma nova e perigosa meta chamada Sunshine. Cisco tenta ajudar Nash.",
        "when": "2020-03-17"
    },
    {
        "show_id": 2,
        "name": "Até Logo e Boa Noite",
        "season": 6,
        "episode": 16,
        "description": "Depois que Black Hole contrata Rag Doll para matar Joe, Singh sugere que ele entre na Proteção a Testemunha, mas Joe se recusa a parar de investigar Carver. Enquanto investiga Carver com a Cisco, Ralph encontra Sue. Iris suspeita de Eva.",
        "when": "2020-04-21"
    },
    {
        "show_id": 2,
        "name": "Libertação",
        "season": 6,
        "episode": 17,
        "description": "Após eventos recentes, Barry olha mais de perto sua vida com Iris. Eva faz uma jogada ousada.",
        "when": "2020-04-28"
    },
    {
        "show_id": 2,
        "name": "Pague o Flautista",
        "season": 6,
        "episode": 18,
        "description": "Quando Godspeed retorna, Barry pede ajuda a Hartley Rathaway. No entanto, as coisas ficam tensas rapidamente depois que Barry percebe que uma das mudanças de Crisis é que o Flash e o Flautista agora são inimigos. Enquanto isso, Iris tenta escapar do universo espelhado.",
        "when": "2020-05-05"
    },
    {
        "show_id": 2,
        "name": "O Sucesso é Garantido",
        "season": 6,
        "episode": 19,
        "description": "Barry considera um plano arriscado para salvar Iris do universo espelhado. Ralph tenta impedir Sue de cometer um erro grave que pode destruir sua vida.",
        "when": "2020-05-12"
    },
    {
        "show_id": 2,
        "name": "Tudo Está Bem Quando Termina em Wells",
        "season": 7,
        "episode": 1,
        "description": "Quando um experimento para salvar a velocidade de Barry dá errado, Nash Wells procura por um meio de salvar o Flash com um plano perigoso. Enquanto isso, Iris começa a perceber algo dentro da Dimensão Espelhada, e Cecile enfrenta Rosa Dillon.",
        "when": "2021-03-02"
    },
    {
        "show_id": 2,
        "name": "A Velocidade do Pensamento",
        "season": 7,
        "episode": 2,
        "description": "Quando Barry ganha o poder de pensamento rápido, ele tenta usar sua mais nova habilidade para salvar Iris. Enquanto Barry está animado com seu novo poder, Cisco está hesitante em confiar. Enquanto isso, Eva deve enfrentar uma verdade arrasadora.",
        "when": "2021-03-09"
    },
    {
        "show_id": 2,
        "name": "Mãe",
        "season": 7,
        "episode": 3,
        "description": "Conforme Eva se torna mais poderosa, Barry e o time devem encontrar uma maneira de detê-la. Eles se surpreendem quando uma antiga amiga – Sue Dearbon arrisca sua vida para ajudá-los.",
        "when": "2021-03-16"
    },
    {
        "show_id": 2,
        "name": "Central City Forte",
        "season": 7,
        "episode": 4,
        "description": "O Flash deve lidar com o retorno de Abra Kadabra à Central City. O vilão está de volta com uma vingança e uma conta a acertar. Enquanto isso, Allegra lida com uma situação e Caitlin suspeita que algo está errado com Nevasca. Iris é forçada a olhar para um momento sombrio de seu passado.",
        "when": "2021-03-23"
    },
    {
        "show_id": 2,
        "name": "Tenham Medo de Mim",
        "season": 7,
        "episode": 5,
        "description": "Quando um novo vilão poderoso, Psych, canaliza e amplifica o medo das pessoas para causar a destruição por Central City, Barry percebe, com a ajuda de Cecile, que ele deve enfrentar seus próprios medos para poder derrotar essa nova ameaça. Enquanto isso, Joe se surpreende quando Kristen Kramer aparece na CCPD para uma visita. Iris aconselha seu pai a investigar mais o motivo da visita de Kristen. Caitlin e Nevasca argumentam sobre como viver suas vidas.",
        "when": "2021-03-30"
    },
    {
        "show_id": 2,
        "name": "Aquele com os Anos Noventa",
        "season": 7,
        "episode": 6,
        "description": "Cisco e Chester viajam no tempo e ficam presos no 1998, revivendo o mesmo dia repetidamente. A chave para voltar ao seu tempo é a casa de infância de Chester, mas ele recusa a visitá-lo. Enquanto isso, Iris forma uma conexão com a força de aceleração.",
        "when": "2021-04-06"
    },
    {
        "show_id": 2,
        "name": "Dores em Crescimento",
        "season": 7,
        "episode": 7,
        "description": "Quando um inimigo misterioso com poderes de gelo acusa Nevasca de um crime brutal, ela deve encontrar uma maneira de limpar seu nome. Enquanto isso, Barry e Iris recebem um convidado inesperado, e Joe continua a lidar com Kristen Kramer.",
        "when": "2021-04-13"
    },
    {
        "show_id": 2,
        "name": "O Povo vs. Nevasca",
        "season": 7,
        "episode": 8,
        "description": "Com Nevasca enfrentando uma punição injusta por seus crimes do passado, Caitlin fará de tudo para salvar sua irmã. Enquanto isso, os esforços de Barry para proteger a Força de Aceleração o levam a fazer uma descoberta chocante.",
        "when": "2021-05-04"
    },
    {
        "show_id": 2,
        "name": "Wells Atemporal",
        "season": 7,
        "episode": 9,
        "description": "Depois de uma traição devastadora, Barry pede ajuda para Harrison Wells. Enquanto isso, Iris lidera o Time Citizen em um caminho perigoso em busca de respostas e Cisco conta seu maior medo para Kamilla.",
        "when": "2021-05-11"
    },
    {
        "show_id": 2,
        "name": "Assuntos de Família, Parte 1",
        "season": 7,
        "episode": 10,
        "description": "Iris é levada ao limite enquanto busca descobrir a misteriosa verdade sobre Psych. Enquanto isso, Barry inicia um novo sistema de treinamento, que pode sair pela culatra, com consequências devastadoras. Joe e Cisco tomam decisões que mudam suas vidas.",
        "when": "2021-05-18"
    },
    {
        "show_id": 2,
        "name": "Assuntos de Família, Parte 2",
        "season": 7,
        "episode": 11,
        "description": "Barry e Iris devem trabalhar juntos para tentar impedir uma força perigosa que ameaça destruir Central City.",
        "when": "2021-05-25"
    },
    {
        "show_id": 2,
        "name": "Adeus Vibrações",
        "season": 7,
        "episode": 12,
        "description": "Cisco e Kamilla dizem para a equipe que estão deixando Central City. Porém, quando uma nova versão do Pirata do Arco-íris ataca, Barry, Iris e Caitlin não possuem muito tempo para lidar com essa notícia. A Equipe Flash original deve se unir uma última vez para salvar a cidade.",
        "when": "2021-06-08"
    },
    {
        "show_id": 2,
        "name": "Mascarada",
        "season": 7,
        "episode": 13,
        "description": "Cecile é forçada a confrontar seu passado para poder se libertar de uma prisão psíquica. Enquanto isso, Chester assume as coisas depois da saída de Cisco, mas um erro coloca a vida de Barry em um grave perigo. Joe investiga o passado militar de Kristen Kramer e descobre uma verdade chocante.",
        "when": "2021-06-15"
    },
    {
        "show_id": 2,
        "name": "Raio de Luz",
        "season": 7,
        "episode": 14,
        "description": "Quando Ultravioleta retorna à Central City, Allegra está determinada a encontrar sua prima e mudar seu coração. Enquanto isso, Joe encontra evidências de que Kristen Kramer pode não ser a policial boa que parece ser.",
        "when": "2021-06-22"
    },
    {
        "show_id": 2,
        "name": "Inimigos nos Portões",
        "season": 7,
        "episode": 15,
        "description": "Quando um exército de Godspeeds ataca Central City, Barry e Iris devem colocar seus planos de criar uma família de lado para se focarem na mais nova ameaça. Enquanto isso, Chillblaine é libertado da prisão e diz ter mudado, mas Nevasca possuí suas dúvidas.",
        "when": "2021-06-29"
    },
    {
        "show_id": 2,
        "name": "P.O.W.",
        "season": 7,
        "episode": 16,
        "description": "John Diggle chega a Central City com uma arma para ajudar Barry parar a Guerra de Godspeed. Enquanto isso, a conexão de Allegra e Ultravioleta é testada, enquanto Joe e Kristen Kramer são caçados por um antigo colega dela.",
        "when": "2021-07-06"
    },
    {
        "show_id": 2,
        "name": "O Coração da Questão, Parte 1",
        "season": 7,
        "episode": 17,
        "description": "Barry e Iris recebem seus filhos do futuro, XS e Bart, apenas para descobrir um segredo chocante que ameaça sua nova harmonia familiar. Enquanto isso, a guerra Godspeed se intensifica e ameaça destruir Central City.",
        "when": "2021-07-13"
    },
    {
        "show_id": 2,
        "name": "O Coração da Questão, Parte 2",
        "season": 7,
        "episode": 18,
        "description": "O Flash recruta uma horda de aliados velocistas, incluindo Iris e seus filhos do futuro, Bart e Nora West-Allen – para encerrar a guerra dos velocistas e derrotar um novo adversário letal: o maligno Godpeed.",
        "when": "2021-07-20"
    },
    {
        "show_id": 2,
        "name": "Episódio 1",
        "season": 8,
        "episode": 1,
        "description": "",
        "when": "2021-11-16"
    },
    {
        "show_id": 3,
        "name": "Piloto",
        "season": 1,
        "episode": 1,
        "description": "Kara Zor-El escapou de seu planeta, Krypton, durante sua destruição há anos com uma missão. E desde que chegou à Terra, ela conseguiu viver sem expor seus poderes, esses os quais compartilha com seu primo, o Super Homem. Agora, aos 24 anos, Kara ao ver alguém importante próximo a ela, em uma situação emergencial, decide entrar em ação usando os seus poderes. Depois de experimentar o que é ajudar a salvar vidas, decide assumir suas habilidades sobre-humanas e ser a heroína a qual sempre esteve destinada a ser. A Super Girl.",
        "when": "2015-10-26"
    },
    {
        "show_id": 3,
        "name": "Mais Fortes Juntos",
        "season": 1,
        "episode": 2,
        "description": "Quando a tentativa de Kara em ajudar Nacional City não sai conforme o planejado, ela deve colocar de lado as dúvidas que possui — e que a mídia da cidade levanta — sobre suas habilidades a fim de capturar um fugitivo da prisão kriptoniana, Fort Rozz. Ao mesmo tempo, Cat pressiona James a usar sua conexão com o Superman para conseguir uma entrevista com a Supergirl.",
        "when": "2015-11-02"
    },
    {
        "show_id": 3,
        "name": "Lutar ou Fugir",
        "season": 1,
        "episode": 3,
        "description": "Os poderes da Supergirl são testados quando Reactron, um dos inimigos mais formidáveis do Superman, chega a Nacional City e tem como alvo a jovem heroína. Ao mesmo tempo, Cat planeja publicar uma matéria expositiva a respeito da Supergirl.",
        "when": "2015-11-09"
    },
    {
        "show_id": 3,
        "name": "Circuito Elétrico",
        "season": 1,
        "episode": 4,
        "description": "O Dia de Ação de Graças de Kara pode ser arruinado, já que ela suspeita que sua mãe adotiva, Dra. Eliza Danvers — que está chegando para uma visita — desaprova seu novo papel como heroína. Ao mesmo tempo, um acidente transforma uma funcionária volátil da CatCo em Livewire, vilã que tem como alvo tanto a Supergirl quanto Cat.",
        "when": "2015-11-16"
    },
    {
        "show_id": 3,
        "name": "Como Ela Faz Isso?",
        "season": 1,
        "episode": 5,
        "description": "As duas identidades de Kara são levadas ao limite quando a Supergirl é chamada para proteger National City de uma série de bombardeios, ao mesmo tempo em que Kara recebe a tarefa de ser babá do filho de Cat, Carter. Ao mesmo tempo, James se mostra dividido quando sua ex-namorada, Lucy Lane, chega à cidade para retomar a relação.",
        "when": "2015-11-23"
    },
    {
        "show_id": 3,
        "name": "Tornado Vermelho",
        "season": 1,
        "episode": 6,
        "description": "O estresse pessoal e profissional leva a melhor perante Kara quando ela acaba indo longe demais durante um exercício de treinamento contra o Tornado Vermelho, um ciborgue militar comissionado pelo pai de Lucy Lane, o general Sam Lane. Ao mesmo tempo, o exterior imperturbável de Cat é abalado com a visita de sua mãe Katherine, uma mulher bastante crítica. Para completar, Alex pede ajuda de Winn a fim de investigar a morte misteriosa de seu pai.",
        "when": "2015-11-30"
    },
    {
        "show_id": 3,
        "name": "Humana Por Um Dia",
        "season": 1,
        "episode": 7,
        "description": "Kara e seus amigos devem confiar em suas forças interiores e na coragem quando um terremoto atinge National City. Ao mesmo tempo, a falta de confiança de Alex em Hank atinge o ápice quando o tremor de terra os prende no DEO junto a Jemm (participação de Charles Halford, de Constantine), um poderoso fugitivo alienígena.",
        "when": "2015-12-07"
    },
    {
        "show_id": 3,
        "name": "Aquisição Hostil",
        "season": 1,
        "episode": 8,
        "description": "Kara bate de frente com Astra quando sua tia desafia o que Kara acredita sobre sua mãe. Ao mesmo tempo, Cat recebe a ameaça de ser removida do cargo de CEO da CatCo quando um hacker expõe seus emails privados e prejudiciais.",
        "when": "2015-12-14"
    },
    {
        "show_id": 3,
        "name": "Laços de Sangue",
        "season": 1,
        "episode": 9,
        "description": "Com Astra mantida como prisioneira na DEO, seu marido, Non, vai atrás e captura Hank, o que leva a um tenso confronto entre os dois lados. Ao mesmo tempo, Kara continua a negar as alegações de Cat de que ela é a Supergirl.",
        "when": "2016-01-04"
    },
    {
        "show_id": 3,
        "name": "Coisas Infantis",
        "season": 1,
        "episode": 10,
        "description": "Kara dá o seu melhor para apoiar Winn quando seu pai, o super vilão Toyman, escapa da prisão e vai atrás do filho por razões desconhecidas. Enquanto isso, Cat oferece a Lucy um emprego na CatCo, ao mesmo tempo em que Alex pede a Hank para usar seus poderes a fim de descobrir os planos de Maxwell Lord.",
        "when": "2016-01-18"
    },
    {
        "show_id": 3,
        "name": "Estranho Visitante de Outro Planeta",
        "season": 1,
        "episode": 11,
        "description": "Kara deve ajudar Hank a enfrentar seu passado doloroso quando um White Martian, membro da raça alienígena que acabou com seu povo, sequestra a senadora Miranda Crane — uma governante que é contra os aliens. Enquanto isso, o filho distante de Cat, Adam, chega a National City.",
        "when": "2016-01-25"
    },
    {
        "show_id": 3,
        "name": "Bizarro",
        "season": 1,
        "episode": 12,
        "description": "Kara enfrenta sua imagem refletida quando Bizarro, uma versão distorcida da Supergirl, resolve destruir a heroína. Ao mesmo tempo, Kara fica cada vez mais próxima do filho de Cat, Adam.",
        "when": "2016-02-01"
    },
    {
        "show_id": 3,
        "name": "Para a Garota Que Tem Tudo",
        "season": 1,
        "episode": 13,
        "description": "Os amigos de Kara precisam encontrar uma forma de salvar sua vida quando um alienígena parasita se conecta com a heroína e a prende em um mundo de sonhos, no qual sua família está viva e seu planeta, intocado. Ao mesmo tempo, Alex, Hank e a DEO devem parar um ataque kriptoniano enquanto Kara está fora de combate.",
        "when": "2016-02-08"
    },
    {
        "show_id": 3,
        "name": "Verdade, Justiça e o Jeito Americano",
        "season": 1,
        "episode": 14,
        "description": "A Supergirl bate de frente com o mortal Master Jailer (no Brasil, o Carcereiro), que está caçando e executando prisioneiros que escaparam de Fort Rozz. Ao mesmo tempo, Cat contrata uma segunda assistente, Siobhan Smythe, alguém que imediatamente tenta passar por cima de Kara. Para completar, Kara e James discordam a respeito dos métodos da DEO.",
        "when": "2016-02-22"
    },
    {
        "show_id": 3,
        "name": "Solidão",
        "season": 1,
        "episode": 15,
        "description": "Kara viaja para a Fortaleza da Solidão do Super-Homem na esperança de aprender como derrotar Indigo (Laura Vandervoort), um ser perigoso que pode se transportar via internet e que tem uma ligação com o passado de Kara. Além disso, o relacionamento de James e Lucy chega a uma encruzilhada.",
        "when": "2016-02-29"
    },
    {
        "show_id": 3,
        "name": "Caindo",
        "season": 1,
        "episode": 16,
        "description": "Kara se vira contra os amigos e os cidadãos de National City após ser exposta à kryiptonita vermelha, que a transforma em uma pessoa maligna e perigosa. Ao mesmo tempo, Cat aparece no programa The Talk para discutir sobre a Supergirl.",
        "when": "2016-03-14"
    },
    {
        "show_id": 3,
        "name": "O Caçador",
        "season": 1,
        "episode": 17,
        "description": "J'onn J'onzz revela os detalhes do encontro com o pai de Kara e Alex, Dr. Jeremiah Danvers (Dean Cain) e de assumir a identidade de Hank Henshaw. Além disso, Kara questiona se pode confiar sua identidade secreta com outra pessoa, enquanto Siobhan conspira contra Kara.",
        "when": "2016-03-21"
    },
    {
        "show_id": 3,
        "name": "Os Melhores dos Mundos",
        "season": 1,
        "episode": 18,
        "description": "Kara ganha um novo aliado quando o super-herói The Flash surge de repente de um universo alternativo e ajuda Kara a enfrentar Siobhan, também conhecido como Banshee Prateada, e Livewire em troca de ajuda para encontrar uma maneira de voltar para casa.",
        "when": "2016-03-28"
    },
    {
        "show_id": 3,
        "name": "Myriad",
        "season": 1,
        "episode": 19,
        "description": "Kara deve encontrar uma maneira de libertar seus amigos quando Non e Indigo usam controle mental para transformar os cidadãos de National City em seu próprio exército.",
        "when": "2016-04-11"
    },
    {
        "show_id": 3,
        "name": "Melhores Anjos",
        "season": 1,
        "episode": 20,
        "description": "Supergirl é forçada a entrar em batalha contra um inimigo inesperado e deve arriscar tudo – inclusive a sua própria vida - para evitar que Non e Indigo destruam todas as pessoas do planeta.",
        "when": "2016-04-18"
    },
    {
        "show_id": 3,
        "name": "As Aventuras de Supergirl",
        "season": 2,
        "episode": 1,
        "description": "Um foguete espacial sofre uma pane e o primo de Kara, Clark Kent, ajuda a salvar a nave e investigar o acidente.",
        "when": "2016-10-10"
    },
    {
        "show_id": 3,
        "name": "Os Últimos Filhos de Krypton",
        "season": 2,
        "episode": 2,
        "description": "Supergirl é ferida por um vilão que usa armas com kryptonita para atacar National City e Superman culpa Hank e o DOE.",
        "when": "2016-10-17"
    },
    {
        "show_id": 3,
        "name": "Bem-Vindos à Terra",
        "season": 2,
        "episode": 3,
        "description": "Kara e o DOE temem que o prisioneiro que fugiu seja culpado pelos ataques à presidente Marsdin, que visita National City para assinar uma lei de anistia aos alienígenas.",
        "when": "2016-10-24"
    },
    {
        "show_id": 3,
        "name": "Sobreviventes",
        "season": 2,
        "episode": 4,
        "description": "O cadáver de um alienígena não registrado leva Kara até um clube de luta ilegal, onde os alienígenas lutam até a morte sob a supervisão de Roleta.",
        "when": "2016-10-31"
    },
    {
        "show_id": 3,
        "name": "Fogo Cruzado",
        "season": 2,
        "episode": 5,
        "description": "Quando uma gangue de ladrões impiedosos ataca Supergirl usando tecnologia alienígena, ela descobre que Cadmus é quem está fornecendo as armas.",
        "when": "2016-11-07"
    },
    {
        "show_id": 3,
        "name": "Mudanças",
        "season": 2,
        "episode": 6,
        "description": "Quando J'onn e Kara são atacados por um cientista infectado com um parasita drenador de energia que mina seus poderes, o Guardião aparece para ajudá-los.",
        "when": "2016-11-14"
    },
    {
        "show_id": 3,
        "name": "O Lugar Mais Sombrio",
        "season": 2,
        "episode": 7,
        "description": "Durante uma missão para salvar Mon-El de Cadmus, Kara encontra o verdadeiro Hank, que agora é o Superman Ciborgue. O Guardião é falsamente acusado de assassinato.",
        "when": "2016-11-21"
    },
    {
        "show_id": 3,
        "name": "Medusa",
        "season": 2,
        "episode": 8,
        "description": "Kara tenta conseguir a ajuda de Lena Luthor para impedir que o Superman Ciborgue espalhe um vírus kryptoniano criado por seu pai, Zor-El.",
        "when": "2016-11-28"
    },
    {
        "show_id": 3,
        "name": "Supergirl Está Viva",
        "season": 2,
        "episode": 9,
        "description": "Enquanto investigam um desaparecimento, Kara e Mon-El vão parar no planeta escravagista Maaldoria, que está na órbita de um sol vermelho que os priva de seus poderes.",
        "when": "2017-01-23"
    },
    {
        "show_id": 3,
        "name": "Nós Podemos Ser Heróis",
        "season": 2,
        "episode": 10,
        "description": "Depois de combater Curto-Circuito, Kara fica irritada com Mon-El por ignorar sua ordem de proteger os civis e com James, por revelar sua própria identidade secreta.",
        "when": "2017-01-30"
    },
    {
        "show_id": 3,
        "name": "As Crônicas Marcianas",
        "season": 2,
        "episode": 11,
        "description": "J'onn leva M'gann para o DOE para protegê-la de Armek, seu ex-amante, que chega à Terra para levá-la de volta a Marte para ser executada por traição.",
        "when": "2017-02-06"
    },
    {
        "show_id": 3,
        "name": "Luthors",
        "season": 2,
        "episode": 12,
        "description": "Recusando-se a acreditar que sua amiga seja culpada, Kara tenta limpar o nome de Lena quando ela é acusada de ajudar Metallo e Lillian a escaparem da prisão.",
        "when": "2017-02-13"
    },
    {
        "show_id": 3,
        "name": "Sr. e Sra. Mxyzptlk",
        "season": 2,
        "episode": 13,
        "description": "Quando um trapaceiro chamado Mxyzptlk pede Kara em casamento, ela e Mon-El terão que dar um jeito de impedir a ameaça da Quinta Dimensão.",
        "when": "2017-02-20"
    },
    {
        "show_id": 3,
        "name": "Voltando Para Casa",
        "season": 2,
        "episode": 14,
        "description": "Os Danvers ficam entusiasmados quando J'onn e Kara salvam Jeremiah de um comboio do Cadmus, mas Mon-El fica desconfiado desse retorno repentino.",
        "when": "2017-02-27"
    },
    {
        "show_id": 3,
        "name": "Êxodo",
        "season": 2,
        "episode": 15,
        "description": "Kara pressiona Snapper a escrever um artigo sobre os alienígenas que Cadmus sequestra para recolocar em outro planeta. Alex e Maggie procuram Jeremiah.",
        "when": "2017-03-06"
    },
    {
        "show_id": 3,
        "name": "Os Destinos se Encontram",
        "season": 2,
        "episode": 16,
        "description": "Os daxamitas exigem o regresso de Mon-El ao seu planeta original e Kara descobre que ele é um príncipe do qual se espera que ajude a reconstruir sua sociedade natal.",
        "when": "2017-03-20"
    },
    {
        "show_id": 3,
        "name": "Sol Distante",
        "season": 2,
        "episode": 17,
        "description": "Kara sofre uma série de ataques de caçadores de recompensas, e Mon-El suspeita que seus pais estejam por trás dessa história como forma de fazê-lo voltar para Daxam.",
        "when": "2017-03-27"
    },
    {
        "show_id": 3,
        "name": "Uma Excelente Repórter",
        "season": 2,
        "episode": 18,
        "description": "Jack, o ex-namorado de Lena, anuncia uma tecnologia de nanorrobôs inovadora. Mas logo Lena, Kara e Mon-El descobrem que ele está sendo controlado por sua própria criação.",
        "when": "2017-04-24"
    },
    {
        "show_id": 3,
        "name": "Alex",
        "season": 2,
        "episode": 19,
        "description": "Um amigo de infância das Danvers que conhece o segredo de Kara sequestra Alex e exige que seu pai, um criminoso notório, seja solto da prisão.",
        "when": "2017-05-01"
    },
    {
        "show_id": 3,
        "name": "Cidade das Crianças Perdidas",
        "season": 2,
        "episode": 20,
        "description": "Quando um alienígena de uma raça normalmente pacífica ataca National City, Kara, Mon-El e James descobrem um transportador criado por Lena e pela alienígena Rhea.",
        "when": "2017-05-08"
    },
    {
        "show_id": 3,
        "name": "Resista",
        "season": 2,
        "episode": 21,
        "description": "Os daxamitas invadem National City, mas Kara, Mon-El e seus amigos conseguem virar a mesa contra Rhea, que acaba revelando uma arma secreta surpreendente.",
        "when": "2017-05-15"
    },
    {
        "show_id": 3,
        "name": "Ainda Assim, Ela Insistiu",
        "season": 2,
        "episode": 22,
        "description": "Com Kal de volta ao normal, Kara luta contra Rhea num antigo ritual de combate, enquanto Lena tenta arranjar um jeito de expulsar a frota inimiga.",
        "when": "2017-05-22"
    },
    {
        "show_id": 3,
        "name": "Garota de Aço",
        "season": 3,
        "episode": 1,
        "description": "Kara lida com a perda de Mon-El, concentrando toda sua energia em ser a Supergirl e enfrentando a misteriosa nova ameaça contra National City. Alex confessa um segredo para Maggie sobre o casamento. Um cidadão de National City tem uma conexão misteriosa com Kara, e Lena faz uma ação ousada.",
        "when": "2017-10-09"
    },
    {
        "show_id": 3,
        "name": "Gatilhos",
        "season": 3,
        "episode": 2,
        "description": "Psi, uma ladra com poderes psíquicos, ataca National City. Capaz de imobilizar as pessoas usando seus piores medos, Psi prova ser uma grande oponente para Supergirl. Enquanto isso, James e Lena estão em um impasse, e Samantha começa seu novo emprego na L-Corp.",
        "when": "2017-10-16"
    },
    {
        "show_id": 3,
        "name": "Distante do Ninho",
        "season": 3,
        "episode": 3,
        "description": "Eliza oferece a Alex e Maggie um chá, em preparação para o casamento, o que faz Maggie entrar em contato com seu pai distante. Enquanto isso, Supergirl junta-se a J'onn em uma missão pessoal.",
        "when": "2017-10-23"
    },
    {
        "show_id": 3,
        "name": "Os Fiéis",
        "season": 3,
        "episode": 4,
        "description": "Kara investiga um novo grupo secreto cujo líder, Thomas Coville, tem uma conexão misteriosa com Supergirl. Enquanto isso, Samantha sente que está desapontando Ruby, e J'onn confessa um antigo segredo.",
        "when": "2017-10-30"
    },
    {
        "show_id": 3,
        "name": "Dano",
        "season": 3,
        "episode": 5,
        "description": "Quando várias crianças ficam doentes com intoxicação por chumbo, Morgan Edge responsabiliza Lena pela culpa na criação da bomba que ela fez para salvar National City dos Daxamites. Apesar de saber que não planejava qualquer dano, Lena teme que tenha ocorrido uma falha no seu projeto. Kara se junta com Samantha para limpar o nome de Lena, mas isso se mostra mais difícil do que pensavam. Enquanto isso, Alex e Maggie tomam uma decisão crucial sobre o futuro de seu relacionamento.",
        "when": "2017-11-06"
    },
    {
        "show_id": 3,
        "name": "Midvale",
        "season": 3,
        "episode": 6,
        "description": "Kara e Alex vão para Midvale para terem um pouco de descanso. Lá, Kara relembra uma memória dolorosa da morte de um amigo de infância e como essa experiência traumática aproximou as irmãs Danver.",
        "when": "2017-11-13"
    },
    {
        "show_id": 3,
        "name": "Acorde",
        "season": 3,
        "episode": 7,
        "description": "Quando Winn e a equipe descobrem que uma nave alienígena atingiu o fundo subaquático debaixo de National City, Kara / Supergirl é convocada para investigar. Enquanto isso, Hank tenta se relacionar com seu pai, Myrnn. Samantha, buscando alguma compreensão sobre as mudanças que experimentou, procura sua distante mãe, Patricia Arias, para obter respostas.",
        "when": "2017-11-20"
    },
    {
        "show_id": 3,
        "name": "Crise na Terra-X - Parte 1",
        "season": 3,
        "episode": 8,
        "description": "O casamento de Barry e Iris reúne a turma, mas problemas surgem quando vilões da Terra-X atacam a cerimônia. Os super-heróis contam com a ajuda de seus super amigos como Cidadão Frio, The Ray, Felicity Smoak, Iris West e Alex Danvers para enfrentar os perigosos vilões. Os heróis mais poderosos da Terra – Arqueiro Verde, Supergirl, The Flash e Canário Branco – lideram suas equipes na batalha para salvar o mundo.",
        "when": "2017-11-27"
    },
    {
        "show_id": 3,
        "name": "Régia",
        "season": 3,
        "episode": 9,
        "description": "Supergirl investiga um símbolo misterioso que está aparecendo em toda National City, rastreando sua origem a uma antiga profecia e à marca da destruidora de mundo, Régia. Enquanto isso, a tensão entre Lena e Morgan Edge aumenta, fazendo James interceder e oferecer proteção e, possivelmente, criando uma faísca no processo.",
        "when": "2017-12-04"
    },
    {
        "show_id": 3,
        "name": "Legião dos Super-Heróis",
        "season": 3,
        "episode": 10,
        "description": "Lutando para curar dos ferimentos provocados por Régia, Supergirl permanece em um estado inconsciente, incapaz de ser alcançada. Mon-El recruta um dos membros da Legião, Brainiac-5, para tentar trazê-la de volta. Enquanto isso, Régia continua sua fúria sob a cidade levando a DEO se associar à Legião dos Super-heróis para tentar detê-la.",
        "when": "2018-01-15"
    },
    {
        "show_id": 3,
        "name": "Forte Rozz",
        "season": 3,
        "episode": 11,
        "description": "Enquanto Reina continua a aterrorizar a cidade, Supergirl se une com a Satúrnia, e as duas recrutam as antigas inimigas da Supergirl, Curto-Circuito e Psi, para formar uma equipe e ir em uma missão a Fort Rozz para recuperar um prisioneiro que tem informações sobre como derrotar Reina de uma vez por todas. Enquanto isso, Alex cuida de Ruby.",
        "when": "2018-01-22"
    },
    {
        "show_id": 3,
        "name": "De Uma Vez Por Todas",
        "season": 3,
        "episode": 12,
        "description": "Alguém tenta matar Morgan Edge e ele mal sobrevive. Ele acusa Lena de estar atrás da tentativa e promete destruí-la. Quando Lena teme que seu ódio por Morgan a levará para o lado sombrio da família Luthor, Kara aparece para ajudar sua amiga. Enquanto isso, depois de perceber que está perdendo tempo, Sam confia em Alex, que decide realizar testes médicos para ver se consegue descobrir o que está acontecendo com sua nova amiga.",
        "when": "2018-01-29"
    },
    {
        "show_id": 3,
        "name": "Ambos os Lados Agora",
        "season": 3,
        "episode": 13,
        "description": "O DEO captura uma segunda Destruidora de Mundos, a Pureza. Supergirl e Alex usam métodos de interrogação muito diferentes com Pureza na esperança de descobrir como derrotar Régia. No entanto, Pureza escapa e ataca os túneis do metrô da cidade. Enquanto isso, J'onn, Winn e Mon-El se unem para consertar a nave Legion.",
        "when": "2018-02-05"
    },
    {
        "show_id": 3,
        "name": "Tiro no Coração do Schott",
        "season": 3,
        "episode": 14,
        "description": "Quando o pai de Winn morre, sua mãe distante reaparece tentando se reconectar com ele e explicar porque ela o abandonou tantos anos atrás. Winn está muito amargurado por sua infância dura para perdoá-la, mas quando um imitador do Toyman ataca, os dois devem trabalhar juntos para impedi-lo. Mon-El conta a Kara algo importante sobre os Worldkillers e Alex suspeita do comportamento de Myr’nn.",
        "when": "2018-04-16"
    },
    {
        "show_id": 3,
        "name": "Em Busca do Tempo Perdido",
        "season": 3,
        "episode": 15,
        "description": "Quando Myrnn inadvertidamente causa distúrbios psíquicos no DEO, a Supergirl deve trabalhar com J'onn para conter o caos resultante. Enquanto isso, Mon-El começa a treinar Kara em técnicas de luta que ele aprendeu no futuro para lutar contra Worldkillers.",
        "when": "2018-04-23"
    },
    {
        "show_id": 3,
        "name": "De Duas Mentes",
        "season": 3,
        "episode": 16,
        "description": "Supergirl e Imra têm ideias diferentes sobre como parar a terceira Destruidora de Mundos, Pestilence. No entanto, quando Alex e Winn são gravemente feridos por Pestilence, Supergirl e Imra se unem para impedir a destruição.",
        "when": "2018-04-30"
    },
    {
        "show_id": 3,
        "name": "Trindade",
        "season": 3,
        "episode": 17,
        "description": "Ainda se recuperando depois de descobrir sobre o segredo de Lena, Supergirl pede ao Guardião um favor que pode alterar seu relacionamento com Lena para sempre.",
        "when": "2018-05-07"
    },
    {
        "show_id": 3,
        "name": "Abrigo Para a Tempestade",
        "season": 3,
        "episode": 18,
        "description": "Quando Reign começa a caçar Ruby, Supergirl e Alex trabalham juntas para mantê-la segura. Supergirl e Jonn procuram a mãe de Sam em busca de conselhos sobre como parar Reign e recebem notícias chocantes.",
        "when": "2018-05-14"
    },
    {
        "show_id": 3,
        "name": "O Fanático",
        "season": 3,
        "episode": 19,
        "description": "Quando Tanya, uma discípula de Coville, escapa do que restou de seu culto, ela dá a Kara e James um diário que pode conter a chave para salvar Sam.",
        "when": "2018-05-21"
    },
    {
        "show_id": 3,
        "name": "Lado Escuro da Lua",
        "season": 3,
        "episode": 20,
        "description": "Supergirl fica chocada ao descobrir que uma parte dos habitantes de Krypton sobreviveu.",
        "when": "2018-05-28"
    },
    {
        "show_id": 3,
        "name": "Não é o Kansas",
        "season": 3,
        "episode": 21,
        "description": "Kara toma uma grande decisão de vida. Enquanto isso, J'onn descobre que armas especiais da DEO chegaram às ruas de National City.",
        "when": "2018-06-04"
    },
    {
        "show_id": 3,
        "name": "Faça Reinar",
        "season": 3,
        "episode": 22,
        "description": "Supergirl descobre a profundidade dos planos nefastos de Serena para a Terra. Supergirl, Mon-El e Alura devem elaborar um plano para impedi-la antes que Serena chegue à Terra. J’onn se prepara para se despedir de seu pai.",
        "when": "2018-06-11"
    },
    {
        "show_id": 3,
        "name": "Batalhas Perdidas e Vencidas",
        "season": 3,
        "episode": 23,
        "description": "Supergirl e sua equipe enfrentam Serena em uma batalha épica pela Terra.",
        "when": "2018-06-18"
    },
    {
        "show_id": 3,
        "name": "A Alienígena Americana",
        "season": 4,
        "episode": 1,
        "description": "Voltando às reportagens, Kara dá as boas-vindas a um novo repórter da CatCo. Enquanto isso, James e Lena discutem sobre a acusação iminente de James por atuar como o vigilante Guardião, enquanto Alex e Brainy lutam para entrar em sincronia com o DEO. A supergirl é convocada quando remanescentes da organização terrorista anti-alienígena Cadmus tentam assassinar líderes pró-alienígenas, mas seu fim de jogo acaba sendo muito mais sinistro do que ela esperava. J'onn aprecia sua nova vida pacífica, mas um passeio com um velho amigo lhe causa preocupação.",
        "when": "2018-10-14"
    },
    {
        "show_id": 3,
        "name": "Recaída",
        "season": 4,
        "episode": 2,
        "description": "A Supergirl sai para capturar Mercy Graves, enquanto Alex assume o controle no DEO. De volta à CatCo, Kara decide escrever uma história investigativa sobre Mercy e pergunta a Lena se ela pode entrevistá-la já que Mercy tem laços com os Luthors. Enquanto isso, Brainy conhece Nia e os dois acabam em uma situação precária.",
        "when": "2018-10-21"
    },
    {
        "show_id": 3,
        "name": "Homem de Aço",
        "season": 4,
        "episode": 3,
        "description": "Ben Lockwood nem sempre odiou alienígenas. Através de uma série de incidentes, e a entrada de seu pai anti-alienígena, Ben lentamente se transforma de um professor de maneiras gentis para o vilão Agente Liberty de hoje.",
        "when": "2018-10-28"
    },
    {
        "show_id": 3,
        "name": "Ahimsa",
        "season": 4,
        "episode": 4,
        "description": "Quando Supergirl precisa de ajuda, Alex pede para Lena e Brainiac se unirem. Enquanto isso, J'onn questiona sua decisão de sair do DEO. No entanto, depois de se encontrar com Manchester Black, ele percebe que há muitas maneiras de ajudar seus companheiros alienígenas durante este tempo tumultuado.",
        "when": "2018-11-04"
    },
    {
        "show_id": 3,
        "name": "Parasita Perdido",
        "season": 4,
        "episode": 5,
        "description": "Coronel Haley toma uma decisão surpreendente sobre Supergirl. Kara escreve uma série de artigos destacando alienígenas em National City, na esperança de que os humanos parem de ter tanto medo deles. Infelizmente, o artigo coloca alguns alienígenas em perigo.",
        "when": "2018-11-11"
    },
    {
        "show_id": 3,
        "name": "Apelo à Ação",
        "season": 4,
        "episode": 6,
        "description": "Todos se reúnem para o Dia de Ação de Graças, mas Kara está se sentindo para baixo após o seu debate televisionado com Ben Lockwood sobre o sentimento contra alienígenas que domina National City. Enquanto isso, James e Lena discutem sobre a melhor maneira de lidar com os Filhos da Liberdade.",
        "when": "2018-11-18"
    },
    {
        "show_id": 3,
        "name": "Ao Invés do Anjo Caído",
        "season": 4,
        "episode": 7,
        "description": "James está cada vez mais envolvido com os Filhos da Liberdade em seus esforços para encontrar o Agente Liberdade. Enquanto isso, Supergirl e Manchester Black seguem uma pista da localização do Agente Liberdade, mas as coisas tomam um rumo sombrio. Lena inicia seus primeiros testes.",
        "when": "2018-11-25"
    },
    {
        "show_id": 3,
        "name": "Bunker Hill",
        "season": 4,
        "episode": 8,
        "description": "Nia tem um sonho poderoso sobre o Agente Liberdade, mas se recusa a vê-lo como um sonho profético e o deixa de lado. Depois de perceber que algo está incomodando Nia, Kara pede a ajuda de Brainy, e os dois tentam persuadir Nia a abraçar seu destino. Enquanto isso, Manchester Black faz uma visita ameaçadora a Ben Lockwood.",
        "when": "2018-12-02"
    },
    {
        "show_id": 3,
        "name": "Outros Mundos - Parte 3",
        "season": 4,
        "episode": 9,
        "description": "Supergirl, Flash, Arqueiro Verde e Superman se envolvem na batalha de suas vidas.",
        "when": "2018-12-11"
    },
    {
        "show_id": 3,
        "name": "Mentes Desconfiadas",
        "season": 4,
        "episode": 10,
        "description": "Coronel Haley fica irritada depois que a Supergirl responde a um chamada de socorro de um navio da Marinha que acabou sendo um ataque alienígena mortal. A Coronel Haley clama o local como território do DEO e exige que a Supergirl saia de cena. Depois que Supergirl se recusa a ser ordenada sobre o que fazer, Haley redireciona sua energia para descobrir a verdadeira identidade da heroína e começa a interrogar todos os agentes da DEO, incluindo Alex. Enquanto isso, Brainiac-5 tenta persuadir Nia a abraçar seus superpoderes, mas ela interpreta mal seus motivos.",
        "when": "2019-01-20"
    },
    {
        "show_id": 3,
        "name": "Memória Familiar",
        "season": 4,
        "episode": 11,
        "description": "Kara se junta a Nia em uma viagem à cidade natal da jovem para visitar sua família durante o Festival da Colheita anual da cidade. Enquanto em casa, a mãe de Nia encoraja a filha a abraçar seu destino. Enquanto isso, Alex lida com uma droga nas ruas que está tornando as pessoas violentas e lhes dando superpoderes temporários.",
        "when": "2019-01-27"
    },
    {
        "show_id": 3,
        "name": "Menagerie",
        "season": 4,
        "episode": 12,
        "description": "Com a sua placa de investigador particular recentemente pendurada em seu escritório, J'onn recebe novos clientes. Tentando esquecer o que aconteceu no DEO, Kara decide juntar-se a J'onn em sua nova missão, que infelizmente acaba se ligando diretamente à investigação atual de Alex que envolve a vilã Menagerie. Enquanto isso, Lena compartilha algumas novidades com James, mas sua reação não é o que ela esperava. Nia convida Brainy para a festa do Dia dos Namorados.",
        "when": "2019-02-17"
    },
    {
        "show_id": 3,
        "name": "O Que é Tão Engraçado na Verdade, na Justiça, e no Jeito Americano?",
        "season": 4,
        "episode": 13,
        "description": "Manchester Black sai da prisão com a ajuda de sua nova equipe, The Elite, que está decidida a punir as forças anti-alienígenas. Supergirl acumula deveres ao tentar prender Manchester Black e sua equipe, além de lidar com um novo desenvolvimento chocante com Ben Lockwood.",
        "when": "2019-03-03"
    },
    {
        "show_id": 3,
        "name": "Levante-se e Entregue",
        "season": 4,
        "episode": 14,
        "description": "Entre o novo empurrão de Ben Lockwood para agitar o movimento anti-alien e o desejo da Elite de atacar Lockwood e seus minions, a Supergirl fica preocupada com a segurança do povo americano - tanto humano quanto alienígena. Quando Lockwood organiza uma manifestação, os alienígenas decidem protestar pacificamente. Brainiac e Jonn se juntam à marcha alienígena enquanto Supergirl e Dreamer patrulham para manter todos em segurança. Enquanto isso, James pega sua câmera novamente para cobrir a marcha para a CatCo, e Hayley dá à Alex um trabalho que entra em conflito com suas crenças. Quando a Elite e Ben Lockwood criam problemas no comício, a Supergirl é forçada a tomar uma posição.",
        "when": "2019-03-10"
    },
    {
        "show_id": 3,
        "name": "Irmão, Onde Estás?",
        "season": 4,
        "episode": 15,
        "description": "Secretamente licenciado da prisão devido à falta de saúde, Lex Luthor (ator convidado Jon Cryer) visita sua irmã, Lena, para pedir ajuda em encontrar uma cura. Mais esperta do que nunca, Lena desconfia dos motivos de Lex, mas quando se depara com uma situação de vida ou morte, ela precisa decidir o que realmente sente por seu irmão. Enquanto isso, Supergirl e J'onn enfrentam Manchester Black. A irmã de James, Kelly, chega à cidade.",
        "when": "2019-03-17"
    },
    {
        "show_id": 3,
        "name": "A Casa de L",
        "season": 4,
        "episode": 16,
        "description": "Na esteira do retorno de Lex Luthor, a série mostra o que ele vem fazendo nos últimos dois anos e como suas maquinações e planos secretos afetaram Supergirl e Lena.",
        "when": "2019-03-24"
    },
    {
        "show_id": 3,
        "name": "Tudo Sobre Eve",
        "season": 4,
        "episode": 17,
        "description": "A Supergirl deve lidar com o resultado destrutivo dos planos nefastos de Lex. Chocada com o que Lex criou, Supergirl enfrenta seu maior desafio até agora.",
        "when": "2019-03-31"
    },
    {
        "show_id": 3,
        "name": "Crime e Punição",
        "season": 4,
        "episode": 18,
        "description": "Supergirl e Lena vão à Ilha Stryker para procurar pistas sobre como derrotar Lex. Na prisão, Supergirl tenta fazer amizade com um prisioneiro intrometido, Steve, que pode ter uma ideia do que Lex estava fazendo, mas ele e todos os prisioneiros a consideram uma traidora do país e se recusam a falar com ela. Lena percebe que Lex deixou pistas para trás e decifrá-las pode ser a chave para o seu paradeiro. Kelly encoraja James a falar com alguém sobre seu PTSD, e Alex enfrenta Ben Lockwood depois que ele ataca o DEO e adquire algumas armas poderosas para caçar a Supergirl.",
        "when": "2019-04-21"
    },
    {
        "show_id": 3,
        "name": "Sonhadora Americana",
        "season": 4,
        "episode": 19,
        "description": "Enquanto Kara trabalha obstinadamente como repórter para limpar o nome da Supergirl, Dreamer toma o posto de protetora de National City, o que leva a um confronto com Ben Lockwood. James toma medidas drásticas para aliviar seu estresse pós-traumático.",
        "when": "2019-04-28"
    },
    {
        "show_id": 3,
        "name": "Senhorita Tessmarcher, Pode Se Levantar?",
        "season": 4,
        "episode": 20,
        "description": "Kara e Lena vão para Kaznia para caçar Lex. No entanto, Eve Tessmacher prepara uma armadilha para a dupla que pode revelar que Kara é a Supergirl. Enquanto isso, Alex recebe um telefonema muito esperado, James pratica o uso de seus poderes, e Ben Lockwood toma uma posição perigosa dentro do DEO.",
        "when": "2019-05-05"
    },
    {
        "show_id": 3,
        "name": "O Alvorecer Vermelho",
        "season": 4,
        "episode": 21,
        "description": "Kara fica cara a cara com a Filha Vermelha e as duas se envolvem em uma batalha épica. Determinada a encontrar uma maneira de extrair Harun-El, Lena procura ajuda de uma fonte improvável - Lillian Luthor. Enquanto isso, Alex percebe que ela está perdendo partes de sua memória, e Brainy, Nia e Jonn saem em busca de alienígenas que foram sequestrados por Lex.",
        "when": "2019-05-12"
    },
    {
        "show_id": 3,
        "name": "A Busca Pela Paz",
        "season": 4,
        "episode": 22,
        "description": "Lex Luthor aterrissa em Washington e convoca Lena e Lillian Luthor para a Casa Branca. Supergirl percebe que tem uma última chance para capturar Lex e conta com o poder da imprensa para ajudá-la.",
        "when": "2019-05-19"
    },
    {
        "show_id": 3,
        "name": "Horizonte de Eventos",
        "season": 5,
        "episode": 1,
        "description": "Incomodada com as mentiras de Kara, Lena pensa em se vingar. A CatCo passa por uma mudança importante. Uma luta com um inimigo misterioso destrói a capa da Supergirl.",
        "when": "2019-10-06"
    },
    {
        "show_id": 3,
        "name": "Um Estranho Ao Meu Lado",
        "season": 5,
        "episode": 2,
        "description": "J'onn tem um encontro surpreendente e sai em busca de respostas. Lena explora os limites da nova tecnologia da Obsidian. Um jornalista ousado rouba uma matéria de Kara.",
        "when": "2019-10-13"
    },
    {
        "show_id": 3,
        "name": "Linhas Turvas",
        "season": 5,
        "episode": 3,
        "description": "Em meio a uma investigação de assassinato, Kara tenta fazer as pazes com Lena. J'onn relembra um trágico episódio do passado. A compaixão de Kelly a coloca em perigo.",
        "when": "2019-10-20"
    },
    {
        "show_id": 3,
        "name": "Bem à Vista",
        "season": 5,
        "episode": 4,
        "description": "Kara investiga as atividades suspeitas de William. James e Kelly retornam à cidade natal deles.",
        "when": "2019-10-27"
    },
    {
        "show_id": 3,
        "name": "Ligações Perigosas",
        "season": 5,
        "episode": 5,
        "description": "Às vésperas de um lançamento importante, Kara ajuda William a investigar um supervilão ligado ao passado dele. Lena aceita um acordo perigoso.",
        "when": "2019-11-03"
    },
    {
        "show_id": 3,
        "name": "Velhas Amigas",
        "season": 5,
        "episode": 6,
        "description": "A detenção do supervilão no DEO desencadeia uma série de eventos que remontam à época em que Lena e Andrea se conhecem.",
        "when": "2019-11-10"
    },
    {
        "show_id": 3,
        "name": "Tremores",
        "season": 5,
        "episode": 7,
        "description": "Quando uma energia antiga ataca Lena, Supergirl finalmente descobre a verdade nua e crua sobre a amizade entre as duas. J'onn toma uma decisão sobre o Maléfico.",
        "when": "2019-11-17"
    },
    {
        "show_id": 3,
        "name": "A Ira de Rama Khan",
        "season": 5,
        "episode": 8,
        "description": "Supergirl tem que escolher entre a razão e a emoção ao lidar com Lena. Graças a Rama Khan, um vulcão adormecido ameaça entrar em erupção",
        "when": "2019-12-01"
    },
    {
        "show_id": 3,
        "name": "Crise Nas Infinitas Terras - Parte 1",
        "season": 5,
        "episode": 9,
        "description": "Diante da tragédia iminente e enfrentando uma perda devastadora, Supergirl se junta aos amigos super-heróis para tentar salvar o planeta.",
        "when": "2019-12-08"
    },
    {
        "show_id": 3,
        "name": "O Episódio da Garrafa",
        "season": 5,
        "episode": 10,
        "description": "Kara tem dificuldade de aceitar mudanças na nova realidade da Terra após a Crise, e Brainy constata que precisa aproveitar todo o seu potencial.",
        "when": "2020-01-19"
    },
    {
        "show_id": 3,
        "name": "De Volta do Futuro – Parte 1",
        "season": 5,
        "episode": 11,
        "description": "Um velho amigo retorna para acabar com seu sósia perverso. Brainy questiona o caminho que vem seguindo. Kara tenta proteger Will da ira de Lex Luthor.",
        "when": "2020-01-26"
    },
    {
        "show_id": 3,
        "name": "De Volta do Futuro – Parte 2",
        "season": 5,
        "episode": 12,
        "description": "Supergirl se junta a Winn em uma missão de alta tecnologia no DEO. A jogada de Brainy em relação a Lex arrisca sua lealdade aos amigos.",
        "when": "2020-02-16"
    },
    {
        "show_id": 3,
        "name": "É Uma Super Vida",
        "season": 5,
        "episode": 13,
        "description": "Mxyzptlk reaparece oferecendo a Kara a chance de voltar no tempo, mudar a história e salvar sua amizade com Lena.",
        "when": "2020-02-23"
    },
    {
        "show_id": 3,
        "name": "O Guarda-Costas",
        "season": 5,
        "episode": 14,
        "description": "Andrea é atacada pouco antes do lançamento da RV da Obsidian e Lex a coloca sob proteção da Supergirl. Lena encontra candidatos ao teste do programa Non Nocere.",
        "when": "2020-03-08"
    },
    {
        "show_id": 3,
        "name": "Realidade em Bytes",
        "season": 5,
        "episode": 15,
        "description": "Quando uma amiga sofre um ataque transfóbico, Sonhadora promete fazer justiça. Em busca de uma pessoa desaparecida, Alex entra no mundo virtual.",
        "when": "2020-03-15"
    },
    {
        "show_id": 3,
        "name": "Alex no País das Maravilhas",
        "season": 5,
        "episode": 16,
        "description": "No mundo virtual da Obsidian, as fronteiras da realidade começam a ficar confusas quando Alex assume uma poderosa identidade nova. Kara enfrenta uma perda devastadora.",
        "when": "2020-03-22"
    },
    {
        "show_id": 3,
        "name": "Lex Avança",
        "season": 5,
        "episode": 17,
        "description": "O plano de Lex Luthor finalmente dá frutos. Seus esquemas para afastar os inimigos e garantir seu poder vêm à tona.",
        "when": "2020-05-03"
    },
    {
        "show_id": 3,
        "name": "O Elo Perdido",
        "season": 5,
        "episode": 18,
        "description": "Supergirl e seus amigos enfrentam uma força poderosa. Lena se reúne com Lex depois que um defeito no Non Nocere os coloca em risco.",
        "when": "2020-05-10"
    },
    {
        "show_id": 3,
        "name": "Combate Imortal",
        "season": 5,
        "episode": 19,
        "description": "Quando o plano sinistro de Lex com o Leviatã se aproxima do desfecho, Kara recorre a amigos — do presente e do passado — para ajudá-la a salvar o mundo.",
        "when": "2020-05-17"
    },
    {
        "show_id": 3,
        "name": "Renascimento",
        "season": 6,
        "episode": 1,
        "description": "Enquanto Braniac está perto da morte depois de tentar parar Lex, Supergirl e a equipe chegam para salvá-lo, engajando-se em uma batalha épica com Gamenmae. Depois de derrotar Leviathan, Supergirl volta sua atenção para Lex, que usou a plataforma Obsidian para fazer lavagem cerebral em meio mundo para amá-lo e segui-lo a todo custo, não importa as coisas horríveis que ele faça. Sabendo o quão perigoso isso torna seu irmão, Lena convoca toda a equipe - Alex, J'onn, Dreamer, Kelly e Braniac - para ajudar, mas Supergirl percebe que a única maneira de realmente parar Lex é se sacrificar.",
        "when": "2021-03-30"
    },
    {
        "show_id": 3,
        "name": "Algumas Mulheres Boas",
        "season": 6,
        "episode": 2,
        "description": "Como as apostas com Lex estão mais altas do que nunca, Lena deve decidir o quão longe ela está disposta a ir para impedir seu irmão. Enquanto isso, Supergirl e a equipe enfrentam um desafio diferente de tudo o que já enfrentaram antes e isso leva Alex ao seu ponto de ruptura.",
        "when": "2021-04-06"
    },
    {
        "show_id": 3,
        "name": "Ameaças fantasmas",
        "season": 6,
        "episode": 3,
        "description": "Supergirl é uma nova aliada. Lena e Lex lutam pelo controle da Luthor Corp.",
        "when": "2021-04-13"
    },
    {
        "show_id": 3,
        "name": "Almas perdidas",
        "season": 6,
        "episode": 4,
        "description": "Supergirl encontra uma oportunidade de escapar da Zona Fantasma, mas ela vem com algumas cordas perigosas presas. Enquanto isso, Lena se junta aos Super Amigos em uma missão, mas descobre que ela discorda de seu plano de ação contra os Phantoms e se pergunta se ela está realmente pronta para fazer parte da equipe.",
        "when": "2021-04-20"
    },
    {
        "show_id": 3,
        "name": "Noite de formatura! (Parte 1)",
        "season": 6,
        "episode": 5,
        "description": "Nia e Brainy tentam salvar a Supergirl da Zona Fantasma viajando no tempo de volta para a casa de Kara em 2009. Embora determinada a garantir o item necessário para ajudar a Supergirl, Brainy está preocupada em manter um perfil baixo para não alterar a linha do tempo futura. No entanto, quando sua nave cai na chegada, uma jovem Kara Danvers é a primeira a chegar. Enquanto isso, uma jovem repórter chamada Cat Grant volta seus olhos para Midvale, pois ela suspeita que há uma grande história na pequena cidade.",
        "when": "2021-04-27"
    },
    {
        "show_id": 3,
        "name": "Noite de formatura! (Parte 2)",
        "season": 6,
        "episode": 6,
        "description": "A jovem Kara experimenta a criptonita pela primeira vez, Nia e Brainy são presos por invasores alienígenas, e uma jovem Cat Grant pode ser a razão pela qual Supergirl nunca sai da Zona Fantasma.",
        "when": "2021-05-04"
    },
    {
        "show_id": 3,
        "name": "Nó do Medo",
        "season": 6,
        "episode": 7,
        "description": "Enquanto os Super Amigos enfrentam a Zona Fantasma para trazer a Supergirl para casa, cada membro da equipe é confrontado por visões de seu pior medo.",
        "when": "2021-05-11"
    },
    {
        "show_id": 3,
        "name": "Bem-vinda de volta, Kara!",
        "season": 6,
        "episode": 8,
        "description": "",
        "when": "2021-08-24"
    },
    {
        "show_id": 3,
        "name": "Tecelão de Sonhos",
        "season": 6,
        "episode": 9,
        "description": "",
        "when": "2021-08-31"
    },
    {
        "show_id": 3,
        "name": "Ainda assim eu me levanto",
        "season": 6,
        "episode": 10,
        "description": "",
        "when": "2021-09-07"
    },
    {
        "show_id": 3,
        "name": "Mxy no meio",
        "season": 6,
        "episode": 11,
        "description": "",
        "when": "2021-09-14"
    },
    {
        "show_id": 3,
        "name": "Pontos cegos",
        "season": 6,
        "episode": 12,
        "description": "",
        "when": "2021-09-21"
    },
    {
        "show_id": 4,
        "name": "Piloto: Parte 1",
        "season": 1,
        "episode": 1,
        "description": "No ano de 2166, o imortal vilão Vandal Savage está prestes a conquistar sua vitória final trazer o caos total e a destruição à humanidade. Enquanto o mundo sucumbe, o Mestre do Tempo Rip Hunter tenta resolver as coisas por conta própria.",
        "when": "2016-01-21"
    },
    {
        "show_id": 4,
        "name": "Piloto: Parte 2",
        "season": 1,
        "episode": 2,
        "description": "Após receber uma pista sobre o paradeiro de Vandal Savage, o time se infiltra em um acordo de munições tendo o professor Stein como líder. Cercados pelos criminosos mais durões do mundo, as coisas logo saem do controle, já que Savage percebe que eles não fazem parte dali.",
        "when": "2016-01-28"
    },
    {
        "show_id": 4,
        "name": "Laços de Sangue",
        "season": 1,
        "episode": 3,
        "description": "Rip decide enfraquecer Vandal Savage indo atrás de seus bens financeiros. Rip e Sara se infiltram no banco de Savage, mas são descobertos pelos homens do vilão. Enquanto isso, Snart e Rory convencem Jax a levar a nave de volta a Central City para que eles possam roubar uma valiosa esmeralda. Já Stein guia Ray em uma perigosa missão.",
        "when": "2016-02-04"
    },
    {
        "show_id": 4,
        "name": "Cavaleiros Brancos",
        "season": 1,
        "episode": 4,
        "description": "Vandal Savage recua para a Cortina de Ferro no começo dos anos 80 e, como consequência, uma série de cientistas nucleares começam a desaparecer misteriosamente. O time segue o rastro de Vandal até o coração da União Soviética em uma tentativa de encontrar próximo alvo do vilão. Ray tenta se aproximar de uma linda cientista soviética, Valentina Vostock, na esperança de descobrir o próximo passo do inimigo. Valentina o rejeita, cabendo a Snart partir para a ação. Já Stein pressiona Jax a ser melhor, o que deixa o jovem frustrado e, em última instância, ameaça a matriz Firestorm. Para completar, Rip pede a Sara para treinar Kendra.",
        "when": "2016-02-11"
    },
    {
        "show_id": 4,
        "name": "À Prova de Falhas",
        "season": 1,
        "episode": 5,
        "description": "Após alguns dos membros do time serem capturados e jogados em uma gulag durante o auge da Guerra Fria, em 1986, Snart arquiteta um elaborado plano de fuga para libertar seu camaradas. Ao mesmo tempo, Rip dá a Sara uma missão secreta a realizar durante a ação, algo que pode se tornar não apenas um risco, mas algo fatal para o grupo.",
        "when": "2016-02-18"
    },
    {
        "show_id": 4,
        "name": "Star City 2046",
        "season": 1,
        "episode": 6,
        "description": "Um problema de funcionamento envia a Waverider para o ano de 2046, em Star City, no qual nossos heróis se deparam com uma versão surpreendente do próprio futuro nela, eles nunca pararam Savage ou retornaram para casa. A cidade está em ruínas e tomada pelos criminosos, o que empolga Rory. Já Sara fica desanimada com a destruição de sua casa e se surpreende ainda mais ao descobrir o que aconteceu a seu velho amigo, Oliver Queen.",
        "when": "2016-02-25"
    },
    {
        "show_id": 4,
        "name": "Abandonados",
        "season": 1,
        "episode": 7,
        "description": "Após receber uma chamada de socorro vinda de outra nave temporal presa no espaço, Rip decide responder ao pedido a fim de usar o computador da outra embarcação para procurar Savage. O time suspeita do caso e o alerta de que isso pode ser uma armadilha, mas ele segue em frente com seu plano. Em última instância, descobrimos que o grupo estava certo e que eles devem lutar contra piratas do tempo. Com boa parte do time capturado, cabe ao professor Stein resgatá-los.",
        "when": "2016-03-03"
    },
    {
        "show_id": 4,
        "name": "Noite do Gavião",
        "season": 1,
        "episode": 8,
        "description": "A equipe rastreia Savage até uma pequena cidade no Oregon durante a década de 1950. Ao chegarem, eles descobrem que uma recente série de assassinatos ocorreram, e eles suspeitam que Savage esteja envolvido. Professor Stein e Sara entram disfarçados em um hospital psiquiátrico, onde Savage está trabalhando como um médico, para descobrir o seu plano. Lá, Sara conhece uma enfermeira chamada Lindsay. Enquanto isso, Ray e Kendra fingem ser um casal para ganhar a confiança do bairro, mas um casal inter-racial nos anos 50 não é algo que passa despercebido. E logo, Savage aparece à porta deles.",
        "when": "2016-03-10"
    },
    {
        "show_id": 4,
        "name": "Deixados Para Trás",
        "season": 1,
        "episode": 9,
        "description": "Ray, Sara e Kendra estão chocados depois de ver Tempus (Waverider) ir embora sem eles, deixando-os presos nos anos 50. Depois de esperar meses pelo retorno de seus companheiros de equipe, os três percebem que devem seguir em frente com suas vidas. Ray e Kendra se estabelecem como um casal, mas Sara decide voltar para a Liga dos Assassinos e para Ra’s al Ghul (ator convidado Matt Nable).",
        "when": "2016-03-31"
    },
    {
        "show_id": 4,
        "name": "Descendência",
        "season": 1,
        "episode": 10,
        "description": "Rip diz à equipe que eles estão indo para o futuro para eliminar um poderoso aliado que Savage precisa para conquistar o mundo. No entanto, quando Rip revela que o aliado de Savage é ainda um menino de 14 anos que irá crescer em um ditador do mal, a equipe fica dividida sobre matar uma criança, mesmo que seja para salvar o mundo. Enquanto isso, Sara ajuda Snart a passar por uma fase difícil, e Ray descobre algo que poderia impactar seu futuro com Kendra.",
        "when": "2016-04-07"
    },
    {
        "show_id": 4,
        "name": "Os Oito Magníficos",
        "season": 1,
        "episode": 11,
        "description": "Quando a equipe precisa de um lugar para se esconder, Rip decide ir ao  Velho Oeste. Ao chegar, eles começam uma briga com uma gangue de  bandidos, colocando a pequena cidade em perigo. Felizmente, um velho  amigo de Rip, Jonah Hex (ator convidado Johnathon Schaech), entra em  cena para salvá-los.",
        "when": "2016-04-14"
    },
    {
        "show_id": 4,
        "name": "O Último Refúgio",
        "season": 1,
        "episode": 12,
        "description": "A equipe é alvo de Pilgrim, uma assassina mortal que quer apagar as Lendas da linha do tempo, matando suas versões mais jovens, quando eles ainda não eram super-heróis. Como medida preventiva de proteção, Rip decide que Sara, Snart, Rory, Professor Stein e Jax precisam sequestrar suas versões do passado antes que Pilgrim chegue a eles. Ficar cara-a-cara com as versões mais jovens de si mesmos prova ser um desafio físico e emocional para certos membros da equipe que prefeririam esquecer seu passado. Rip diz que ele tem um refúgio um orfanato que cria futuros Mestres do Tempo e onde ele próprio cresceu.",
        "when": "2016-04-21"
    },
    {
        "show_id": 4,
        "name": "Leviatã",
        "season": 1,
        "episode": 13,
        "description": "Rip leva a equipe para Londres no  ano de 2166, três meses antes de sua família ser morta. Ele acredita que  este seja a última oportunidade de parar Savage, que, infelizmente,  está no auge de seu poder. No entanto, a equipe descobre dois  elementos-chave para derrotá-lo, a filha de Savage e uma maneira de  matar Savage de uma vez por todas.",
        "when": "2016-04-28"
    },
    {
        "show_id": 4,
        "name": "Rio do Tempo",
        "season": 1,
        "episode": 14,
        "description": "Após inúmeras tentativas em várias épocas de tempo diferentes, a equipe  finalmente capturou Vandal Savage. No entanto, Savage conta para Kendra  que ele pode reuni-la com Carter e ela considera se deve ou não matá-lo.  Rip decide que vai entregar Savage aos Mestres do Tempo, que Snart e  Rory não concordam plenamente. A dupla decide que esta pode ser hora de  deixar a equipe e voltar para sua antiga vida. Enquanto isso, Savage  provoca Ray sobre o seu lugar na vida de Kendra.",
        "when": "2016-05-05"
    },
    {
        "show_id": 4,
        "name": "Destino",
        "season": 1,
        "episode": 15,
        "description": "O fato de estarem nas imediações dos Mestres do Tempo deixa Rip e Rory  muito perturbados por razões bem diferentes. Enquanto isso, Sara assume o  comando da Waverider, Kendra se reúne com Carter, e Snart decide que  pode ser um herói.",
        "when": "2016-05-12"
    },
    {
        "show_id": 4,
        "name": "Lendários",
        "season": 1,
        "episode": 16,
        "description": "Após os inúmeros sacrifícios que a equipe tem feito desde o início, Rip  decide que é hora de cada um deles decidir o seu próprio destino e  retornar para Central City poucos meses depois de terem deixado a  cidade. Retornando às suas vidas normais, cada membro da equipe deve  decidir individualmente se eles estão dispostos a sacrificar tudo para  salvar o mundo. Enquanto isso, Sara visita seu pai, que traz algumas  notícias devastadoras sobre sua irmã.",
        "when": "2016-05-19"
    },
    {
        "show_id": 4,
        "name": "Fora do Tempo",
        "season": 2,
        "episode": 1,
        "description": "Após a derrota do imortal Vandal Savage e a exposição dos Mestres dos Tempo, uma nova ameaça surge. O Dr. Nate Heywood, um historiador charmoso e pouco convencional, parte para a ação. Após fazer uma descoberta chocante, Nate vai atrás de Oliver Queen em busca de ajuda para encontrar as Lendas, que estão espalhadas.",
        "when": "2016-10-13"
    },
    {
        "show_id": 4,
        "name": "A Sociedade da Justiça da América",
        "season": 2,
        "episode": 2,
        "description": "As Lendas viajam para a Paris ocupada pelos nazistas, mas logo se veem cercados pela Sociedade da Justiça da América (JSA). O time descobre uma aberração temporal que ameaça a JSA, mas a Sociedade não quer ajuda.",
        "when": "2016-10-20"
    },
    {
        "show_id": 4,
        "name": "Shogun",
        "season": 2,
        "episode": 3,
        "description": "Nate fica chocado ao descobrir que possui poderes, mas acidentalmente vai parar no Japão Feudal junto a Ray. Após Sara convencer Amaya, a Vixen, que Rory não é um assassino, eles concordam em procurar Nate e ajudá-lo a controlar seus poderes a fim de defender uma vila japonesa de Shogun e seu exército de guerreiros samurais. Enquanto isso, Jax e Stein ficam para trás para ajudar a consertar a nave, mas encontram um compartimento secreto e decidem não contar ao resto do time o que aprenderam.",
        "when": "2016-10-27"
    },
    {
        "show_id": 4,
        "name": "Aberrações",
        "season": 2,
        "episode": 4,
        "description": "As Lendas descobrem uma aberração temporal no ano de 1863 e, com isso, se veem lutando pela sobrevivência durante a Guerra Civil contra soldados confederados que foram transformados em zumbis. Com o destino da Guerra pendente na balança, Jax deve participar em uma missão arriscada e segue para uma fazenda com escravos junto a Amaya. Ao mesmo tempo, Sara começa a sentir o peso das decisões que precisa tomar como líder, enquanto Ray sofre para encontrar seu propósito dentro do time.",
        "when": "2016-11-03"
    },
    {
        "show_id": 4,
        "name": "Comprometidos",
        "season": 2,
        "episode": 5,
        "description": "As Lendas registram um abalo temporal na Casa Branca do presidente Reagan e ficam chocados ao descobrir que o velho inimigo, Damien Darhk, é agora o conselheiro sênior de Reagan. Conforme a equipe trabalha para descobrir o que Darhk está tramando, Sara sofre com a escolha entre se vingar ou ajudar o time em uma missão maior. Acreditando que os membros da Sociedade da Justiça (JSA) podem ajudar, Amaya e Nate invadem o quartel-general da organização e se surpreendem com o que encontram. Para completar, Stein tenta evitar que sua versão mais nova crie uma aberração de tempo ainda maior.",
        "when": "2016-11-10"
    },
    {
        "show_id": 4,
        "name": "País Fora da Lei",
        "season": 2,
        "episode": 6,
        "description": "As Lendas ainda estão lidando com o fato de que seu mais novo inimigo que viaja pelo tempo é um velocista, mas logo são alertados de uma aberração no Velho Oeste. Ao chegar lá, o time encontra o velho amigo Jonah Hex com problemas relacionados ao seu rival, Quentin Turnbull.",
        "when": "2016-11-17"
    },
    {
        "show_id": 4,
        "name": "Invasão!",
        "season": 2,
        "episode": 7,
        "description": "Depois de descobrir o plano dos Dominadores para o mundo, os Lendários devem trabalhar em conjunto com The Flash, Supergirl e o Arqueiro Verde (Arrow) para matá-los de uma vez por todas. Enquanto isso, Stein descobre, com a ajuda de outros, como a equipe pode acabar com os Dominadores, mas é distraído pela aberração que ele percebe que criou em 1987.",
        "when": "2016-12-01"
    },
    {
        "show_id": 4,
        "name": "O Jeito de Chicago",
        "season": 2,
        "episode": 8,
        "description": "Quando uma nova aberração temporal é descoberta pelo time de Lendas, eles se dirigem para a Chicago do ano 1927. Porém, logo percebem que foram enganados por Eobard Thawne, Damien Darhk e o mais novo membro da Legião do Destino, Malcolm Merlyn. Enquanto todos tentam ajudar a consertar o que acreditam ser a missão, Jax encoraja um relutante Stein a revelar seu segredo para os outros. Stein é feito refém e Sara deve tomar uma difícil decisão: parar a Legião ou salvar o amigo. Ao mesmo tempo, Rory recebe uma visita inesperada e não sabe como lidar com isso.",
        "when": "2016-12-08"
    },
    {
        "show_id": 4,
        "name": "Os Caçadores da Arte Perdida",
        "season": 2,
        "episode": 9,
        "description": "Damien Darhk e Malcolm Merlyn tentam capturar Rip Hunter em 1967 e criam uma aberração grande o suficiente para chamar a atenção dos heróis. No entanto, quando a equipe chega, eles descobrem que Rip não tem lembranças de seu passado devido ao desvio da linha temporal e é apenas um estudante de cinema. Depois de tentar convencer Rip de quem ele era, eles descobrem que Rip possui um artefato incrivelmente poderoso conhecido como a Lança do Destino, que é de grande interesse da Legião do Mal.",
        "when": "2017-01-24"
    },
    {
        "show_id": 4,
        "name": "Legião do Mal",
        "season": 2,
        "episode": 10,
        "description": "Os Lendas tentam resgatar Rip, mas primeiro devem se concentrar em localizar a Lança do Destino. Stein acha que tem a pessoa perfeita para ajudar, mas sabe que envolvê-la será arriscado. Enquanto isso, Malcom Merlyn e Damien Darhk percebem que Thawne está colocando-os um contra o outro.",
        "when": "2017-01-31"
    },
    {
        "show_id": 4,
        "name": "Renegado",
        "season": 2,
        "episode": 11,
        "description": "Os Lendas viajam ao inverno de 1776 para proteger George Washington e a guerra revolucionária americana. Infelizmente, as coisas não saem como planejado, e Sara envia Nate e Amaya para ajudá-los. Enquanto isso, Jax e Stein, que estão ocupados protegendo o incapacitado Waverider de seu novo inimigo, são forçados a desempenhar papéis para os quais eles não se sentem preparados.",
        "when": "2017-02-07"
    },
    {
        "show_id": 4,
        "name": "Camelot/3000",
        "season": 2,
        "episode": 12,
        "description": "Os Lendas viajam para Camelot terra do Rei Arthur e juntam forças com os Cavaleiros da Távola Redonda para proteger um fragmento da Lança do Destino do agora maligno Rip Hunter.",
        "when": "2017-02-21"
    },
    {
        "show_id": 4,
        "name": "A Terra dos Perdidos",
        "season": 2,
        "episode": 13,
        "description": "Após ser capturado, Rip força a queda da Waverider, deixando os Lendas presos setenta milhões de anos no passado. Ray acompanha Amaya e Nate na missão de recuperar uma peça vital da nave. Em uma tentativa de trazer o \"bom\" Rip de volta, Rory sugere que eles entrem na mente de Rip, mas o que Sara e Jax descobrem em seu subconsciente não é nada agradável e eles devem lutar contra versões do mal de si mesmos. Enquanto isso, Nate e Amaya ficam cada vez mais próximos, mas isso pode trazer graves ramificações.",
        "when": "2017-03-07"
    },
    {
        "show_id": 4,
        "name": "Voo à Lua",
        "season": 2,
        "episode": 14,
        "description": "Os Lendas rastreiam o Comandante Gládio na sede da NASA em 1970 e descobrem onde o avô de Nate escondeu o último fragmento da Lança do Destino. Eles notam também uma aberração no tempo durante a missão Apollo 13 e acreditam que a Legião do Mal pode estar envolvida. À medida que os Lendas viajam para o espaço para interceptar a Apollo 13, a Waverider sofre um grande estrago interno e a vida de Ray fica em perigo quando ele é deixado na Lua.",
        "when": "2017-03-14"
    },
    {
        "show_id": 4,
        "name": "Irmandade da Lança",
        "season": 2,
        "episode": 15,
        "description": "Os Lendas elaboram um plano para reaver os fragmentos remanescentes da Lança do Destino da Legião do Mal quando se encontram na França no auge da Primeira Guerra Mundial e tomam conhecimento de que devem destruir o objeto místico. Eles contam com a ajuda de um soldado chamado John Ronald Reuel Tolkin e descobrem que a Lança está levando-os para o meio da guerra. Enquanto isso, a equipe deve resistir à tentação da Lança; e um antigo companheiro retorna.",
        "when": "2017-03-21"
    },
    {
        "show_id": 4,
        "name": "Mundo do Mal",
        "season": 2,
        "episode": 16,
        "description": "Depois de obter a Lança do Destino, a Legião do Mal reescreve a realidade, mudando os Lendas, talvez para sempre. A esperança do mundo e dos Lendas está em Rory, mas ser o “herói” não é fácil para ele. Enquanto isso, a tensão aumenta dentro da Legião do Mal, e a razão pela qual a Lança do Destino precisa ser destruída é revelada.",
        "when": "2017-03-28"
    },
    {
        "show_id": 4,
        "name": "Aruba",
        "season": 2,
        "episode": 17,
        "description": "Quando os Lendas estão prestes a decolar para o seu próximo destino, um grande terremoto chacoalha a embarcação. A fim de tentar corrigir o ocorrido, eles são forçados a quebrar uma regra cardeal de viagem no tempo. Mas se forem capazes de destruir a lança, eles terão que enfrentar a consequência.",
        "when": "2017-04-04"
    },
    {
        "show_id": 4,
        "name": "Aruba-Con",
        "season": 3,
        "episode": 1,
        "description": "Quando os Lendas percebem que quebraram a linha do tempo, Rip Hunter chega com sua nova organização, a Agência do Tempo. Os Lendas ficam animados por ter a chance de juntar a equipe, mas uma nova ameaça surge quando Rory encontra Júlio César em Aruba. Sara, Nate e Ray elaboram um plano para roubar a Waverider da Agência do Tempo, a fim de tentar impedir que Júlio César conquiste o mundo moderno.",
        "when": "2017-10-10"
    },
    {
        "show_id": 4,
        "name": "O Show de Aberrações",
        "season": 3,
        "episode": 2,
        "description": "Os Lendas se encontram em 1870 para consertar o anacronismo no tempo que acontece no circo de P.T. Barnum. No entanto, Nate e Ray acidentalmente soltam um tigre dente-de-sabre, criando um problema ainda maior. Enquanto isso, P.T. Barnum quer capturar Nate e Ray para tornar seu espetáculo ainda mais emocionante para o público.",
        "when": "2017-10-17"
    },
    {
        "show_id": 4,
        "name": "Zari",
        "season": 3,
        "episode": 3,
        "description": "Quando Sara recebe uma chamada de socorro de seu agente na Agência do Tempo, ela descobre que eles foram encarregados de ir para o futuro para capturar um viajante do tempo trapaceiro. Infelizmente, os Lendas pioram as coisas tentando proteger uma fora da lei chamada Zari, enquanto atraem o viajante no tempo assassino. Enquanto isso, Stein tenta diagnosticar a condição de Amaya, mas Nate descobre um tratamento incomum com o qual Amaya concorda.",
        "when": "2017-10-24"
    },
    {
        "show_id": 4,
        "name": "Ligando Para Casa",
        "season": 3,
        "episode": 4,
        "description": "Os Lendas descobrem que Ray Palmer vai morrer devido à ruptura do tempo, fazendo com que eles corram de volta a 1988 para tentar salvar sua vida. Quando eles chegam, eles ficam surpresos ao descobrir que o jovem Ray Palmer fez amizade com um bebê Dominador, colocando-o em perigo com o governo e com a mãe do Dominador. Novata na nave e nas missões, Zari deve encontrar seu lugar e aprender a confiar na equipe. Enquanto isso, Stein começa a trabalhar em um projeto secreto na nave, o que levanta a suspeita de Rory e Jax.",
        "when": "2017-10-31"
    },
    {
        "show_id": 4,
        "name": "O Retorno do Mack",
        "season": 3,
        "episode": 5,
        "description": "Nate pensa que encontrou um padrão para os anacronismos, o que leva os Lendas para a Londres de 1897 para perseguir um vampiro viajante no tempo. Quando eles chegam em Londres, eles se deparam com Rip, mas nem todo mundo o recebe de volta tão rapidamente, o que obriga Sara a fazer uma escolha difícil no final. Amaya tenta se conectar com Zari, mas ela ainda está lutando para fazer parte da equipe. Enquanto isso, Stein descobre o que Ray e Jax estão fazendo e não fica nada contente.",
        "when": "2017-11-07"
    },
    {
        "show_id": 4,
        "name": "Caçando Helena",
        "season": 3,
        "episode": 6,
        "description": "Quando os Lendas rastreiam um anacronismo na década de 1930 em Hollywood, eles encontram Helena de Tróia deslocada no tempo, começando uma guerra entre dois estúdios de cinema. À medida que os Lendas tentam consertar a história e levar Helena para sua época, as coisas se complicam com o retorno de um antigo inimigo. Sara considera uma oferta que faria com que os Lendas deixassem de lado os anacronismos. Enquanto isso, Stein e Jax encontram-se numa situação inusitada.",
        "when": "2017-11-14"
    },
    {
        "show_id": 4,
        "name": "Bem-Vindos à Selva",
        "season": 3,
        "episode": 7,
        "description": "Com Sara fora do comando, a equipe descobre um novo anacronismo que os leva às selvas do Vietnã em meio à guerra. Ray, Amaya e Zari se passam por jornalistas e atravessam a selva quando encontram Gorilla Grodd deslocado no tempo. Enquanto isso, Nate e Rory encontram uma pessoa conhecida de Rory que traz lembranças do seu passado.",
        "when": "2017-11-21"
    },
    {
        "show_id": 4,
        "name": "Crise na Terra-X - Parte 4",
        "season": 3,
        "episode": 8,
        "description": "O casamento de Barry e Iris reúne a turma, mas problemas surgem quando vilões da Terra-X atacam a cerimônia. Os super-heróis contam com a ajuda de seus super amigos como Cidadão Frio, The Ray, Felicity Smoak, Iris West e Alex Danvers para enfrentar os perigosos vilões. Os heróis mais poderosos da Terra – Arqueiro Verde, Supergirl, The Flash e Canário Branco – lideram suas equipes na batalha para salvar o mundo.",
        "when": "2017-11-28"
    },
    {
        "show_id": 4,
        "name": "Beebo: O Deus da Guerra",
        "season": 3,
        "episode": 9,
        "description": "Abalados pelos eventos recentes, os Lendas mergulham no trabalho investigando um anacronismo em um assentamento Viking no Novo Mundo. Os Lendas percebem que os Nórdicos veneram um artefato como um deus e são surpreendidos pela origem do artefato. Pela primeira vez, Sara está preocupada de que eles possam precisar de ajuda quando Damien Darhk aparecer. Enquanto isso, Jax encontra uma lacuna que potencialmente pode alterar a história, mas é um risco que ele está disposto a tomar.",
        "when": "2017-12-05"
    },
    {
        "show_id": 4,
        "name": "Papai Darhk",
        "season": 3,
        "episode": 10,
        "description": "Após o encontro de Sara com Mallus, os Lendas recebem a visita de John Constantine, um detetive demoníaco. Os heróis concordam em acompanhá-lo para um hospital psiquiátrico dos dias atuais e ficam surpresos ao descobrir quem Constantine está tentando ajudar. Durante o exorcismo, Sara, Leo e Constantine desaparecem, deixando Ray e Zari responsáveis por cuidar do cliente de Constantine. Enquanto isso, Amaya e Nate mais uma vez ficam cara a cara com Kuasa.",
        "when": "2018-02-12"
    },
    {
        "show_id": 4,
        "name": "Lá Vou Eu de Novo",
        "season": 3,
        "episode": 11,
        "description": "Depois que a equipe retorna de uma missão, Zari encontra-se presa em um loop temporal com a Waverider explodindo sucessivamente. Zari começa a suspeitar que a resposta para parar esse evento pode estar escondida entre os segredos dos seus companheiros de nave. Mas ao investigar, ela começa a entender seu lugar na equipe.",
        "when": "2018-02-19"
    },
    {
        "show_id": 4,
        "name": "A Maldição do Totem da Terra",
        "season": 3,
        "episode": 12,
        "description": "Quando Sara decide tirar um tempo para si, os Lendas investigam uma pista sobre o paradeiro do Totem da Terra, há muito tempo perdido. Sem o conhecimento de Sara, os Lendas vão parar em 1717 para caçar o tesouro perdido de Barba Negra, mas as coisas não saem como esperado. Enquanto isso, Ray se sente culpado por algo que ele fez e tenta corrigir a situação, o que o coloca em problemas ainda maiores.",
        "when": "2018-02-26"
    },
    {
        "show_id": 4,
        "name": "Onde os Velhos Pais Não Tem Vez",
        "season": 3,
        "episode": 13,
        "description": "Quando Damien e Nora Darhk fazem Ray de refém, eles o obrigam a tentar consertar o Totem de Fogo, mas Ray usa o conflito de poder entre eles para ganhar vantagem. Ray e Nora encontram-se trabalhando juntos na Alemanha Oriental da década de 1960 para consertar o totem, mas logo se deparam com uma versão mais nova e mais mortal de Damien Darhk. Enquanto isso, Sara parece estar dando passos positivos em sua vida pessoal.",
        "when": "2018-03-05"
    },
    {
        "show_id": 4,
        "name": "A Incrível Graça",
        "season": 3,
        "episode": 14,
        "description": "Quando os Lendas descobrem que uma misteriosa tragédia destruiu Memphis em 1954, erradicando o local de nascimento do rock and roll, eles embarcam em sua missão mais importante para salvar a música. Nate está animado para mostrar a Amaya porque a música é importante para ele e eles tem uma surpresa que os levam a uma grande lenda do rock e ao último totem, o Death Totem. Enquanto isso, Zari ajuda seu novo membro a tentar se ajustar à equipe.",
        "when": "2018-03-12"
    },
    {
        "show_id": 4,
        "name": "Necromando a Pedra",
        "season": 3,
        "episode": 15,
        "description": "Quando o poder de Mallus sobre Sara ressurge, ela involuntariamente se torna portadora de um dos Totens. Rory deve conquistar seu lado sombrio para exercer o poder do próprio Totem e ajudar a salvar a equipe. Enquanto isso, a Agente Sharpe nota que algo estão errado e recruta alguém pouco ortodoxo para ajudar.",
        "when": "2018-03-19"
    },
    {
        "show_id": 4,
        "name": "Eu, Ava",
        "season": 3,
        "episode": 16,
        "description": "Quando Ava desaparece, Sara e Ray partem para encontrá-la depois de descobrir uma verdade perturbadora sobre Ava. Amaya encarrega Zari de ajudar a treinar Rory no controle de seu próprio poder de Totem. Enquanto isso, Nate e Wally partem em uma missão que não sai como planejado quando eles fazem parceria com uma pessoa improvável para tentar pegar um Totem.",
        "when": "2018-03-26"
    },
    {
        "show_id": 4,
        "name": "John Noble como Ator Convidado",
        "season": 3,
        "episode": 17,
        "description": "Com a linha do tempo instável, os Lendas precisam enfrentar dois anacronismos ao mesmo tempo para tentar manter Mallus à distância. Sara e Rip se unem para impedir que Grodd corra atrás de um alvo em particular, enquanto Nate e Wally precisam impedir que Amaya mude seu próprio futuro. Enquanto isso, os Lendas acham que encontraram uma maneira de destruir Mallus, mas terão que fazer uma aliança desconfortável com um de seus inimigos.",
        "when": "2018-04-02"
    },
    {
        "show_id": 4,
        "name": "O Bom, O Ruim e O Fofo",
        "season": 3,
        "episode": 18,
        "description": "O plano dos Lendas de derrotar Mallus usando os totens não sai como planejado, obrigando Rip a improvisar. A equipe se reagrupa no Velho Oeste, onde eles encontram o velho amigo Jonah Hex. Sara deixa Ray encarregado de vigiar Damien Darhk, enquanto ela apresenta um novo plano. Enquanto isso, Amaya está determinada a encontrar uma maneira de usar os totens para destruir Mallus.",
        "when": "2018-04-09"
    },
    {
        "show_id": 4,
        "name": "O Virgem Gary",
        "season": 4,
        "episode": 1,
        "description": "Depois que as Lendas derrotaram Mallus e eliminaram o anacronismo final do tempo, eles se encontram em território desconhecido com o Time Bureau. Tudo isso muda quando Constantine informa Sara de uma nova ameaça mágica que leva a equipe a Woodstock. Constantine acha que sabe como derrotar a nova ameaça, mas precisará da ajuda da equipe e de seus talentos especiais para ajudar no seu feitiço. Enquanto isso, Nate e Rory vão em uma aventura levando Nate a enfrentar alguém de seu passado.",
        "when": "2018-10-22"
    },
    {
        "show_id": 4,
        "name": "Caça as Bruxas",
        "season": 4,
        "episode": 2,
        "description": "Quando o Sismógrafo de Tempo mágico dispara, a equipe vai parar no julgamento das bruxas de Salem. Sara percebe que Zari está levando este caso para o lado pessoal quando ela promete salvar uma mãe, que está sendo acusada de ser uma bruxa. No entanto, a equipe aprende rapidamente que há uma criatura mágica na cidade criando problemas que eles não esperavam. Enquanto isso, Nate e Ava trabalham juntos para tentar manter o financiamento do Bureau, provando a eles que a magia existe.",
        "when": "2018-10-29"
    },
    {
        "show_id": 4,
        "name": "A Rainha da Dança",
        "season": 4,
        "episode": 3,
        "description": "Quando os Lendas descobrem que um fugitivo está se escondendo na Londres dos anos 1970, eles percebem que ele faz parte de uma gangue que tem como alvo a monarquia britânica. Tentando parar a gangue, eles percebem que alguém dos Lendas deve se infiltrar neles. Surpreendendo a todos, Ray é o único a ganhar sua confiança depois de ser submetido a uma série de testes com a ajuda de Sara e Rory. Enquanto isso, Gary mostra a Nate as atividades do Time Bureau, mas acaba sendo algo diferente de um dia comum no escritório.",
        "when": "2018-11-05"
    },
    {
        "show_id": 4,
        "name": "Mais Uma Chatice Americana",
        "season": 4,
        "episode": 4,
        "description": "Quando os Lendas do Amanhã descobrem que crianças desapareceram em um acampamento de verão, Sara, Ava, Ray e Constantine se passam por novos conselheiros do acampamento. Lá, Ava tem dificuldade em se entrosar com as crianças, mas Constantine prepara uma poção que ajuda Sara e Ava a se relacionarem melhor com as crianças. A equipe encontra pistas sobre o paradeiro das crianças desaparecidas, mas a batalha para salvá-las deixa um membro em péssimo estado. Enquanto isso, Rory e Zari são encarregados de vigiar o fugitivo e Rory encontra uma afinidade no \"prisioneiro\".",
        "when": "2018-11-12"
    },
    {
        "show_id": 4,
        "name": "O Tagumo Ataca!!!",
        "season": 4,
        "episode": 5,
        "description": "Um fugitivo está à solta na Tóquio de 1951, e Sara, Zari, Rory e Charlie tentam capturá-lo. Enquanto Constantine se esforça para se recuperar, Ray percebe que a magia pode ser a única coisa que pode salvá-lo, mas deve procurar ajuda fora da equipe. Enquanto isso, Ava se junta a Nate e sua família para um jantar nada convencional no Dia de Ação de Graças.",
        "when": "2018-11-19"
    },
    {
        "show_id": 4,
        "name": "Suave é o Nate",
        "season": 4,
        "episode": 6,
        "description": "Quando Hank Heywood confronta Ava sobre os gastos dos Lendas, Nate intervém para tentar amenizar as coisas convidando Hank para a Waverider. Os Lendas em seguida mostram a Hank o que eles fazem visitando Paris, na década de 1920, tentando capturar o mais novo Fugitivo. Enquanto isso, Mona está tentando causar uma boa impressão em Ava, mas as duas acabam presas em uma cela.",
        "when": "2018-11-26"
    },
    {
        "show_id": 4,
        "name": "Nada Disso Bonequinho!",
        "season": 4,
        "episode": 7,
        "description": "Com Rory e Ava brigados, Sara tenta encontrar uma maneira dos dois se entenderem, mas tudo fica em suspenso quando uma nova criatura mágica ataca os Lendas. Constantine é forçado a confrontar seu passado trágico, mas isso pode ter consequências devastadoras para o resto do time. Enquanto isso, Mona tem uma queda por alguém com quem trabalha e recebe alguns conselhos de Nate.",
        "when": "2018-12-03"
    },
    {
        "show_id": 4,
        "name": "Lendas do Meow-Meow",
        "season": 4,
        "episode": 8,
        "description": "Depois que Constantine quebra a regra de ouro da equipe (\"você não pode mudar o passado\"), ele, Charlie e Zari tentam lidar com as consequências sem contar ao resto dos Lendas. Mesmo que Zari os incentive a consertar o problema, Constantine e Charlie estão determinados a encontrar outro caminho, mas só continuam a piorar as coisas.",
        "when": "2018-12-10"
    },
    {
        "show_id": 4,
        "name": "Lucha de Apuestas",
        "season": 4,
        "episode": 9,
        "description": "Quando os Lendas descobrem que Mona deixou um fugitivo sair, eles devem ir para a Cidade do México de 1961 para limpar sua bagunça. Mona tenta convencer os Lendas e o Bureau de que os responsáveis ​​por libertar o fugitivo eram alguns misteriosos Homens de Preto e não ela. Sem provas para apoiar sua teoria, os Lendas devem decidir se devem confiar nela e ir contra o Bureau. Enquanto isso, Nate e Zari fazem uma missão de reconhecimento para descobrir o que Hank pode estar escondendo de todos.",
        "when": "2019-04-01"
    },
    {
        "show_id": 4,
        "name": "A Fuga",
        "season": 4,
        "episode": 10,
        "description": "Quando Hank comanda o Waverider para 1973, os Lendas se veem fugindo em um trailer depois de sequestrar o presidente que só é capaz de dizer a verdade. Com a ajuda de Constantine, eles descobrem a razão pela qual nenhum deles pode mentir, tornando essa viagem em família desconfortável. Enquanto isso, Nate e Zari, com a ajuda de Nora e Gary, trabalham juntos para descobrir o que Hank está realmente querendo.",
        "when": "2019-04-08"
    },
    {
        "show_id": 4,
        "name": "Espiritismo e Sensibilidade",
        "season": 4,
        "episode": 11,
        "description": "Quando Mona descobre que sua autora favorita, Jane Austen, pode estar no epicentro de um alerta mágico, Mona, Sara, Charlie e Zari se encontram em 1809. Com Nate ainda lidando com problemas familiares, Constantine e Rory fazem uma sessão e recebem um mensagem do outro mundo que balança Constantine. Enquanto isso, Ray e Nora são forçados a se aproximar.",
        "when": "2019-04-15"
    },
    {
        "show_id": 4,
        "name": "A Beringela, A Bruxa e o Guarda-Roupa",
        "season": 4,
        "episode": 12,
        "description": "Com a escuridão aumentando em 2019, a equipe percebe que uma nova quantidade de problemas surge à medida que eles limpam a história. Sara tenta salvar Ava de um destino pior do que a morte enquanto luta contra seus próprios demônios. Nora e Constantine trabalham juntos para derrubar um demônio poderoso. Enquanto isso, Zari recebe conselhos não solicitados de Mona, Charlie e até mesmo de Rory.",
        "when": "2019-04-22"
    },
    {
        "show_id": 4,
        "name": "Ovo MacGuffin",
        "season": 4,
        "episode": 13,
        "description": "Enquanto Ray está preocupado com Nora, de repente ele se depara com seu próprio problema que o força a fazer o impensável. Nate e Zari estão presos em um limbo estranho, então Sara elabora um plano para enviá-los em uma missão fácil juntos. Enquanto isso, Charlie e Rory são abordados com uma oferta lucrativa que poderia melhorar suas vidas.",
        "when": "2019-04-29"
    },
    {
        "show_id": 4,
        "name": "O Poder do Mamilo",
        "season": 4,
        "episode": 14,
        "description": "Com Constantine desaparecido, os Lendas lutam para encontrar uma maneira de rastreá-lo. Quando Sara hesita em tomar uma difícil decisão, Rory se posiciona e cria um desconforto na equipe. Enquanto isso, Ava dá a Gary a responsabilidade de lidar com as avaliações de desempenho para todos os agentes.",
        "when": "2019-05-06"
    },
    {
        "show_id": 4,
        "name": "Termos de Serviço",
        "season": 4,
        "episode": 15,
        "description": "Com as coisas saindo de controle, Sara e Ava bolam um plano ousado para retomar a Time Bureau. Mas quando as coisas dão errado, Zari e Charlie devem trabalhar juntas para descobrir o que Neron está planejando. Enquanto isso, Constantine tem uma escolha difícil sobre quem salvar do inferno.",
        "when": "2019-05-13"
    },
    {
        "show_id": 4,
        "name": "Ei, Mundo!",
        "season": 4,
        "episode": 16,
        "description": "Durante uma missão para encontrar Ray, Constantine e Nora descobrem o plano maligno de Neron. Nate convence os Lendas a pensar fora da caixa e sugere um plano perigoso para unir criaturas mágicas e pessoas para salvar o mundo.",
        "when": "2019-05-20"
    },
    {
        "show_id": 4,
        "name": "Crise nas Infinitas Terras - Parte 5",
        "season": 5,
        "episode": 1,
        "description": "Largados em um mundo estranho e unidos pela dor, as Lendas e seus aliados Paragon se preparam para o confronto final com Antimonitor.\n\n“Mundos viveram, mundos morreram. Nada será como antes.\"  O crossover começa em Supergirl S5E08, Batwoman S1E09, The Flash S6 E09 e Arrow S8E08.",
        "when": "2020-01-14"
    },
    {
        "show_id": 4,
        "name": "Conheçam as Lendas",
        "season": 5,
        "episode": 2,
        "description": "Uma equipe de documentário embarca na Waverider. Um bug afeta Gideon. As Lendas vão até a Rússia imperial para investigar um tremor temporal.",
        "when": "2020-01-21"
    },
    {
        "show_id": 4,
        "name": "Saudades, Beijos, Amor",
        "season": 5,
        "episode": 3,
        "description": "A equipe descobre o plano de Astra e vai até a Los Angeles da década de 1940 para deter um famoso gângster que voltou dos mortos.",
        "when": "2020-02-04"
    },
    {
        "show_id": 4,
        "name": "Mate Qualquer Coisa",
        "season": 5,
        "episode": 4,
        "description": "Um salto temporal duplo leva a tripulação para 1989 e 2004 para impedir que o Assassino da Formatura transforme um baile em um banho de sangue.",
        "when": "2020-02-11"
    },
    {
        "show_id": 4,
        "name": "A Cabeça de Seu Tempo",
        "season": 5,
        "episode": 5,
        "description": "O passado de Constantine o assombra. As Lendas perseguem mais uma pessoa que voltou dos mortos e acabam indo parar num evento extravagante durante a Revolução Francesa.",
        "when": "2020-02-18"
    },
    {
        "show_id": 4,
        "name": "Mortal Khanbat",
        "season": 5,
        "episode": 6,
        "description": "Genghis Khan ressuscita sedento de conquistas e invade os territórios das Tríades na Hong Kong dos anos 90. Constantine busca a cura para sua doença.",
        "when": "2020-02-25"
    },
    {
        "show_id": 4,
        "name": "Rua Sem Saída do Senhor Parker",
        "season": 5,
        "episode": 7,
        "description": "Nora envolve a equipe numa elaborada teia de mentiras quando seu pai, Damien Darhk, volta dos mortos. Zari ajuda Mick a resolver um problema.",
        "when": "2020-03-10"
    },
    {
        "show_id": 4,
        "name": "Romeu vs. Julieta: A Origem da Justiça",
        "season": 5,
        "episode": 8,
        "description": "Ray não sabe como dar uma notícia importante para Nate. A Waverider viaja para a Londres elisabetana para encontrar William Shakespeare e uma parte do Tear do Destino.",
        "when": "2020-03-17"
    },
    {
        "show_id": 4,
        "name": "Zari Não é Zari",
        "season": 5,
        "episode": 9,
        "description": "Zari e Mick lidam com seus passados alternativos. A irmã assassina de Charlie persegue a equipe para recuperar uma parte do Tear do Destino.",
        "when": "2020-04-21"
    },
    {
        "show_id": 4,
        "name": "A Grande Farsa Britânica",
        "season": 5,
        "episode": 10,
        "description": "Constantine e Zari vão atrás do anel da Lachesis em uma pensão vitoriana e acabam se metendo em encrenca. Gary, Ava e Mick descem ao inferno.",
        "when": "2020-04-28"
    },
    {
        "show_id": 4,
        "name": "Nave Quebrada",
        "season": 5,
        "episode": 11,
        "description": "Mick e Lita tentam curtir um final de semana de pai e filha. Sara descobre uma nova habilidade assustadora. Uma força sinistra persegue a Waverider.",
        "when": "2020-05-05"
    },
    {
        "show_id": 4,
        "name": "Geeks & Aberrações",
        "season": 5,
        "episode": 12,
        "description": "As Lendas vão parar no campus de uma faculdade para pegar o Cálice de Dionísio. Mas, primeiro, eles precisam vencer um desafio.",
        "when": "2020-05-12"
    },
    {
        "show_id": 4,
        "name": "Eu Sou as Lendas",
        "season": 5,
        "episode": 13,
        "description": "As Lendas se tornam imortais por um dia e correm para usar o tear, mas têm que enfrentar uma traição e hordas de mortos-vivos. Gary encara as Irmãs do Destino sozinho.",
        "when": "2020-05-19"
    },
    {
        "show_id": 4,
        "name": "Aquele Em Que Estamos Presos na TV",
        "season": 5,
        "episode": 14,
        "description": "Num mundo distópico governado pelas Irmãs do Destino, as Lendas acabam aprisionadas em programas de TV e lutam para lembrar quem realmente são.",
        "when": "2020-05-26"
    },
    {
        "show_id": 4,
        "name": "Música da Tanga",
        "season": 5,
        "episode": 15,
        "description": "Num confronto final através do tempo, as Lendas lutam para salvar Charlie, derrotar as Irmãs do Destino e restaurar o livre-arbítrio da humanidade de uma vez por todas.",
        "when": "2020-06-02"
    },
    {
        "show_id": 4,
        "name": "Controle Terrestre para Sara Lance",
        "season": 6,
        "episode": 1,
        "description": "",
        "when": "2021-05-02"
    },
    {
        "show_id": 4,
        "name": "Episódio 2",
        "season": 6,
        "episode": 2,
        "description": "",
        "when": "2021-05-09"
    },
    {
        "show_id": 4,
        "name": "Episódio 3",
        "season": 6,
        "episode": 3,
        "description": "",
        "when": "2021-05-16"
    },
    {
        "show_id": 4,
        "name": "Episódio 4",
        "season": 6,
        "episode": 4,
        "description": "",
        "when": "2021-05-23"
    },
    {
        "show_id": 4,
        "name": "Episódio 5",
        "season": 6,
        "episode": 5,
        "description": "",
        "when": "2021-06-06"
    },
    {
        "show_id": 4,
        "name": "Episódio 6",
        "season": 6,
        "episode": 6,
        "description": "",
        "when": "2021-06-13"
    },
    {
        "show_id": 4,
        "name": "Episódio 7",
        "season": 6,
        "episode": 7,
        "description": "",
        "when": "2021-06-20"
    },
    {
        "show_id": 4,
        "name": "Episódio 8",
        "season": 6,
        "episode": 8,
        "description": "",
        "when": "2021-06-27"
    },
    {
        "show_id": 4,
        "name": "Episódio 9",
        "season": 6,
        "episode": 9,
        "description": "",
        "when": "2021-07-11"
    },
    {
        "show_id": 4,
        "name": "Episódio 10",
        "season": 6,
        "episode": 10,
        "description": "",
        "when": "2021-07-18"
    },
    {
        "show_id": 4,
        "name": "Episódio 11",
        "season": 6,
        "episode": 11,
        "description": "",
        "when": "2021-08-08"
    },
    {
        "show_id": 4,
        "name": "Episódio 12",
        "season": 6,
        "episode": 12,
        "description": "",
        "when": "2021-08-15"
    },
    {
        "show_id": 4,
        "name": "Episódio 13",
        "season": 6,
        "episode": 13,
        "description": "",
        "when": "2021-08-22"
    },
    {
        "show_id": 4,
        "name": "Episódio 14",
        "season": 6,
        "episode": 14,
        "description": "",
        "when": "2021-08-29"
    },
    {
        "show_id": 4,
        "name": "Episódio 15",
        "season": 6,
        "episode": 15,
        "description": "",
        "when": "2021-09-05"
    },
    {
        "show_id": 4,
        "name": "Episódio 1",
        "season": 7,
        "episode": 1,
        "description": "",
        "when": "2021-10-13"
    },
    {
        "show_id": 4,
        "name": "Episódio 2",
        "season": 7,
        "episode": 2,
        "description": "",
        "when": "2021-10-20"
    },
    {
        "show_id": 4,
        "name": "Episódio 3",
        "season": 7,
        "episode": 3,
        "description": "",
        "when": "2021-10-27"
    },
    {
        "show_id": 5,
        "name": "A Ressurreição",
        "season": 1,
        "episode": 1,
        "description": "Com a vida de suas filhas em risco, o diretor de escola Jefferson Pierce não tem escolha: é hora de voltar a usar os superpoderes que ele deixou para trás.",
        "when": "2018-01-16"
    },
    {
        "show_id": 5,
        "name": "LaWanda: Uma Mensagem de Esperança",
        "season": 1,
        "episode": 2,
        "description": "A rixa entre os Jefferson e Lala piora quando uma ex-aluna pede ajuda para resgatar sua filha sequestrada por uma gangue. Anissa fica intrigada com sua nova força.",
        "when": "2018-01-23"
    },
    {
        "show_id": 5,
        "name": "LaWanda: O Livro do Sepultamento",
        "season": 1,
        "episode": 3,
        "description": "Conforme o reverendo Holt convoca os cidadãos a saírem às ruas em protesto, Jefferson e Gambi se esforçam para proteger os manifestantes da ira dos 100.",
        "when": "2018-01-30"
    },
    {
        "show_id": 5,
        "name": "Jesus Negro",
        "season": 1,
        "episode": 4,
        "description": "Jefferson tenta descobrir quem está por trás da assustadora nova droga que circula nas ruas. Lady Eve dá um ultimado a Tobias, e Anissa usa seus poderes.",
        "when": "2018-02-06"
    },
    {
        "show_id": 5,
        "name": "Então, o Diabo Trouxe a Praga: O Livro da Luz Verde",
        "season": 1,
        "episode": 5,
        "description": "Um novo traje traz mais poderes para Jefferson, mas acaba afetando seu corpo. Anissa examina a reportagem que seu avô estava escrevendo antes de morrer.",
        "when": "2018-02-13"
    },
    {
        "show_id": 5,
        "name": "Três Setes: O Livro de Thunder",
        "season": 1,
        "episode": 6,
        "description": "A busca de Jefferson por Tobias chega a um momento crucial. Anissa participa de um protesto em um monumento. Jennifer tem dúvidas sobre Khalil.",
        "when": "2018-02-27"
    },
    {
        "show_id": 5,
        "name": "Equinócio: O Livro do Destino",
        "season": 1,
        "episode": 7,
        "description": "A polícia investiga a invasão do laboratório. Lynn e Jefferson discutem o futuro de Anissa. Gambi e Lady Eve enviam uma mensagem a Tobias.",
        "when": "2018-03-06"
    },
    {
        "show_id": 5,
        "name": "Livro do Apocalipse",
        "season": 1,
        "episode": 8,
        "description": "Ignorando as súplicas de Gambi, Jefferson e Anissa tentam limpar o nome de Raio Negro. Lynn e Jennifer fazem uma descoberta surpreendente.",
        "when": "2018-03-13"
    },
    {
        "show_id": 5,
        "name": "O Livro das Mentirinhas Negras",
        "season": 1,
        "episode": 9,
        "description": "Jennifer luta para se adaptar a sua nova realidade. Jefferson e Anissa relacionam a pesquisa de Alvin à Luz Verde. Henderson se alia aos inimigos.",
        "when": "2018-03-20"
    },
    {
        "show_id": 5,
        "name": "Pecados do Pai: O Livro do Êxodo",
        "season": 1,
        "episode": 10,
        "description": "Anissa visita um laboratório secreto ligado a uma onda de desaparecimentos de 30 anos antes. Outra criança de Freeland é raptada. Gambi enfrenta uma experiência terrível.",
        "when": "2018-03-27"
    },
    {
        "show_id": 5,
        "name": "Jesus Negro: O Livro da Crucificação",
        "season": 1,
        "episode": 11,
        "description": "Uma conspiração coloca Jefferson atrás das grades e Anissa e Gambi bolam um plano de distração. Henderson descobre coisas comprometedoras sobre seus colegas da polícia.",
        "when": "2018-04-03"
    },
    {
        "show_id": 5,
        "name": "Ressurreição e Luz: O Livro da Dor",
        "season": 1,
        "episode": 12,
        "description": "Com a missão de capturar Raio Negro vivo, Tobias bola um plano para atraí-lo. Khalil volta para Freeland como um novo homem.",
        "when": "2018-04-10"
    },
    {
        "show_id": 5,
        "name": "Sombra da Morte: O Livro da Guerra",
        "season": 1,
        "episode": 13,
        "description": "O confronto em Garfield deixa a família de Pierce abalada. Mas com Proctor e Tobias em pé de guerra, eles não têm muito tempo para se reagrupar.",
        "when": "2018-04-17"
    },
    {
        "show_id": 5,
        "name": "O Nascimento dos Filhos da Luz Verde: O Livro das Consequências - Capítulo 1",
        "season": 2,
        "episode": 1,
        "description": "Jefferson descobre que seu trabalho em Garfield está em perigo. Lynn procura ajudar as crianças das câmaras. Os poderes de Jennifer se manifestam de um jeito assustador.",
        "when": "2018-10-09"
    },
    {
        "show_id": 5,
        "name": "O Blues do Jesus Negro: O Livro das Consequências - Capítulo 2",
        "season": 2,
        "episode": 2,
        "description": "Uma garota escapa de sua cápsula e faz estragos em Freeland. Os Pierces ajudam Issa a entender seus poderes. Anissa faz uma conexão romântica.",
        "when": "2018-10-16"
    },
    {
        "show_id": 5,
        "name": "Mestre Lowry: O Livro das Consequências - Capítulo 3",
        "season": 2,
        "episode": 3,
        "description": "Enquanto Jefferson se adapta à nova função, Tobias pressiona Khalil, Anissa promete salvar uma clínica da igreja, e uma estranha surpreende Jennifer.",
        "when": "2018-10-23"
    },
    {
        "show_id": 5,
        "name": "Aberração Translúcida: O Livro das Consequências - Capítulo 4",
        "season": 2,
        "episode": 4,
        "description": "Henderson busca uma forma de manter Tobias sob custódia. Cansada das regras de seu pai, Anissa se muda. Gambi descobre um plano de ataque à clínica.",
        "when": "2018-10-30"
    },
    {
        "show_id": 5,
        "name": "Réquiem: O Livro do Sangue - Capítulo 1",
        "season": 2,
        "episode": 5,
        "description": "Notícias devastadoras abalam os Pierce. Anissa testemunha um fenômeno estranho na clínica. Lynn e a Dra. Jace tentam salvar os garotos.",
        "when": "2018-11-13"
    },
    {
        "show_id": 5,
        "name": "Os Perdis: O Livro do Sangue - Capítulo 2",
        "season": 2,
        "episode": 6,
        "description": "Enquanto Lynn sofre pelo acidente no laboratório, Anissa descobre mais coisas perturbadoras em Freeland Sul. Khalil hesita em cumprir uma ordem de Tobias.",
        "when": "2018-11-20"
    },
    {
        "show_id": 5,
        "name": "Os Sanges: O Livro do Sangue - Capítulo 3",
        "season": 2,
        "episode": 7,
        "description": "Em busca do bebê desaparecido, Raio Negro segue o rastro de prata até a propriedade de Looker. Jennifer ajuda Khalil a resolver seu problema com Tobias.",
        "when": "2018-11-27"
    },
    {
        "show_id": 5,
        "name": "Êxodo: O Livro da Rebelião - Capítulo 1",
        "season": 2,
        "episode": 8,
        "description": "Uma ação arriscada de Khalil força Jennifer a usar seus poderes em público. Enquanto isso, Tobias e os Pierces correm para encontrar a dupla desaparecida.",
        "when": "2018-12-04"
    },
    {
        "show_id": 5,
        "name": "Presente dos Magos: O Livro da Rebelião - Capítulo 2",
        "season": 2,
        "episode": 9,
        "description": "Jennifer cuida dos ferimentos de Khalil, enquanto os Pierces e Cutter vasculham a área ao redor. Tobias faz uma oferta a um jovem prodígio da tecnologia.",
        "when": "2018-12-11"
    },
    {
        "show_id": 5,
        "name": "Angelitos Negros: O Livro da Rebelião - Capítulo 3",
        "season": 2,
        "episode": 10,
        "description": "Lynn se junta à busca e faz um apelo sincero a Jennifer. Tobias manda Todd driblar o firewall de um computador. Jefferson faz um acordo com Henderson.",
        "when": "2019-01-21"
    },
    {
        "show_id": 5,
        "name": "O Filho Pródigo: O Livro dos Segredos - Capítulo 1",
        "season": 2,
        "episode": 11,
        "description": "Armado com informações de Khalil, Jefferson cria um novo plano para derrubar Tobias. Jennifer pede ajuda à mãe. Todd tira a Dra. Jace da prisão.",
        "when": "2019-01-28"
    },
    {
        "show_id": 5,
        "name": "Justo e Injusto: O Livro dos Segredos - Capítulo 2",
        "season": 2,
        "episode": 12,
        "description": "Jennifer passa por um turbilhão de emoções. Lynn percebe que está sendo seguida, e Anissa se arrisca para ajudar uma mulher ligada aos Cem.",
        "when": "2019-02-04"
    },
    {
        "show_id": 5,
        "name": "Pilar de Fogo: O Livro dos Segredos - Capítulo 3",
        "season": 2,
        "episode": 13,
        "description": "Odell pede que Lynn ajude a salvar os garotos dos markovianos. Tobias desperta um de seus novos metas. Anissa faz uma descoberta surpreendente sobre Grace.",
        "when": "2019-02-11"
    },
    {
        "show_id": 5,
        "name": "Pecado Original: O Livro dos Segredos - Capítulo 4",
        "season": 2,
        "episode": 14,
        "description": "Jefferson lida com a visita surpresa de Lala, Anissa segue uma pista sobre Grace, e Odell pressiona Lynn a usar as crianças como armas.",
        "when": "2019-03-04"
    },
    {
        "show_id": 5,
        "name": "O Alfa: O Livro do Apocalipse - Capítulo 1",
        "season": 2,
        "episode": 15,
        "description": "Jennifer fica frustrada com as novas regras familiares de Jefferson. A fim de divulgar seu exército, Tobias libera outro tipo de meta em Freeland.",
        "when": "2019-03-11"
    },
    {
        "show_id": 5,
        "name": "O Ômega: O Livro do Apocalipse - Capítulo 2",
        "season": 2,
        "episode": 16,
        "description": "Tobias vai atrás da fonte do poder do Raio Negro e provoca caos na cidade. Jennifer busca se redimir depois de uma missão que deu muito errado.",
        "when": "2019-03-18"
    },
    {
        "show_id": 5,
        "name": "O Livro da Ocupação - Capítulo 1: Nasce o Pássaro Negro",
        "season": 3,
        "episode": 1,
        "description": "Com Raio Negro preso em uma unidade de testes, a ASA aperta o cerco em Freeland. Anissa e Gambi querem ajudar a tirar os metas da cidade.",
        "when": "2019-10-07"
    },
    {
        "show_id": 5,
        "name": "O Livro da Ocupação - Capítulo 2: O Tasbih de Maryam",
        "season": 3,
        "episode": 2,
        "description": "Lynn tenta salvar a meta Maryam. A chegada de refugiados causa conflito entre Anissa e os perdis. Odell recorre a uma nova arma.",
        "when": "2019-10-14"
    },
    {
        "show_id": 5,
        "name": "O Livro da Ocupação - Capítulo 3: O Sonho Impossível do Agente Odell",
        "season": 3,
        "episode": 3,
        "description": "Lynn investiga um vírus mortal que se alastra pelo campo de metas. Odell recruta Jefferson e Jennifer para diferentes missões contra os markovianos.",
        "when": "2019-10-21"
    },
    {
        "show_id": 5,
        "name": "O Livro da Ocupação - Capítulo 4: O Ouroboros de Lynn",
        "season": 3,
        "episode": 4,
        "description": "Desesperada para encontrar a cura para o vírus, Lynn testa uma forma modificada da Luz Verde. Jefferson se adapta à lei marcial.",
        "when": "2019-10-28"
    },
    {
        "show_id": 5,
        "name": "O Livro da Ocupação - Capítulo 5: O Réquiem de Tavon",
        "season": 3,
        "episode": 5,
        "description": "Anissa embarca em uma missão arriscada. Lynn encontra um paciente que pode ajudá-la a estabilizar o metagene. Henderson dá início a um plano secreto.",
        "when": "2019-11-11"
    },
    {
        "show_id": 5,
        "name": "O Livro da Resistência - Capítulo 1: Batendo na Porta do Céu",
        "season": 3,
        "episode": 6,
        "description": "Anissa luta pela vida. Jennifer tenta descobrir o que Brandon está planejando.",
        "when": "2019-11-18"
    },
    {
        "show_id": 5,
        "name": "O Livro da Resistência - Capítulo 2: Opus de Henderson",
        "season": 3,
        "episode": 7,
        "description": "A resistência acirra a luta contra a ASA. Gambi e Lynn descobrem a verdade sobre Khalil. Anissa pede um favor ao pai.",
        "when": "2019-11-25"
    },
    {
        "show_id": 5,
        "name": "O Livro da Resistência - Capítulo 3: A Batalha de Franklin Terrace",
        "season": 3,
        "episode": 8,
        "description": "A ASA tenta despejar uma professora de sua casa, e Jefferson toma uma atitude. Anissa e Gambi tentam receber uma mensagem do mundo exterior.",
        "when": "2019-12-02"
    },
    {
        "show_id": 5,
        "name": "O Livro da Resistência - Capítulo 4: Terceira Pedra a Partir do Sol",
        "season": 3,
        "episode": 9,
        "description": "Uma tempestade transporta Jennifer a dimensões paralelas. Odell quer transformar os metas do campo em armas.",
        "when": "2019-12-09"
    },
    {
        "show_id": 5,
        "name": "O Livro de Markovia - Capítulo 1: Bênçãos e Maldições Renascem",
        "season": 3,
        "episode": 10,
        "description": "Jennifer está de volta com um novo objetivo. O comportamento de Lynn preocupa sua família.",
        "when": "2020-01-20"
    },
    {
        "show_id": 5,
        "name": "O Livro de Markovia – Capítulo 2: O Vício de Lynn",
        "season": 3,
        "episode": 11,
        "description": "Lynn traça um plano para entrar na Cova. Jefferson e Anissa entram em ação contra Odell. Jennifer fica cara a cara com Khalil.",
        "when": "2020-01-27"
    },
    {
        "show_id": 5,
        "name": "O Livro de Markovia – Capítulo 3: Sem Mãe",
        "season": 3,
        "episode": 12,
        "description": "A Dra. Jace tenta convencer Lynn a desistir da fórmula de estabilização. Jefferson e Anissa formam uma equipe de resgate. TC se aventura no cérebro de Khalil.",
        "when": "2020-02-03"
    },
    {
        "show_id": 5,
        "name": "O Livro de Markovia – Capítulo 4: Segure Firme",
        "season": 3,
        "episode": 13,
        "description": "A equipe treina para a missão, e a tensão aumenta. Lynn é alvo dos poderes de um novo comandante markoviano. Khalil pensa nos próximos passos.",
        "when": "2020-02-10"
    },
    {
        "show_id": 5,
        "name": "O Livro de Guerra – Capítulo 1: Festa de Boas-Vindas",
        "season": 3,
        "episode": 14,
        "description": "Os Pierces abrem o jogo, e os perdis são atacados. Khalil começa a falhar, e Gambi descobre a identidade do primeiro meta.",
        "when": "2020-02-24"
    },
    {
        "show_id": 5,
        "name": "O Livro da Guerra – Capítulo 2: A Liberdade Não é de Graça",
        "season": 3,
        "episode": 15,
        "description": "Com ajuda do soro de Lynn, avançam os preparativos para a invasão de Freeland. Anissa e Grace planejam uma grande noite para a família. Jennifer tem um plano secreto.",
        "when": "2020-03-02"
    },
    {
        "show_id": 5,
        "name": "O Livro da Guerra – Capítulo 3: Libertação",
        "season": 3,
        "episode": 16,
        "description": "A ASA luta para destruir provas dos experimentos. Os Pierces e seus aliados se preparam para o confronto que mudará Freeland para sempre.",
        "when": "2020-03-09"
    },
    {
        "show_id": 5,
        "name": "Episódio 1",
        "season": 4,
        "episode": 1,
        "description": "",
        "when": "2021-02-08"
    },
    {
        "show_id": 5,
        "name": "Episódio 2",
        "season": 4,
        "episode": 2,
        "description": "",
        "when": "2021-02-15"
    },
    {
        "show_id": 5,
        "name": "Episódio 3",
        "season": 4,
        "episode": 3,
        "description": "",
        "when": "2021-02-22"
    },
    {
        "show_id": 5,
        "name": "Episódio 4",
        "season": 4,
        "episode": 4,
        "description": "",
        "when": "2021-03-01"
    },
    {
        "show_id": 5,
        "name": "Episódio 5",
        "season": 4,
        "episode": 5,
        "description": "",
        "when": "2021-03-08"
    },
    {
        "show_id": 5,
        "name": "Episódio 6",
        "season": 4,
        "episode": 6,
        "description": "",
        "when": "2021-03-15"
    },
    {
        "show_id": 5,
        "name": "Episódio 7",
        "season": 4,
        "episode": 7,
        "description": "",
        "when": "2021-04-12"
    },
    {
        "show_id": 5,
        "name": "Episódio 8",
        "season": 4,
        "episode": 8,
        "description": "",
        "when": "2021-04-19"
    },
    {
        "show_id": 5,
        "name": "Episódio 9",
        "season": 4,
        "episode": 9,
        "description": "",
        "when": "2021-04-26"
    },
    {
        "show_id": 5,
        "name": "Episódio 10",
        "season": 4,
        "episode": 10,
        "description": "",
        "when": "2021-05-03"
    },
    {
        "show_id": 5,
        "name": "Episódio 11",
        "season": 4,
        "episode": 11,
        "description": "",
        "when": "2021-05-10"
    },
    {
        "show_id": 5,
        "name": "Episódio 12",
        "season": 4,
        "episode": 12,
        "description": "",
        "when": "2021-05-17"
    },
    {
        "show_id": 5,
        "name": "Episódio 13",
        "season": 4,
        "episode": 13,
        "description": "",
        "when": "2021-05-24"
    },
    {
        "show_id": 6,
        "name": "Piloto",
        "season": 1,
        "episode": 1,
        "description": "Armada com anos de brutal treinamento militar e paixão pela justiça social, Kate Kane continua o legado de seu primo desaparecido, Bruce Wayne, e vigia las ruas sombrias de Gotham como Batwoman.",
        "when": "2019-10-06"
    },
    {
        "show_id": 6,
        "name": "The Rabbit Hole",
        "season": 1,
        "episode": 2,
        "description": "Kate Kane é assombrada pelos eventos que cercam a morte de sua irmã. Enquanto Gotham aguardo o retorno de Batman, Kate se volta para o legado de Bruce em busca de inspiração, enquanto Luke Fox é atraído para o heroísmo justiceiro de Batwoman.",
        "when": "2019-10-13"
    },
    {
        "show_id": 6,
        "name": "Down, Down, Down",
        "season": 1,
        "episode": 3,
        "description": "Enquanto a cidade espera impacientemente por outra visita de \"Batman\", Alice continua a provocar Kate com um segredo, mas também volta sua atenção para Jacob e Catherine. Kate é visitada por Tommy Elliot, um amigo de infância de Bruce Wayne.",
        "when": "2019-10-20"
    },
    {
        "show_id": 6,
        "name": "Who Are You?",
        "season": 1,
        "episode": 4,
        "description": "Enquanto um novo vilão aparece na cidade, Kate tenta encontrar um equilíbrio entre sua vida pessoal e seu papel como Batwoman. Catherine tem um encontro desconfortável com Alice, e Luke continua a ajustar o arsenal de Batwoman.",
        "when": "2019-10-27"
    },
    {
        "show_id": 6,
        "name": "Mine Is A Long And Sad Tale",
        "season": 1,
        "episode": 5,
        "description": "Alice leva Kate pela triste e sinuosa estrada de sua vida nos dias após o acidente enquanto Jacob e Sophie tentam rastreá-las. Uma discussão leva Mary a procurar Kate na Torre Wayne, mas ela acaba se tornando uma companhia indesejável para Luke.",
        "when": "2019-11-03"
    },
    {
        "show_id": 6,
        "name": "I'll Be Judge, I'll Be Jury",
        "season": 1,
        "episode": 6,
        "description": "Uma morte perturbadora deixa Gotham cambaleando e a cidade procura seu novo herói vigilante. Enquanto isso, Alice continua sua trama nefasta contra os Kanes, e Batwoman faz outra visita a Mary.",
        "when": "2019-11-10"
    },
    {
        "show_id": 6,
        "name": "Tell Me The Truth",
        "season": 1,
        "episode": 7,
        "description": "Kate e Sophie devem se reconciliar com seu passado, enquanto Kate questiona o quanto pode confiar em seu ex-amante. Alice tem outro plano nefasto, mas seus motivos não são tão óbvios.",
        "when": "2019-11-17"
    },
    {
        "show_id": 6,
        "name": "A Mad Tea-Party",
        "season": 1,
        "episode": 8,
        "description": "Kate e Alice continuam com sua dinâmica de irmãs/inimigas, enquanto Alice e Mouse elaboram seu plano mais maligno até o momento. Mary convida Kate para um evento especial em homenagem a Catherine, e Jacob toma uma decisão que deixa Kate perplexa.",
        "when": "2019-12-01"
    },
    {
        "show_id": 6,
        "name": "Crise nas Terras Infinitas - Parte 2",
        "season": 1,
        "episode": 9,
        "description": "O verdadeiro Clark Kent pode, por favor, se levantar? A Crise continua. O grupo usa a invenção de Ray Palmer para rastrear novos recrutas para ajudar a salvar o universo. Kate e Kara Danvers saem em busca de Bruce Wayne.",
        "when": "2019-12-09"
    },
    {
        "show_id": 6,
        "name": "How Queer Everything is Today!",
        "season": 1,
        "episode": 10,
        "description": "Enquanto Gotham se ocupa reagindo ao embaraçoso encontro de Batwoman, Alice celebra seu último ato de vingança com Mouse. Uma Mary devastada se concentra no julgamento de Jacob Kane, enquanto Sophie procura conselhos sobre sua vida amorosa.",
        "when": "2020-01-19"
    },
    {
        "show_id": 6,
        "name": "An Un-Birthday Present",
        "season": 1,
        "episode": 11,
        "description": "No aniversário das irmãs Kane, Kate e Alice enfrentam demônios do passado. Um hóspede inesperado faz uma aparição surpresa em Gotham.",
        "when": "2020-01-26"
    },
    {
        "show_id": 6,
        "name": "Take Your Choice",
        "season": 1,
        "episode": 12,
        "description": "Enquanto Kate é pressionada por duas irmãs, Luke e Mary devem procurar a causa por trás das dores de cabeça debilitantes de Beth. Um visitante dá boas notícias a Jacob. Sophie leva seu novo papel ao extremo e Alice faz uma descoberta devastadora.",
        "when": "2020-02-16"
    },
    {
        "show_id": 6,
        "name": "Drink Me",
        "season": 1,
        "episode": 13,
        "description": "Uma nova vilão crava seus dentes em Gotham City durante uma importante inauguração. Sophie pede a Batwoman que se afaste, sabendo que suas interações poderiam prejudicar sua carreira.",
        "when": "2020-02-23"
    },
    {
        "show_id": 6,
        "name": "Grinning From Ear to Ear",
        "season": 1,
        "episode": 14,
        "description": "Batwoman e Luke estão na trilha de um vilão mirando especialistas em mídias sociais. Sophie recebe uma visita inesperada de sua mãe e Mary oferece seus conhecimentos para ajudar Kate. Jacob Kane paga uma dívida.",
        "when": "2020-03-08"
    },
    {
        "show_id": 6,
        "name": "Off with Her Head",
        "season": 1,
        "episode": 15,
        "description": "Mais do passado sombrio de Alice é descoberto quando August Cartwright compartilha uma história com Kate quando Jacob procura sua filha rebelde. Mary e Luke seguem uma pista sobre o assassino de Beth.",
        "when": "2020-03-15"
    },
    {
        "show_id": 6,
        "name": "Through the Looking Glass",
        "season": 1,
        "episode": 16,
        "description": "Kate começa a questionar seus instintos e Luke recebe notícias perturbadoras. Alice procura a ajuda de sua irmã.",
        "when": "2020-03-22"
    },
    {
        "show_id": 6,
        "name": "A Narrow Escape",
        "season": 1,
        "episode": 17,
        "description": "Batwoman encontra um novo desafio quando um velho vilão reaparece, testando o heroísmo dos cidadãos mais firmes de Gotham. Enquanto isso, os limites de Alice são testados.",
        "when": "2020-04-26"
    },
    {
        "show_id": 6,
        "name": "If You Believe In Me, I'll Believe in You",
        "season": 1,
        "episode": 18,
        "description": "Batwoman recruta Luke e Julia Pennyworth para uma missão secreta para recuperar um dos elementos mais importantes do arsenal de seu primo.",
        "when": "2020-05-03"
    },
    {
        "show_id": 6,
        "name": "A Secret Kept From All the Rest",
        "season": 1,
        "episode": 19,
        "description": "Quando os acadêmicos de Gotham começam a desaparecer, o comandante Kane, Sophie e os Crows investigam a nova ameaça.",
        "when": "2020-05-10"
    },
    {
        "show_id": 6,
        "name": "O, Mouse",
        "season": 1,
        "episode": 20,
        "description": "O Comandante Kane continua sua guerra contra Batwoman, deixando Kate desconsolada pela decisão de seu pai.",
        "when": "2020-05-17"
    },
    {
        "show_id": 6,
        "name": "Episódio 1",
        "season": 2,
        "episode": 1,
        "description": "",
        "when": "2021-01-17"
    },
    {
        "show_id": 6,
        "name": "Episódio 2",
        "season": 2,
        "episode": 2,
        "description": "",
        "when": "2021-01-24"
    },
    {
        "show_id": 6,
        "name": "Episódio 3",
        "season": 2,
        "episode": 3,
        "description": "",
        "when": "2021-01-31"
    },
    {
        "show_id": 6,
        "name": "Episódio 4",
        "season": 2,
        "episode": 4,
        "description": "",
        "when": "2021-02-14"
    },
    {
        "show_id": 6,
        "name": "Episódio 5",
        "season": 2,
        "episode": 5,
        "description": "",
        "when": "2021-02-21"
    },
    {
        "show_id": 6,
        "name": "Episódio 6",
        "season": 2,
        "episode": 6,
        "description": "",
        "when": "2021-02-28"
    },
    {
        "show_id": 6,
        "name": "Episódio 7",
        "season": 2,
        "episode": 7,
        "description": "",
        "when": "2021-03-14"
    },
    {
        "show_id": 6,
        "name": "Episódio 8",
        "season": 2,
        "episode": 8,
        "description": "",
        "when": "2021-03-21"
    },
    {
        "show_id": 6,
        "name": "Episódio 9",
        "season": 2,
        "episode": 9,
        "description": "",
        "when": "2021-03-28"
    },
    {
        "show_id": 6,
        "name": "Episódio 10",
        "season": 2,
        "episode": 10,
        "description": "",
        "when": "2021-04-11"
    },
    {
        "show_id": 6,
        "name": "Episódio 11",
        "season": 2,
        "episode": 11,
        "description": "",
        "when": "2021-04-18"
    },
    {
        "show_id": 6,
        "name": "Episódio 12",
        "season": 2,
        "episode": 12,
        "description": "",
        "when": "2021-05-02"
    },
    {
        "show_id": 6,
        "name": "Episódio 13",
        "season": 2,
        "episode": 13,
        "description": "",
        "when": "2021-05-09"
    },
    {
        "show_id": 6,
        "name": "Episódio 14",
        "season": 2,
        "episode": 14,
        "description": "",
        "when": "2021-05-16"
    },
    {
        "show_id": 6,
        "name": "Episódio 15",
        "season": 2,
        "episode": 15,
        "description": "",
        "when": "2021-06-06"
    },
    {
        "show_id": 6,
        "name": "Episódio 16",
        "season": 2,
        "episode": 16,
        "description": "",
        "when": "2021-06-13"
    },
    {
        "show_id": 6,
        "name": "Episódio 17",
        "season": 2,
        "episode": 17,
        "description": "",
        "when": "2021-06-20"
    },
    {
        "show_id": 6,
        "name": "Episódio 18",
        "season": 2,
        "episode": 18,
        "description": "",
        "when": "2021-06-27"
    },
    {
        "show_id": 6,
        "name": "Episódio 1",
        "season": 3,
        "episode": 1,
        "description": "",
        "when": "2021-10-13"
    },
    {
        "show_id": 6,
        "name": "Episódio 2",
        "season": 3,
        "episode": 2,
        "description": "",
        "when": "2021-10-20"
    },
    {
        "show_id": 7,
        "name": "Episódio 1",
        "season": 1,
        "episode": 1,
        "description": "",
        "when": "2015-08-25"
    },
    {
        "show_id": 7,
        "name": "Episódio 2",
        "season": 1,
        "episode": 2,
        "description": "",
        "when": "2015-09-01"
    },
    {
        "show_id": 7,
        "name": "Episódio 3",
        "season": 1,
        "episode": 3,
        "description": "",
        "when": "2015-09-08"
    },
    {
        "show_id": 7,
        "name": "Episódio 4",
        "season": 1,
        "episode": 4,
        "description": "",
        "when": "2015-09-15"
    },
    {
        "show_id": 7,
        "name": "Episódio 5",
        "season": 1,
        "episode": 5,
        "description": "",
        "when": "2015-09-22"
    },
    {
        "show_id": 7,
        "name": "Episódio 6",
        "season": 1,
        "episode": 6,
        "description": "",
        "when": "2015-09-29"
    },
    {
        "show_id": 7,
        "name": "Episódio 1",
        "season": 2,
        "episode": 1,
        "description": "",
        "when": "2016-10-13"
    },
    {
        "show_id": 7,
        "name": "Episódio 2",
        "season": 2,
        "episode": 2,
        "description": "",
        "when": "2016-10-21"
    },
    {
        "show_id": 7,
        "name": "Episódio 3",
        "season": 2,
        "episode": 3,
        "description": "",
        "when": "2016-10-28"
    },
    {
        "show_id": 7,
        "name": "Episódio 4",
        "season": 2,
        "episode": 4,
        "description": "",
        "when": "2016-11-04"
    },
    {
        "show_id": 7,
        "name": "Episódio 5",
        "season": 2,
        "episode": 5,
        "description": "",
        "when": "2016-11-11"
    },
    {
        "show_id": 7,
        "name": "Episódio 6",
        "season": 2,
        "episode": 6,
        "description": "",
        "when": "2016-11-18"
    },
    {
        "show_id": 8,
        "name": "Non Est Asylum",
        "season": 1,
        "episode": 1,
        "description": "Um caçador de demônios e mestre do oculto retorna a batalhar contra o pior que o inferno tem a oferecer, a fim de ajudar a filha de um velho amigo. Além disso, existe uma pequena possibilidade de salvar sua própria alma condenada.",
        "when": "2014-10-24"
    },
    {
        "show_id": 8,
        "name": "A Escuridão Oculta",
        "season": 1,
        "episode": 2,
        "description": "Nas montanhas do oeste da Pensilvânia, John é a única defesa de uma pequena comunidade contra um antigo espírito zombeteiro. Para proteger esses inocentes isolados, John encontra uma misteriosa e vital aliada em uma jovem chamada Zed.",
        "when": "2014-10-31"
    },
    {
        "show_id": 8,
        "name": "O Vinil do Diabo",
        "season": 1,
        "episode": 3,
        "description": "John e Zed se deparam com um confronto perigoso para salvar uma mulher e sua família de forças sinistras. Os esforços de John o levam a confrontar a escuridão em sua própria vida.",
        "when": "2014-11-07"
    },
    {
        "show_id": 8,
        "name": "Um Festim de Amigos",
        "season": 1,
        "episode": 4,
        "description": "Quando o velho amigo de Constantine, Gary Lester, acidentalmente libera um demônio poderoso em Atlanta, John é forçado a ponderar o que está preparado para sacrificar em sua batalha contra o inferno.",
        "when": "2014-11-14"
    },
    {
        "show_id": 8,
        "name": "Danse Vaudou",
        "season": 1,
        "episode": 5,
        "description": "Em Nova Orleans, o conhecimento pouco usual de Constantine sobre uma série de crimes traz problemas com o detetive Jim Corrigan.",
        "when": "2014-11-21"
    },
    {
        "show_id": 8,
        "name": "Raiva de Caliban",
        "season": 1,
        "episode": 6,
        "description": "Um jovem é vítima de um espírito maléfico, o que leva John a colocar de lado suas reservas sobre exorcizar uma criança, a fim de convencer os pais de que o garoto não é o que parece.",
        "when": "2014-11-28"
    },
    {
        "show_id": 8,
        "name": "Abençoados são os...",
        "season": 1,
        "episode": 7,
        "description": "Durante a aula de arte, Zed lida com a visão bizarra de cobras, levando ela e John para uma pequena cidade. Ali, um pregador ganhou a habilidade de curar toda sua congregação.",
        "when": "2014-12-05"
    },
    {
        "show_id": 8,
        "name": "O Santo de Último Recurso",
        "season": 1,
        "episode": 8,
        "description": "Uma ligação de Anne Marie, um membro da equipe de Newcastle, leva John e Chas para a Cidade do México e mais perto da fonte da escuridão que surge. Enquanto isso, o passado de Zed volta para assombrá-la.",
        "when": "2014-12-12"
    },
    {
        "show_id": 8,
        "name": "O Santo de Último Recurso: Parte 2",
        "season": 1,
        "episode": 9,
        "description": "John invoca um demônio para ajudá-lo a se defender de um ataque.",
        "when": "2015-01-16"
    },
    {
        "show_id": 8,
        "name": "Quid Pro Quo",
        "season": 1,
        "episode": 10,
        "description": "Centenas de pessoas por todo o Brooklyn estão imersas em um misterioso coma, incluindo a filha de Chas. Agora, John precisa encontrar e acabar com o mal antes que ele consuma a cidade.",
        "when": "2015-01-23"
    },
    {
        "show_id": 8,
        "name": "Um Mundo Inteiro lá Fora",
        "season": 1,
        "episode": 11,
        "description": "Manny envia John para ajudar um velho amigo, Ritchie Simpson, na Ivy University, já que um grupo de estudantes encontrou uma forma de abrir o portal para uma dimensão alternativa, apenas para se depararem com um assassino maníaco.",
        "when": "2015-01-30"
    },
    {
        "show_id": 8,
        "name": "Anjos e Ministros de Graça",
        "season": 1,
        "episode": 12,
        "description": "John vai até o hospital local para investigar um misterioso local, chamando Manny para ajudá-lo. Enquanto isso, um susto de saúde leva Zed a questionar a fonte de suas visões.",
        "when": "2015-02-06"
    },
    {
        "show_id": 8,
        "name": "À Espera do Homem",
        "season": 1,
        "episode": 13,
        "description": "John e Zed retornam a Nova Orleans quando o detetive Jim Corrigan pede ajuda em um caso envolvendo uma garotinha desaparecida. Enquanto isso, Papa Midnite dá mais um passo para executar sua vingança contra John.",
        "when": "2015-02-13"
    },
    {
        "show_id": 9,
        "name": "Episódio 1",
        "season": 1,
        "episode": 1,
        "description": "",
        "when": "2017-12-08"
    },
    {
        "show_id": 9,
        "name": "Episódio 2",
        "season": 1,
        "episode": 2,
        "description": "",
        "when": "2017-12-08"
    },
    {
        "show_id": 9,
        "name": "Episódio 3",
        "season": 1,
        "episode": 3,
        "description": "",
        "when": "2017-12-08"
    },
    {
        "show_id": 9,
        "name": "Episódio 4",
        "season": 1,
        "episode": 4,
        "description": "",
        "when": "2017-12-08"
    },
    {
        "show_id": 9,
        "name": "Episódio 5",
        "season": 1,
        "episode": 5,
        "description": "",
        "when": "2017-12-08"
    },
    {
        "show_id": 9,
        "name": "Episódio 6",
        "season": 1,
        "episode": 6,
        "description": "",
        "when": "2017-12-08"
    },
    {
        "show_id": 9,
        "name": "Episódio 1",
        "season": 2,
        "episode": 1,
        "description": "",
        "when": "2018-07-18"
    },
    {
        "show_id": 9,
        "name": "Episódio 2",
        "season": 2,
        "episode": 2,
        "description": "",
        "when": "2018-07-18"
    },
    {
        "show_id": 9,
        "name": "Episódio 3",
        "season": 2,
        "episode": 3,
        "description": "",
        "when": "2018-07-18"
    },
    {
        "show_id": 9,
        "name": "Episódio 4",
        "season": 2,
        "episode": 4,
        "description": "",
        "when": "2018-07-18"
    },
    {
        "show_id": 9,
        "name": "Episódio 5",
        "season": 2,
        "episode": 5,
        "description": "",
        "when": "2018-07-18"
    },
    {
        "show_id": 9,
        "name": "Episódio 6",
        "season": 2,
        "episode": 6,
        "description": "",
        "when": "2018-07-18"
    },
    {
        "show_id": 10,
        "name": "Piloto",
        "season": 1,
        "episode": 1,
        "description": "Clark Kent e Lois Lane se deparam com um de seus maiores desafios - lidar com as pressões que surgem por serem pais que trabalham na sociedade de hoje.",
        "when": "2021-02-23"
    },
    {
        "show_id": 10,
        "name": "Herança",
        "season": 1,
        "episode": 2,
        "description": "Enquanto se ajustavam à nova vida em Smallville, Lois e Clark tomam uma importante decisão em relação a um de seus filhos. Enquanto isso, as tensões começam a aumentar entre Lois e Morgan Edge. Por fim, Lana Lang Cushing convida a família Kent para um churrasco.",
        "when": "2021-03-02"
    },
    {
        "show_id": 10,
        "name": "As vantagens de não ser uma planta",
        "season": 1,
        "episode": 3,
        "description": "Clark compartilha um pouco de sua história kryptoniana com Jordan e Jonathan durante um café da manhã em família. Enquanto isso, Lois e Chrissy vão mais fundo para descobrir a verdade sobre Morgan Edge.",
        "when": "2021-03-09"
    },
    {
        "show_id": 10,
        "name": "Louco",
        "season": 1,
        "episode": 4,
        "description": "Lois e Chrissy avistam Morgan Edge conversando com o prefeito Dean e Kyle Kushing, e os dois percebem seu movimento insincero para tentar conquistar a cidade. Clark concorda em ajudar Lois em uma reunião na prefeitura.",
        "when": "2021-03-16"
    },
    {
        "show_id": 10,
        "name": "O melhor de Smallville",
        "season": 1,
        "episode": 5,
        "description": "Enquanto Smallville celebra seu primeiro Festival da Colheita desde a morte de Martha, Clark se lembra do que sua mãe significava para ele e aprende uma lição que o ajudará a superar sua morte. Enquanto isso, Lois faz uma descoberta na investigação de Morgan Edge. Por último, Kyle tenta se reconectar com Lana, mas parece que ele pode estar voltando aos seus velhos hábitos.",
        "when": "2021-03-23"
    },
    {
        "show_id": 10,
        "name": "Cheira a espírito adolescente",
        "season": 1,
        "episode": 6,
        "description": "",
        "when": "2021-05-18"
    },
    {
        "show_id": 10,
        "name": "Homem de Aço",
        "season": 1,
        "episode": 7,
        "description": "",
        "when": "2021-05-25"
    },
    {
        "show_id": 10,
        "name": "Episódio 8",
        "season": 1,
        "episode": 8,
        "description": "",
        "when": "2021-06-01"
    },
    {
        "show_id": 10,
        "name": "Episódio 9",
        "season": 1,
        "episode": 9,
        "description": "",
        "when": "2021-06-08"
    },
    {
        "show_id": 10,
        "name": "Episódio 10",
        "season": 1,
        "episode": 10,
        "description": "",
        "when": "2021-06-15"
    },
    {
        "show_id": 10,
        "name": "Episódio 11",
        "season": 1,
        "episode": 11,
        "description": "",
        "when": "2021-06-22"
    },
    {
        "show_id": 10,
        "name": "Episódio 12",
        "season": 1,
        "episode": 12,
        "description": "",
        "when": "2021-07-13"
    },
    {
        "show_id": 10,
        "name": "Episódio 13",
        "season": 1,
        "episode": 13,
        "description": "",
        "when": "2021-07-20"
    },
    {
        "show_id": 10,
        "name": "Episódio 14",
        "season": 1,
        "episode": 14,
        "description": "",
        "when": "2021-08-10"
    },
    {
        "show_id": 10,
        "name": "Episódio 15",
        "season": 1,
        "episode": 15,
        "description": "",
        "when": "2021-08-17"
    }
]